[
{
    "time": "2024-04-27T20:59:36.000Z",
    "tweet_text": "1. LFG\n2. Since when was EU bigger than US (I must have missed that)\n3. Deng had the right idea, Xi went back to communism. Lucky us.\n4. ⁠Japan shows us what happens when you hit debt to GDP of 250%\n\nU.S. now doing its best to run the Japan experiment as fast as possible (debt…"
},
{
    "time": "2024-04-27T14:43:10.000Z",
    "tweet_text": "This year, the U.S. will account for 26.3% of global GDP, the most since 2006."
},
{
    "time": "2024-04-27T01:35:26.000Z",
    "tweet_text": "Dubai is building."
},
{
    "time": "2024-04-26T15:50:52.000Z",
    "tweet_text": "Look how easy this is! Thank you @standwithcrypto.\n\nEnter the following information and @coinbase will generate a personalized email for you to send to your congressperson supporting #crypto. \n\nhttps://standwithcrypto.org/action/email\nPlease Repost & Share."
},
{
    "time": "2024-04-26T05:14:31.000Z",
    "tweet_text": "",
    "repost_text": "Today, Consensys took an important step towards preserving access to ether and by extension the Ethereum blockchain in the U.S. We are suing the SEC and fighting back against its overzealous regulatory overreach. You can find more of my thoughts here: \n\nhttps://consensys.io/blog/consensys-suing-sec-to-defend-ethereum-ecosystem……"
},
{
    "time": "2024-04-25T19:59:26.000Z",
    "tweet_text": "I know ETH is a commodity. You know ETH is a commodity. The CFTC knows ETH is a commodity. It's time for the SEC to admit that it still knows ETH is a commodity too. No more games. Thank you to @Consensys for standing up against the SEC's unlawful expansion of authority.",
    "repost_text": "Today, Consensys filed a lawsuit against the Securities and Exchange Commission. \n\nThe goal behind this is to ensure that Ethereum remains a vibrant and indispensable blockchain platform and to preserve access for the countless developers, market participants, and institutions…"
},
{
    "time": "2024-04-25T14:49:21.000Z",
    "tweet_text": "Fun fact - the team actually built that pizza slicer \n\nI assumed it was CGI but no",
    "repost_text": "Another fantastic @coinbase ad  x.com/coinbase/statu…"
},
{
    "time": "2024-04-24T03:19:55.000Z",
    "tweet_text": "Wow - very cool",
    "repost_text": " Get paid serious money to take me from basic to post-doc ++ levels of wisdom in physics \n\nTo make this happen, I’m personally investing 52,000 $RSC over the next year.\n\nEvery week, I’ll accept a tutor (repeat tutors are welcome) and pay 520 $RSC tokens in exchange for 2… x.com/josephjacks_/s…"
},
{
    "time": "2024-04-23T22:09:59.000Z",
    "tweet_text": "thanks to @brian_armstrong and @dhh for participating. working on this piece was a total blast. our long winter of silence, and every batshit crazy thing we allowed to happen in those years we didn't speak up, is a period of tech history that needs to be remembered.",
    "repost_text": "Mission Accomplished \nEXCLUSIVE: activism in the workplace is over. coinbase CEO and mission-first architect brian armstrong shares his advice to google with @micsolana, DHH on the mission-first journey that saved his company, and a retrospective on tech’s long, silent winter…"
},
{
    "time": "2024-04-23T20:05:37.000Z",
    "tweet_text": "If you have the right backend skills and care deeply about crypto, this job and team is probably one of the best to work on at @coinbase. Definitely don’t sleep on this opportunity it’s gonna be a moon mission."
},
{
    "time": "2024-04-22T15:54:27.000Z",
    "tweet_text": "epic illustration of how easy the smart wallet is",
    "repost_text": "@CoinbaseWallet Smart Wallet is magical! We implemented v1 internally in an hour.\n\nCheck out a walkthrough video of Dynamic SDK integrated with the new Coinbase Smart wallet!\n\nMore details below "
},
{
    "time": "2024-04-23T04:46:28.000Z",
    "tweet_text": "This is going to be a fun one",
    "repost_text": "Smart Wallet is coming. Get excited.\n\nDevelopers: Join our early adopter list.\n→ http://coinbase.com/wallet/smart-wallet…"
},
{
    "time": "2024-04-23T03:57:19.000Z",
    "tweet_text": "Great progress - congrats @OrchidInc !",
    "repost_text": "SO INCREDIBLY PROUD to share 2 HUGE updates:\n\n1) The first baby was born using @OrchidInc technology — and he’s super cute  \n\n2) I tested my own embryos with Orchid — we got SO much information & l feel confident now  \n\nThis is the future of how babies will be born!"
},
{
    "time": "2024-04-20T21:51:39.000Z",
    "tweet_text": "Shocking",
    "repost_text": "\"Uber is a bad idea.\" - Taxis\n\n\"Airbnb is a bad idea.\" - Hotels\n\n\"Computers are a bad idea.\" - Newspapers \n\n\"#Bitcoin  is a bad idea.\" - Banks"
},
{
    "time": "2024-04-20T17:19:52.000Z",
    "tweet_text": "To the miners: Thank you for moving money forward #Bitcoin",
    "repost_text": "The fourth #Bitcoin halving is almost here.\nAnd a proper thank you is in order to the ones impacted the most.\n\nSo, to the miners…thank you for moving money forward."
},
{
    "time": "2024-04-20T03:38:09.000Z",
    "tweet_text": "Katie took a chance on us when we were a little known crypto exchange, back when very few people believed in the technology, and I'll always be grateful for that. She’s been our longest serving independent director - was our first audit/risk chair, was on our comp committee, and…",
    "repost_text": "I’ll be stepping off the @Coinbase board later this year at the end of my third term, after 7+ years. Crypto is in a remarkable expansion state, and Coinbase is well-positioned to thrive. @HaunVentures is similarly expanding, and this feels like the right time for me to…"
},
{
    "time": "2024-04-19T05:25:27.000Z",
    "tweet_text": "Pretty remarkable that the only press Zuck shared from the Llama 3 launch was @dwarkesh_sp and @rpnickson\n\nMeta did give embargoed comments to mainstream publishers, but only the independent interviewers got posted to his story.\n\nGOING DIRECT! @lulumeservey"
},
{
    "time": "2024-04-19T23:56:56.000Z",
    "tweet_text": "Awesome progress\n\nLet’s get to 1m crypto advocates who want to elect pro crypto candidates by November.\n\nShare to help spread the word.",
    "repost_text": " 400K ADVOCATES STRONG \n\nToday, Stand With Crypto passed 400K sign ups.\n\nIn 2024, the crypto constituency has swung elections, made history, and we are still early. This movement is for all of us and you can get involved today.\n\nBecome an advocate, contact your…"
},
{
    "time": "2024-04-19T15:57:17.000Z",
    "tweet_text": "It’s a great start. And it will probably take much more than this fully correct. (Like an exit package for some % of the company.)\n\nGoogle is a gem of American innovation, and the company I looked up to most growing up. I doubt they need it, but happy to help in any small way if…",
    "repost_text": "This prediction turned out to be accurate.  x.com/paulg/status/1…"
},
{
    "time": "2024-04-18T15:06:20.000Z",
    "tweet_text": "Good to see ",
    "repost_text": "Today, all SAFU assets will be converted to $USDC, bolstering reliability and stability at $1bn.\n\nRead more \nhttps://binance.com/en/blog/ecosystem/update-safu-conversion-to-usdc-270057093957213098?ref=AZTKZ9XS&utm_source=BinanceTwitter&utm_medium=GlobalSocial&utm_campaign=GlobalSocial…"
},
{
    "time": "2024-04-17T17:00:51.000Z",
    "tweet_text": "Just register the token but not necessarily “all the stuff” around it. Or suffer lawsuits and case law in the meantime that are so muddled that they require the Supreme Court to provide “definitive clarity.”  This is your government at work.",
    "repost_text": "I attended a talk last night with recently departed SEC crypto litigation leader Ladan Stewart, where she debated with @RebeccaRettig1 and @NYcryptolawyer over her agency's controversial approach. \n\nIn one notable exchange, Stewart said the SEC does not view tokens as securities,…"
},
{
    "time": "2024-04-16T16:34:06.000Z",
    "tweet_text": "We at the SEC need to do our part to ensure that the US is a \"Why not?\" kind of place where people are free to pursue their dreams: https://sec.gov/news/speech/peirce-remarks-association-private-enterprise-education-040824…"
},
{
    "time": "2024-04-17T03:18:58.000Z",
    "tweet_text": "This is very true - looking into how we enable this more at @coinbase\n@base is a recent example that worked",
    "repost_text": "The ultimate unfair advantage: startup people who are left alone to do startup things in a big company with lots of cash and distribution.\n\nIt's rare, but when it happens, it's like witnessing magic.\n\nTake, for example, Cash App. It was originally created at a Square/Block…"
},
{
    "time": "2024-04-17T03:20:48.000Z",
    "tweet_text": "and USDC is another that worked bottoms up (in conjunction with @Circle)"
},
{
    "time": "2024-04-16T00:54:28.000Z",
    "tweet_text": "Relentless Forward Progress"
},
{
    "time": "2024-04-15T18:53:40.000Z",
    "tweet_text": "We've been ramping up usage of AI tools on our design team at @coinbase\n\nTwo examples:\n1. Write a text prompt and get a figma mockup as a starting point for your design\n2. Click a button and turn any figma design into front-end code\n\nThe front-end code it generates adheres to our…"
},
{
    "time": "2024-04-14T06:18:45.000Z",
    "tweet_text": "Thought this was AI generated at first but appears to be real\n\nGet this man some Bitcoin ",
    "repost_text": "\"If you care about your fucking country, read Ludwig von Mises and the six lessons of the Austrian economic school, motherfuckers.\"\n\n- @moicanoufc"
},
{
    "time": "2024-04-11T17:17:13.000Z",
    "tweet_text": "We received this letter from FinCEN congratulating @coinbase on our substantial contributions to one of seven significant criminal cases to receive the FinCEN Director's Law Enforcement Award.  We appreciate this recognition of our commitment to weeding out bad actors in whatever…"
},
{
    "time": "2024-04-12T15:08:29.000Z",
    "tweet_text": "Less than 12h after @yugacohler asked this question the @ResearchHubF crowdfunded a $1k bounty in $RSC for the publication of an up-to-date literature review on the health impacts of nicotine pouches\n\nClick below to follow the progress\nhttps://researchhub.com/question/2025/literature-review-are-zyns-bad-for-your-health…",
    "repost_text": "Does anybody have high-quality, up-to-date scientific data on the harms or lack thereof of Zyn?"
},
{
    "time": "2024-04-11T16:41:49.000Z",
    "tweet_text": "More changes to share - we launched a new Discord dedicated to our Developer Platform.\n\nIf you want to connect with other builders, ask questions, or even just say ‘gm’, you can join in the conversation here:"
},
{
    "time": "2024-04-12T15:11:55.000Z",
    "tweet_text": "",
    "repost_text": "Six years and counting, it’s so much fun to work with this Exec team at @coinbase."
},
{
    "time": "2024-04-11T16:53:24.000Z",
    "tweet_text": "Egregious actions like this by Gary Gensler’s SEC are why American crypto companies currently fear building in America. When I’m Senator, I will bring the SEC to heel and ensure safety for all of America’s entrepreneurs.",
    "repost_text": "Today @Uniswap Labs received a Wells notice from the SEC. \n\nI’m not surprised. Just annoyed, disappointed, and ready to fight. \n\nI am confident that the products we offer are legal and that our work is on the right side of history. But it’s been clear for a while that rather than…"
},
{
    "time": "2024-04-10T22:13:32.000Z",
    "tweet_text": "We’re excited to be among the first operators of @eigenlayer’s restaking ecosystem! Learn more about the key players we are working alongside ",
    "repost_text": "EigenLayer is live on main net\n\nExplore the AVSs, LRPs and Operators leading the restaking revolution\n\nInfinite sum games "
},
{
    "time": "2024-04-10T20:41:55.000Z",
    "tweet_text": "DeFi will have to fight back against baseless enforcement actions even with a crystal clear court ruling against the SEC.\n\nNow is the time to contact your representatives.\n\nFind your Senators and Members of Congress at http://standwithcrypto.org and use the tooling to email and…",
    "repost_text": "Sometimes you have to laugh or else you'll cry.  Question:  how can you square the @SECGov's claim that @Uniswap acts as a broker with the Court's ruling against the @SECGov  just a handful of days ago?  Answer:  you can't.  x.com/ammori/status/…"
},
{
    "time": "2024-04-10T22:42:52.000Z",
    "tweet_text": "I actually feel bad for the rank and file of the SEC, the vast majority are civil servants who aren't political (and don't get a say on choice of Chairman). They do important work on topics like transparency and market structure.\n\nBut all of that work is being negated as the…"
},
{
    "time": "2024-04-10T16:54:46.000Z",
    "tweet_text": "$5B\n\n↑"
},
{
    "time": "2024-04-11T01:08:39.000Z",
    "tweet_text": "I #StandWithCrypto in this November election - will you join?\n\nhttps://standwithcrypto.org",
    "repost_text": "Today @Uniswap Labs received a Wells notice from the SEC. \n\nI’m not surprised. Just annoyed, disappointed, and ready to fight. \n\nI am confident that the products we offer are legal and that our work is on the right side of history. But it’s been clear for a while that rather than…"
},
{
    "time": "2024-04-09T15:31:10.000Z",
    "tweet_text": "The rise and fall of the Sid Meier's Civilization franchise from 1991 to 2018 is both one of the great tragedies of the computer gaming industry, and a window into the massive change in psychology of the US ruling class. This thread will explore both."
},
{
    "time": "2024-04-05T19:40:51.000Z",
    "tweet_text": ">3m transactions (34 TPS) on @base for the first time yesterday"
},
{
    "time": "2024-04-05T20:09:04.000Z",
    "tweet_text": "We’re making some changes.\n\nOur goal is to create a platform that enables builders to bring the next billion users onchain.\n\nWe're making improvements to our developer products...but first we're giving ourselves a makeover.\n\nA few changes you'll notice:\n\n-Coinbase Cloud is now…"
},
{
    "time": "2024-04-03T22:46:29.000Z",
    "tweet_text": ".@HesterPeirce is a national treasure",
    "repost_text": "Go read @HesterPeirce’s speech from yesterday. Aside from knocking the current staff guidance approach (esp. SAB 121), and the Commission’s lack of industry engagement, and enforcement-first and bad-faith approach to rulemaking, this part (in advice to founders) REALLY jumps out:"
},
{
    "time": "2024-04-03T20:24:58.000Z",
    "tweet_text": "Has been great working with @lightspark on our Lightning integration which should be launching soon ",
    "repost_text": "Thrilled to announce that @Coinbase has selected @Lightspark to enable the #Bitcoin Lightning Network across its platform and services. Yet another significant milestone for Lightning! to many millions of new people and 100+ countries coming soon! http://bit.ly/3xkjwAH"
},
{
    "time": "2024-03-28T03:24:09.000Z",
    "tweet_text": "Every high quality project on mainnet is going to come to @Base, because there will be 10s of millions and eventually a billion+ people onchain coming through the incredible @Coinbase retail funnel and using smart wallets.\n\nThis is a dead simple way to migrate from mainnet. ",
    "repost_text": " Today, I’m excited to show off something fun we’ve been working on lately @BaseMigrate! \n\n1/  The Base Migration Tool is a game-changer for projects looking to migrate their ERC20 tokens to the Base  network. Say goodbye to manual processes and hello to a seamless…"
},
{
    "time": "2024-03-28T02:32:09.000Z",
    "tweet_text": "I want to use @base, @coinbase and buy $coin stock to just support the company that is the backbone of our industry. Centralized decentralized it doesn’t matter, what they are doing legally to pave the path for the rest of us to move on chain, makes them truly the MVP of Web3."
},
{
    "time": "2024-03-27T16:00:40.000Z",
    "tweet_text": "A quick knock out punch would have been nice, but at the end of the day, the wheels of justice move slowly, eventually siding with the good guys. The CB Judge gave the SEC the benefit of doubt at this early stage - as she must. This is far from over.",
    "repost_text": "Today, the Court decided that our SEC case will move forward on most of the claims, but dismissed the claims against Coinbase Wallet. We were prepared for this, and we look forward to uncovering more about the SEC’s internal views and discussions on crypto regulation. 1/6"
},
{
    "time": "2024-03-27T16:41:34.000Z",
    "tweet_text": "I can't wait for the hilariously bad takes in mainstream media on this ruling today.\n\nIf any particularly good ones please post screenshots  ",
    "repost_text": "Great progress on the SEC case - and huge win for self-custodial wallets. This ensures the onchain ecosystem will continue to innovate and create economic freedom around the world.\n\nWe'll continue fighting for your right to use crypto, and to get clarity around the rules, until… x.com/iampaulgrewal/…"
},
{
    "time": "2024-03-27T15:54:54.000Z",
    "tweet_text": "Great progress on the SEC case - and huge win for self-custodial wallets. This ensures the onchain ecosystem will continue to innovate and create economic freedom around the world.\n\nWe'll continue fighting for your right to use crypto, and to get clarity around the rules, until…",
    "repost_text": "Today, the Court decided that our SEC case will move forward on most of the claims, but dismissed the claims against Coinbase Wallet. We were prepared for this, and we look forward to uncovering more about the SEC’s internal views and discussions on crypto regulation. 1/6"
},
{
    "time": "2024-03-27T05:46:42.000Z",
    "tweet_text": "Illumina DNA sequencing machine at @newlimit today - interesting how they designed these to look futuristic\n\nNeed to keep scaling up the discovery platform"
},
{
    "time": "2024-03-26T21:29:42.000Z",
    "tweet_text": "We’re pleased to introduce cross collateral on Coinbase International Exchange for institutional users. Now, in addition to USDC, you can leverage your existing BTC and ETH as collateral allowing you to optimize your capital efficiency and strategically expand your positions in…"
},
{
    "time": "2024-03-26T21:00:40.000Z",
    "tweet_text": "Coinbase is building lots onchain looking toward the future.\n\nBut the industry also needs bridges to tradfi that help fiat move into crypto. For that, I think Coinbase is providing the most trusted infrastructure globally, including now for derivatives.\n\nhttps://international.coinbase.com",
    "repost_text": "Coinbase International sees record daily trading volume in March https://theblock.co/post/284500/coinbase-international-sees-record-daily-trading-volume-in-march?utm_source=twitter&utm_medium=social…"
},
{
    "time": "2024-03-26T04:02:37.000Z",
    "tweet_text": "Still a great read"
},
{
    "time": "2024-03-25T18:28:23.000Z",
    "tweet_text": ""
},
{
    "time": "2024-03-24T15:11:42.000Z",
    "tweet_text": "This little book is the company building philosophy of David Ogilvy broken down into bite-sized pieces. \n\nBuffett called Ogilvy a genius and this is a list of ideas Ogilvy wanted to pass on: \n\n1.  Discovery consists of seeing what everyone has seen and thinking what nobody has…"
},
{
    "time": "2024-03-23T21:08:18.000Z",
    "tweet_text": "Every saturday morning for the last 6 years, I watch this obscure video.\nIt's Jeff Bezos talking about leadership, but really, it's the most succinct blueprint for how to achieve greatness I have ever found.\nYou should watch it often, but I summarized it here: (thread, sry)"
},
{
    "time": "2024-03-23T05:34:00.000Z",
    "tweet_text": "Congrats!",
    "repost_text": "Today marks a big milestone toward the rebirth of supersonic passenger flight. For the first time in decades, a civil supersonic airplane has taken to the skies. The @boomaero XB-1 met all of its first flight objectives—and we’re only going further, higher, and faster from here."
},
{
    "time": "2024-03-21T14:45:18.000Z",
    "tweet_text": "To celebrate Reddit's IPO, I wrote something about what made them special (and still does):"
},
{
    "time": "2024-03-21T20:43:33.000Z",
    "tweet_text": "Yesterday we hosted a reception event with @standwithcrypto after the @coinbase Update the System event in D.C. A packed house! Happy to play our part helping leaders understand why voters care about this issue."
},
{
    "time": "2024-03-20T23:01:21.000Z",
    "tweet_text": "\n\nIf you’re a trader outside the U.S. onboard today: https://international.coinbase.com",
    "repost_text": "Did we say $4 billion? How about $6 billion in 24-hour notional trading volume?  http://international.coinbase.com"
},
{
    "time": "2024-03-20T16:11:34.000Z",
    "tweet_text": "We've been taking time to polish Advanced Mode on Coinbase mobile, and now it's live for everyone.",
    "repost_text": "Coinbase Advanced is now on mobile.\n\nRedesigned for the sophisticated trader on-the-go. From optimized navigation to a revamped portfolio experience, download the Coinbase app and toggle to Coinbase Advanced from the More Menu in the top left-hand corner. \n\nLearn more ↓"
},
{
    "time": "2024-03-20T20:00:15.000Z",
    "tweet_text": "If you’re in DC come check out @CompassCoffeeDC - you can pay with crypto (zero fees paying with USDC on Base), and get a free can of coffee if you mint their NFT.\n\n1201 Half St SE, Washington, DC 20003\n\nShout out to @slice__so for hosting the Point of Sale software  and…"
},
{
    "time": "2024-03-20T20:06:47.000Z",
    "tweet_text": "Many merchants pay 2-4% in fees to accept credit cards. You as the consumer are paying this fee one way or another in the form of higher prices.\n\nMerchants can accept USDC on Base for free (subsidized as the true cost is under 1 cent).\n\nCrypto is revolutionizing payments as layer…"
},
{
    "time": "2024-03-20T20:02:17.000Z",
    "tweet_text": "Live streaming shortly",
    "repost_text": "Can’t make it to today's #UpdateTheSystem Summit in DC?\n\nTune in live to watch @brian_armstrong, @pmarca, @faryarshirzad, and others discuss crypto's impact on everyday life.\nhttps://youtube.com/live/axM9xDrFK7c?feature=share…"
},
{
    "time": "2024-03-20T18:14:55.000Z",
    "tweet_text": "So excited to parter with the amazing team at @coinbase to bring USDC payments to all of our cafes!"
},
{
    "time": "2024-03-20T19:05:02.000Z",
    "tweet_text": "Congrats @diogomonica ! You and @nathanmccauley have built a great company, and I’m excited to see you go to work on the investment side.",
    "repost_text": "Diogo Mónica\nI’m ecstatic to announce that Diogo Mónica, one of the most exceptional founders I know, is joining us as a General Partner. In addition to co-founding and building Anchorage Digital into the success story it is today, Diogo possesses a wealth of technical…"
},
{
    "time": "2024-03-20T15:27:38.000Z",
    "tweet_text": "Going Direct is the right strategy for comms in today’s world. And Lulu basically created the movement.",
    "repost_text": "Rostra is the name of my new company. I left the corporate world in pursuit of this mission:\n\nTo help founder-led companies go direct with their comms.\n\nWe've already started working! Our first project was the launch for @cognition_labs and their AI engineer Devin. \n\nWe have a…"
},
{
    "time": "2024-03-19T14:46:25.000Z",
    "tweet_text": "For 5+ years, the industry's been hard at work building the infrastructure to update the financial system.\n\nToday, the use cases for crypto are no longer future promises. They're already here.\n\n→ http://coinbase.com/blog/what-is-crypto-good-for-anyway…"
},
{
    "time": "2024-03-19T23:13:44.000Z",
    "tweet_text": "What is crypto good for anyway?"
},
{
    "time": "2024-03-19T18:57:47.000Z",
    "tweet_text": "Coinbase International Exchange hitting new all-time highs: \n\n4 in 24\n30 in 30\n\nCheck out our market data at http://international.coinbase.com."
},
{
    "time": "2024-03-18T15:18:06.000Z",
    "tweet_text": "\".@coinbase's @Ethereum L2 network @base saw a massive uptick in daily transactions following the Dencun upgrade, surging to a record 2 million  on Saturday.\"\n\n by @tikta_\n Read more: \n\nhttps://unchainedcrypto.com/base-daily-transactions-spike-to-2-million-post-dencun-upgrade/…",
    "repost_text": "big spike in @base transactions"
},
{
    "time": "2024-03-18T13:56:07.000Z",
    "tweet_text": "imo @base L2 with @CoinbaseWallet experience is superb after EIP-4844\n\nthis will absolutely blow up as we progress in the crypto cycle\n\n@Coinbase on-ramp is quite smooth at this point and can probably be made even better / more intuitive tbh"
},
{
    "time": "2024-03-18T18:29:47.000Z",
    "tweet_text": "See you there!",
    "repost_text": "Reminder: Join us in DC this Wednesday for the #UpdateTheSystem Summit.\n\nHear from @brian_armstrong, @pmarca, @faryarshirzad, and others as they discuss how crypto is moving money, and America, forward.\n\nRSVP → http://updatethesystemsummit.splashthat.com"
},
{
    "time": "2024-03-18T03:14:20.000Z",
    "tweet_text": "Well said",
    "repost_text": "Wake up Democrats\n\n@SenWarren's anti-crypto army could literally cost you the 2024 presidential election.\n\n11m registered US voters own more than $1k in crypto.\n\nCrypto voters choose Biden over Trump 43% to 39% last time. \n\nThis time they support Trump over Biden 48% to 39%.\n\nYou…"
},
{
    "time": "2024-03-16T17:31:58.000Z",
    "tweet_text": "U.S. inflation peaked at 18% last year?",
    "repost_text": "We show that if we make an effort to reconstruct the CPI of Okun’s era—which would have had inflation peak last year around 18%, we are able to explain 70% of the gap in consumer sentiment we saw last year. 8/N"
},
{
    "time": "2024-03-15T15:04:33.000Z",
    "tweet_text": "",
    "repost_text": "Respectfully Senators, the evidence points exactly the opposite way. We have discussed our analysis with SEC staff and would be happy to do the same for you and any other policy makers who have questions. 1/7 x.com/EleanorTerrett…"
},
{
    "time": "2024-03-14T17:55:00.000Z",
    "tweet_text": "they genuinely hate this mf"
},
{
    "time": "2024-03-14T16:36:44.000Z",
    "tweet_text": "I remember that meeting!",
    "repost_text": "I met with @brian_armstrong at The Creamery in San Francisco on 7/24/15. He wanted to show me how his @coinbase app worked, so he sent me $1 worth of $BTC. Here it is today:"
},
{
    "time": "2024-03-14T17:47:20.000Z",
    "tweet_text": "Not sure if this happened in Jon's case, but it's really a shame how many journalists were blocked from owning crypto due to unnecessary internal policies. How can you cover an industry fairly if you can't try the products?\n\nI think it's possible for journalists to avoid (or…"
},
{
    "time": "2024-03-14T16:47:53.000Z",
    "tweet_text": "Huge shout out to the Ethereum core devs on shipping EIP-4844. What a massive win."
},
{
    "time": "2024-03-14T05:40:22.000Z",
    "tweet_text": "This is a direct result of the hard work the @Base and @Optimism engineering teams have put into EIP-4844 over the last year+... I love that everyone can now enjoy sub-cent transactions.\n\nYou might not believe it, but a few years ago, it cost hundreds of $ per transaction... ",
    "repost_text": "Before / After!"
},
{
    "time": "2024-03-14T03:52:19.000Z",
    "tweet_text": "Amen https://x.com/twobitidiot/st/twobitidiot/status/1768073919913759064…"
},
{
    "time": "2024-03-14T03:47:22.000Z",
    "tweet_text": "If you're in DC stop by March 20th!",
    "repost_text": "Hello all. Join us next Wednesday at the #UpdateTheSystem Summit in Washington, DC. You'll hear from builders and policymakers about the utility of crypto, including a session at 4:30pm ET with @brian_armstrong. RSVP here: http://updatethesystemsummit.splashthat.com"
},
{
    "time": "2024-03-14T03:40:10.000Z",
    "tweet_text": "Excited to see this go live! Layer 2 and EIP-4844 are helping crypto scale.",
    "repost_text": "A massive upgrade just went live on Ethereum (EIP-4844) that makes it radically cheaper to use\n\nBase will update at 5:00:01 PM PT today to bring these fee reductions to Base users and the rest of the Superchain"
},
{
    "time": "2024-03-14T01:45:22.000Z",
    "tweet_text": "This is huge\n\nReducing transaction fees and confirmation times on Layer 2 will open up so many more use cases for crypto.\n\nWe're finally getting scalability.",
    "repost_text": "after 2 years of hard work, blobs are now live on @base\n\nbefore: $0.31\nafter: $0.00 (but actually $0.0005)\n\nwallets need to update to handle these cost reductions!"
},
{
    "time": "2024-03-13T14:59:46.000Z",
    "tweet_text": "We are excited to announce our deployment on @base. \n\nOur deployment on @base and integrations with @coinbase products enable us to seamlessly bring Coinbase users into WAGMI Defense. \nA thread on why we chose Base "
},
{
    "time": "2024-03-12T13:50:39.000Z",
    "tweet_text": "Today we're excited to introduce Devin, the first AI software engineer.\n\nDevin is the new state-of-the-art on the SWE-Bench coding benchmark, has successfully passed practical engineering interviews from leading AI companies, and has even completed real jobs on Upwork.\n\nDevin is…"
},
{
    "time": "2024-03-12T15:21:41.000Z",
    "tweet_text": "Unfortunately there currently is no candidate who can fix this.\n\nYou can buy Bitcoin though as a way to vote with your dollars, send a clear message, and potentially even save the U.S. long term. A return to the gold standard.",
    "repost_text": "As I've said on All In 10x, I am a single-issue voter... I will vote for whoever is dedicated to stopping this madness. \n\nDon't care about anything else but spending... because we can't solve any of our other problems if we don't fix the balance sheet. x.com/RobertMSterlin…"
},
{
    "time": "2024-03-12T15:17:56.000Z",
    "tweet_text": "This is (in part) why Bitcoin matters. It’s a return to the gold standard that we left fully in 1971. A return to financial discipline.\n\nBitcoin will be an important check and balance on excessive deficit spending which is essential to the U.S. and the dollar remaining strong.",
    "repost_text": "This is the scariest chart I’ve ever made. This is what it looks like when a country is heading toward a financial precipice.\n\nEach color shows $1T getting added to the national debt.\n\nNot that long ago, it took six years to add a bar.\n\nWe’re now adding one every 90-120 days.…"
},
{
    "time": "2024-03-12T01:41:35.000Z",
    "tweet_text": "Passkeys are a big deal to make onboarding to crypto wallets easier.\n\nThe team identified and did all of this without my input. Great work.",
    "repost_text": "For people working on Passkey flows, which I think is the future of security on the web, check out what Coinbase is doing and copy. They have amazing product managers and have achieved the Platonic ideal of this interaction.  Hat tip: @brian_armstrong"
},
{
    "time": "2024-03-11T22:12:51.000Z",
    "tweet_text": "Don't want to read our entire 78-page brief in our Third Circuit suit against the SEC?  Just read this to understand how broken the Commission's approach has been."
},
{
    "time": "2024-03-11T22:42:42.000Z",
    "tweet_text": "This brief by @Coinbase is a brilliant work of art.\n\nIt methodically traces the SEC's numerous contradictions in statements and court filings over the years. \n\nThe principal author of the brief is Eugene Scalia, son of the late, great Justice Antonin Scalia.  \n\nWell done.  ",
    "repost_text": "Today @coinbase  filed our opening brief in the Third Circuit challenging the SEC’s denial of our rulemaking petition. Tl;dr: the SEC’s denial is arbitrary and capricious, an abuse of discretion, and a violation of the Administrative Procedures Act. 1/7 https://assets.ctfassets.net/c5bd0wqjc7v0/4k2YQLr5PQcDksJwda4yid/7e458652c5c696e886d16faa9a65a154/Coinbase_v._SEC_Brief_for_Petitioner.pdf…"
},
{
    "time": "2024-03-10T22:16:51.000Z",
    "tweet_text": "Yesterday, XB-1 set a new top ground speed of 123kts (141mph)… the third high-speed taxi in 48 hours. These tests are now starting to look more like flight, with a T-38 chase aircraft airborne! 1/"
},
{
    "time": "2024-03-06T22:21:09.000Z",
    "tweet_text": "This is the single-best documentary I've seen that explains why nuclear power got shut down in America; why that was a understandable mistake based on fear, anxiety, and ideology; and how we can scale up nuclear safely. Via @TheAbridgedZach @reason"
},
{
    "time": "2024-03-09T16:32:37.000Z",
    "tweet_text": "are you super based?\n\nmint the hoodie, free shipping globally.\n\ninfeed, onchain commerce is the future. \n\nhttp://warpcast.com/jessepollak/0x29a7b4ab…"
},
{
    "time": "2024-03-05T17:36:44.000Z",
    "tweet_text": "“Most people end up being conformists; they adapt to prison life. A few become reformers; they fight for better lighting, better ventilation. Hardly anyone becomes a rebel, a revolutionary who breaks down the prison walls. You can only be a revolutionary when you see the prison…"
},
{
    "time": "2024-03-09T20:44:41.000Z",
    "tweet_text": "1. It’s great to see @Farcaster_xyz continue to innovate with Frames (mini-apps within a social feed).\n\nHere is a great example where you can checkout with @CommerceCB right in the frame",
    "repost_text": "We’re highlighting Frames this week, a new way to add onchain actions into posts on @farcaster_xyz \n\nCookiecaster let’s you shop for Girl Scout Cookies in a post and order instantly with @coinbase Commerce"
},
{
    "time": "2024-03-09T20:44:42.000Z",
    "tweet_text": "2. We’ll continue shipping resources for builders (@Base recently published a helpful roundup of resources) and looking forward to what’s next."
},
{
    "time": "2024-03-09T20:44:42.000Z",
    "tweet_text": "3. Find me on @farcaster_xyz:"
},
{
    "time": "2024-03-08T18:15:21.000Z",
    "tweet_text": "Feed to mint, back to feed in 10 seconds. Even including the extra time spent to make sure the asset changes were accurate and not draining my wallet. Transaction frames on @farcaster_xyz, powered by @CoinbaseWallet and MWP are magic! "
},
{
    "time": "2024-03-08T19:54:25.000Z",
    "tweet_text": "What an epic week it is to celebrate my six year anniversary at @coinbase. It’s been a wild ride and I wouldn’t trade this experience for anything. Each day I learn something new, and I get to work with one of the greatest founders of all time.  cc: @brian_armstrong"
},
{
    "time": "2024-03-08T16:31:26.000Z",
    "tweet_text": "Happy Bitcoin all time high! Another cycle, and once again the haters were wrong.\n\nAs always, trade responsibly."
},
{
    "time": "2024-03-08T04:10:13.000Z",
    "tweet_text": "Top Talent is our #1 operating priority at @Coinbase, and we're always looking to improve on this dimension. To that end, we're excited to introduce the gom jabbar into our interview process to continually raise the bar on our talent.\n\nApply here: http://coinbase.com/careers"
},
{
    "time": "2024-03-07T17:27:41.000Z",
    "tweet_text": "Quick life update\n\nExcited to share I’m joining @Coinbase as their 1st ever sponsored trader to advise on the product development of their new perp & spot trading platform @CoinbaseTraders"
},
{
    "time": "2024-03-06T05:32:03.000Z",
    "tweet_text": "NEW: Crypto Super PAC Fairshake, which mounted a $10M ad campaign against @katieporteroc, released the below statement following her defeat to @AdamSchiff in tonight’s CA Senate Primary, saying her choice to side with @SenWarren against #crypto cost her her career in Congress:"
},
{
    "time": "2024-03-07T06:26:25.000Z",
    "tweet_text": "Accurate",
    "repost_text": "SEC Commissioners Peirce and Uyeda:  \"This scene is by no means hypothetical.\" \n\nNo. No it is not. I have the receipts."
},
{
    "time": "2024-03-06T16:50:03.000Z",
    "tweet_text": "SEC Commissioners Peirce and Uyeda:  \"This scene is by no means hypothetical.\" \n\nNo. No it is not. I have the receipts."
},
{
    "time": "2024-03-05T17:41:10.000Z",
    "tweet_text": "it’s never as bad as it seems during the bear, and it’s never as good as it seems during the bull\n\nworth rereading some classic wisdom from @FEhrsam"
},
{
    "time": "2024-03-05T00:10:09.000Z",
    "tweet_text": "We are crypto. \n\n#CryptoVotes"
},
{
    "time": "2024-03-05T02:30:26.000Z",
    "tweet_text": "Packed house at #StandWithCrypto rally in Los Angeles (having @Nas perform certainly didn't hurt!)\n\nVisit https://standwithcrypto.org to learn about pro/anti crypto candidates and PLEASE VOTE in super Tuesday tomorrow to decide who will be on the ballot this November.\n\nAmerica can't…",
    "repost_text": ".@brian_armstrong and @jessepollak discussing the importance of tomorrow’s election. \n\nSuper Tuesday is the moment that the world hears our voices."
},
{
    "time": "2024-03-03T18:22:45.000Z",
    "tweet_text": "Video going through some of the details behind the Smart Wallet demo. Let me know if you have questions and/or other videos you'd like to see!"
},
{
    "time": "2024-03-03T16:00:29.000Z",
    "tweet_text": "This is a must watch episode, just as @cdixon's new book is a must read!  The part that struck me most was @pmarca's comments about \"The Ring of Power.\"  Financial surveillance is too powerful of a tool for governments and others to have; it will be used and abused!  This is why…",
    "repost_text": "How will web3, AI, and crypto take the internet to the next level? @cdixon of @a16zcrypto joins @pmarca and @bhorowitz to discuss, as well as answer your questions! https://youtube.com/watch?v=u95r025U9K8&list=PLM4u6XbiXf5pZQmB6cadImO1M7xVYbZ_M&index=9…"
},
{
    "time": "2024-03-03T17:45:30.000Z",
    "tweet_text": "the first ever spatial mint \n\nthe new @coinbase smart wallet is incredible",
    "repost_text": "You’ve never used a wallet like this "
},
{
    "time": "2024-03-02T14:44:09.000Z",
    "tweet_text": "if you're wondering whether @coinbase still ships like a startup...\n\nthe team went zero to live on a category defining smart wallet in 3 months",
    "repost_text": "*3 months ago*: first commit \n\n*2 days ago*: http://keys.coinbase.com/developers\n\n*bangs the Coinbase door*: This baby ships! \n\n"
},
{
    "time": "2024-03-01T15:13:31.000Z",
    "tweet_text": "the @coinbase smart wallet is the most important new product since @base and the most consequential consumer wallet launched in the last 5 years.\n\nit's the last piece to bring billions of people onchain — because it \"just works.\"\n\nsee for yourself"
},
{
    "time": "2024-03-01T16:15:00.000Z",
    "tweet_text": "if you're in LA: come join me, @Nas, and @brian_armstrong getting out the vote with @standwithcrypto on monday at 3p.\n\nwe believe in a better onchain future for america and countries around the world — and now is the time to make our voices heard."
},
{
    "time": "2024-03-01T17:08:35.000Z",
    "tweet_text": "Super Tuesday is the crypto constituency's first major election test. Make your voice heard and join me at the first ever pro-crypto rally Monday @ 3pm in Los Angeles.",
    "repost_text": "It's time to #StandWithCrypto in LA.\n\nJoin the first pro-crypto rally in history the evening before Super Tuesday. There will be food, drinks, panel discussions, and a live performance by @Nas.\n\nRSVP here: http://cryptovotes.splashthat.com"
},
{
    "time": "2024-03-01T17:05:56.000Z",
    "tweet_text": "https://blog.newlimit.com/p/january-february-2024-progress-update…\n\nScaling the discovery engine ",
    "repost_text": "early winter @newlimit:\n\n- >10X more reprogramming factor sets tested than ever before\n- >2M cells profiled, 10TB+ of raw seq data\n- +3 team members\n- 2X speed up in reprogramming library build times\n- +1 cell types on our Engine\n- 1st rejuvenating hits"
},
{
    "time": "2024-02-29T17:01:05.000Z",
    "tweet_text": " Another major crypto wallet has entered the Smart Account arena.   \n\n> Smart Wallet SDK by @CoinbaseWallet. No more seed phrases, sign with Passkeys (FaceID your way to glory)\n> Account Abstraction Kit by @CoinbaseCloud to support Bundler + Paymaster initially on @base\n>…",
    "repost_text": "The biggest barrier to growing onchain adoption is the complexity of onboarding.\n\nWe’re excited to introduce our smart wallet solution to help make onchain onboarding faster, easier, and safer. Available on testnet for developers now.\n\nLearn more: https://coinbase.com/blog/evolving-wallets-to-bring-a-billion-users-onchain…"
},
{
    "time": "2024-03-01T06:54:46.000Z",
    "tweet_text": "Great leadership from @DaveMcCormickPA ",
    "repost_text": "Blockchain and crypto currency promote individual freedom and privacy and are driving incredible innovation in our economy. Ensuring America is THE global leader is critical to national security.\n\nWe must embrace it as a powerful tool for keeping Pennsylvania and America at the…"
},
{
    "time": "2024-02-29T21:26:40.000Z",
    "tweet_text": "Well said",
    "repost_text": "1/16\n\nI think people underestimate, by several orders of magnitude, the impact Coinbase will have in being able to push people to Base, and therefore Optimism."
},
{
    "time": "2024-02-29T15:56:06.000Z",
    "tweet_text": "Today, we announced the next generation of onchain wallets. \n\nNo more leaving a dapp to go install a wallet, and then doing an awkward dance between dapp and wallet every time you transact.\n\nBest of all, your wallet and identity travels with you to every onchain dapp and comes…",
    "repost_text": "The biggest barrier to growing onchain adoption is the complexity of onboarding.\n\nWe’re excited to introduce our smart wallet solution to help make onchain onboarding faster, easier, and safer. Available on testnet for developers now.\n\nLearn more: https://coinbase.com/blog/evolving-wallets-to-bring-a-billion-users-onchain…"
},
{
    "time": "2024-02-29T18:41:01.000Z",
    "tweet_text": "Consumer utility in web3 is happening - you can feel it.\n\nAll these apps need wallets.\n\nIf you want your own wallet in your app - it's now easy to power that with our Embedded Wallets.\n\nFor consumers who want one self-custodial wallet ( like Coinbase Wallet) that aggregates…",
    "repost_text": "The biggest barrier to growing onchain adoption is the complexity of onboarding.\n\nWe’re excited to introduce our smart wallet solution to help make onchain onboarding faster, easier, and safer. Available on testnet for developers now.\n\nLearn more: https://coinbase.com/blog/evolving-wallets-to-bring-a-billion-users-onchain…"
},
{
    "time": "2024-02-28T20:11:01.000Z",
    "tweet_text": "Apps are now recovering.\n\nWe had modeled a ~10x surge in traffic and load tested it. This exceeded that number.\n\nIt's expensive to keep services over-provisioned, but we'll need to keep working on auto-scaling solutions, and killing any remaining bottlenecks. Thank you for…",
    "repost_text": "We are dealing with a LARGE surge of traffic - apologies for any issues you encounter. The team is working to remediate."
},
{
    "time": "2024-02-28T17:59:59.000Z",
    "tweet_text": "We are dealing with a LARGE surge of traffic - apologies for any issues you encounter. The team is working to remediate."
},
{
    "time": "2024-02-28T18:00:40.000Z",
    "repost_text": "We are aware that some users may see a zero balance across their Coinbase accounts & may experience errors in buying or selling. Our team is investigating this & will provide an update shortly. Your assets are safe.\nYou can track this incident at http://status.coinbase.com"
},
{
    "time": "2024-02-27T20:32:51.000Z",
    "tweet_text": "LA friends - Join @standwithcrypto next Monday for a musical performance and panel with Grammy winner @Nas @brian_armstrong , and @pplpleasr1. Be a part of history with the first pro-crypto rally and mingle with fellow crypto advocates! RSVP in comments"
},
{
    "time": "2024-02-28T13:22:27.000Z",
    "tweet_text": "Fact 1: Crypto exchanges like @coinbase have to register with @USTreasury under the Bank Secrecy Act and follow the same standards as banks. To say otherwise is just not true.\n\nFact 2: @ewarren is proposing that crypto protocols (software and code) be treated like crypto…",
    "repost_text": "Senator Elizabeth Warren is looking to level the playing field when it comes to crypto, saying it should have the same regulation as other financial systems https://trib.al/7lxSqco"
},
{
    "time": "2024-02-28T00:20:21.000Z",
    "tweet_text": "New @coinbase careers site is live: https://coinbase.com/careers\n\nHopefully more clear on what we're looking for, to build a strong culture."
},
{
    "time": "2024-02-26T16:02:45.000Z",
    "tweet_text": "Starting this Thursday, come see your favorite @coinbase personalities at Home Base at ETH Denver!\n\n@jessepollak, @ViktorBunin,  I, and many others will be there for builder talks, the onchain game Base Hunt, onchain art, and more!"
},
{
    "time": "2024-02-25T21:16:57.000Z",
    "tweet_text": "Interested in learning more about @JohnEDeaton1 as he is going up against Elizabeth Warren",
    "repost_text": "Please consider following @DeatonforSenate and visiting http://johndeatonforsenate.com. I appreciate each and every one of you. "
},
{
    "time": "2024-02-24T20:23:48.000Z",
    "tweet_text": "Wild.",
    "repost_text": "Had to try it myself. So fascinating!  x.com/pmarca/status/…"
},
{
    "time": "2024-02-24T17:31:24.000Z",
    "tweet_text": "https://coinbaseshop.com",
    "repost_text": "thank you @davidtphung new @coinbase merch in the wild"
},
{
    "time": "2024-02-23T00:50:25.000Z",
    "tweet_text": "(1/10) Today, Kraken tells the real story of the SEC’s suit."
},
{
    "time": "2024-02-23T14:00:57.000Z",
    "tweet_text": "Thank you @BimAfolami and @RishiSunak for the great leadership and innovation friendly environment in the UK!"
},
{
    "time": "2024-02-23T13:58:44.000Z",
    "tweet_text": "This is inaccurate WRT Coinbase as far as I can tell.\nCoinbase products are still operating (no interruption)\nWe haven't received any outreach or communication from officials in Nigeria"
},
{
    "time": "2024-02-21T20:00:01.000Z",
    "tweet_text": "So @mikewawszczak is suing the SEC and I made a song about it.\n\nBid on the NFT:\nhttp://songaday.world/5530"
},
{
    "time": "2024-02-21T17:38:17.000Z",
    "tweet_text": "How many suits will it take before the @SECGov gets that all this community asks is to understand the rules so that it can follow them faithfully?  Apparently the answer is:  at least one more.",
    "repost_text": "NEW  Today, LEJILEX and the Crypto Freedom Alliance of Texas filed suit against the @SECGov . We’re holding the federal government accountable and fighting for clear, consistent regulation of digital assets in Texas: https://businesswire.com/news/home/20240220458690/en/SEC%E2%80%99s-Unlawful-Targeting-of-Digital-Asset-Industry-Challenged-in-New-Lawsuit-From-Startup-LEJILEX-and-Crypto-Freedom-Alliance-of-Texas…"
},
{
    "time": "2024-02-20T18:11:18.000Z",
    "tweet_text": "",
    "repost_text": "We bought this. Why?\n✓ We love new ways of doing things.\n✓ We respect innovative brands.\n✓ It was a really good deal.\n\nWe also paid in USDC and saved @LiquidDeath $12K in middleman fees.\n\nSo here’s the $500,114 question:\nWhat do we put on the boxes for 200M people to see? x.com/LiquidDeath/st…"
},
{
    "time": "2024-02-20T18:09:07.000Z",
    "tweet_text": "Coinbase International Exchange continues to grow - first time hitting $1B in volume in a day.\n\nSign up here: https://international.coinbase.com/?tab=derivatives…\n\nWould be great to see perpetual futures allowed in the U.S. market as well.",
    "repost_text": "In the last 24 hours Coinbase International Exchange perpetual futures surpassed $1 billion in notional contract volume traded. Check out our market data at http://international.coinbase.com"
},
{
    "time": "2024-02-11T07:48:41.000Z",
    "tweet_text": "OnchainKit just hit 200 stars in its first 2 weeks \n\nThank you to all the contributors who led us to 200: @0xr0b_eth, @taycaldwell_, @alvaroraminelli, @wespickett, @eragon5121, @nico_valencia, @neps, FedererKK, @realSyntag, Chris Nascone, @manan19\nhttps://github.com/coinbase/onchainkit…"
},
{
    "time": "2024-02-17T22:44:02.000Z",
    "tweet_text": "1/ Hey folks, I’m the product lead for Coinbase Commerce and want to share some thoughts on how the product is evolving, why we’ve made these changes, and clarify what it means for our asset support strategy moving forward. "
},
{
    "time": "2024-02-17T15:38:00.000Z",
    "tweet_text": "look, all i'm saying is that SF and the Bay Area would be so much cooler if someone built a Statue of Colossus on Alcatraz\n\nwith one of these bad boys, SF goes from our #2 city behind NYC, to #1 in America and #1 in the world. guaranteed."
},
{
    "time": "2024-02-17T15:01:38.000Z",
    "tweet_text": "Lessons Steve Jobs wanted to pass on. \n\nWritten right before he died. \n\nIn his own words:\n\n1.  ON BUILDING A REAL COMPANY:\n\nI hate it when people call themselves “entrepreneurs” when what they’re really trying to do is launch a startup and then sell or go public, so they can cash…"
},
{
    "time": "2024-02-15T20:49:32.000Z",
    "tweet_text": "#Crypto is not the enemy. Terrorists will use any means necessary - cash or crypto- to accomplish their means.",
    "repost_text": "JUST IN:  U.S. Congressman French Hill says \"bad actors still prefer to use traditional finance rather than digital assets.\""
},
{
    "time": "2024-02-16T16:41:03.000Z",
    "tweet_text": "A few thoughts on our Q4 Earnings yesterday:\n\n2023 was a great year for Coinbase and we’re in a strong financial position. We cut costs by 45% y/y and shipped products faster with a leaner team driving $95 million of positive net income for 2023, $964 million in positive Adj.…"
},
{
    "time": "2024-02-16T16:42:13.000Z",
    "tweet_text": "Note: the NFT is soul-bound, not for resale or trading, just something to keep for yourself, for reasons you can probably imagine :)"
},
{
    "time": "2024-02-16T00:12:26.000Z",
    "tweet_text": "Announcing some of the first recipients of Builder Grants in 2024:\n- @coinage_media, a DAO putting media ownership onchain\n- @mikebodge for Stay Hydrated's 'love letter to web3'\n- @OmniKingdoms, an onchain MMO with gasless gaming\n- @theahchu for @basemint_tech's key-gated chat…"
},
{
    "time": "2024-02-16T04:38:06.000Z",
    "tweet_text": "https://nft.coinbase.com/mint/coinearnings…",
    "repost_text": "Can we mint this on @base?"
},
{
    "time": "2024-02-15T21:20:25.000Z",
    "tweet_text": "Our Q4'23 and full-year 2023 update is in.\n\nRead the full shareholder letter and tune into our earnings call: http://investor.coinbase.com"
},
{
    "time": "2024-02-12T14:38:22.000Z",
    "tweet_text": "JUST IN:  Spot #Bitcoin ETF inflows are accelerating "
},
{
    "time": "2024-02-15T18:33:49.000Z",
    "tweet_text": "Hey all, we should prolly start putting photos and videos on a blockchain \n\nSo we know what’s real and not? (And provenance)\n\nAI and crypto merging someday, crazy right?",
    "repost_text": "Announcing Sora — our model which creates minute-long videos from a text prompt: https://openai.com/sora"
},
{
    "time": "2024-02-15T16:31:20.000Z",
    "tweet_text": "Checkout http://once.com from the amazing Basecamp team! They’re now accepting crypto payments via @CommerceCB through Shopify\n\n@jasonfried and @dhh are true original thinkers, I’ve enjoyed reading all their books - such concise and clear thinking and writing",
    "repost_text": "We now accept Bitcoin as payment for ONCE/Campfire. This is the first time we've accepted crypto as payment for our products, and we're proud to work with @Coinbase Commerce on the offering via Shopify. cc: @brian_armstrong @tobi.\n\nhttp://once.com/campfire"
},
{
    "time": "2024-02-15T16:34:41.000Z",
    "tweet_text": "We still have a ton of work to do to improve the UX of crypto payments. I’m a little embarrassed at the current state. But with this Shopify integration, we can hopefully make it great this year."
},
{
    "time": "2024-02-14T19:25:44.000Z",
    "tweet_text": "Today, I asked Treasury's Head of FinCEN and OFAC about the WSJ's reporting on Hamas's digital asset fundraising campaign. \n \nUndersecretary Nelson CONFIRMED, on the record, that the WSJ's numbers were inaccurate and that crypto was not even a popular tool for Hamas terrorists."
},
{
    "time": "2024-02-14T16:33:00.000Z",
    "tweet_text": "This all comes down to the forces of freedom vs. the forces of control.\n\n#Bitcoin is a force for freedom for 8 billion people."
},
{
    "time": "2024-02-13T05:24:48.000Z",
    "tweet_text": "Congress SHOULD legislate when the law in a particular area is unclear and the rules are inconsistently applied.  \n\nCongress, however, MUST act when the lack of regulatory clarity contributes to arbitrary and capricious behavior and the rank abuse of power.  \n\nThe facts in the…",
    "repost_text": "These Senators are even more right than they know. After @SECGov secured a TRO against @DebtBox, it ordered @coinbase to freeze assets or risk sanctions ourselves. We now know that because the TRO was tainted by SEC misrepresentations, so too was this order. 1/5 x.com/CoinDesk/statu…"
},
{
    "time": "2024-02-13T17:49:54.000Z",
    "tweet_text": ". @CoinbaseIntExch (perpetual futures and spot) keeps breaking our prior daily records - $627M in last 24hrs\n\nLots of headroom for derivatives trading growth on compliant infrastructure. If you have to use a centralized exchange, choose a counterparty you can trust.…"
},
{
    "time": "2024-02-13T16:47:23.000Z",
    "tweet_text": "This is the way",
    "repost_text": "http://mintapenny.xyz \n\nThis is totally organic activity from social discovery. We thought maybe a few thousand would participate…"
},
{
    "time": "2024-02-13T15:43:24.000Z",
    "tweet_text": "Coinbase Pay is now available as an option to  buy crypto via Ledger Live, which means @Coinbase users can easily buy crypto in Ledger Live, and @Ledger users can easily buy with Coinbase.\n\nIt's a great day to on-ramp to self custody! \nhttps://ledger.com/blog-ledger-live-and-coinbase-pay-collaborate-to-streamline-crypto-purchases…",
    "repost_text": "We’re excited to announce that @Coinbase Pay is now available as a buy provider through Ledger Live!\n\nUse your Coinbase login to buy crypto, and have it immediately secured with your Ledger \n\nRead more: https://ledger.com/blog-ledger-live-and-coinbase-pay-collaborate-to-streamline-crypto-purchases…"
},
{
    "time": "2024-02-13T01:53:24.000Z",
    "tweet_text": "These Senators are even more right than they know. After @SECGov secured a TRO against @DebtBox, it ordered @coinbase to freeze assets or risk sanctions ourselves. We now know that because the TRO was tainted by SEC misrepresentations, so too was this order. 1/5",
    "repost_text": "U.S. senators question whether Chair @GaryGensler's @SECGov has botched other enforcement cases after its DEBT Box missteps were revealed. \n\nhttps://trib.al/0qKF94b"
},
{
    "time": "2024-02-12T23:40:08.000Z",
    "tweet_text": "For anyone who wants a peak into the future of consumer, it's here.\n\nScrolling on Warpcast and I see this \"Mint a Penny\" frame.\n\nThe following flow was the best onchain to offchain experience I've ever had:\n\n1. Click \"mint a penny\"\n2. The frame automatically transitions to \"get a…"
},
{
    "time": "2024-02-13T02:02:54.000Z",
    "tweet_text": "Web3 is becoming mainstream right now, and the easiest way to onboard users is through embedded wallets: web2 in the front, onchain in the back.\n\n@coinbase is seeking teams to participate in its Early Access program for embedded wallets - sign up here:\n\nhttps://docs.google.com/forms/d/e/1FAIpQLSeIYxuWJbiYnRlMEUK73FFJyABqaF9x2sXl6wpy7O7Or5NW0A/viewform…",
    "repost_text": "Building on Base? Embedded wallets, powered by Wallet-as-a-Service, are an easy and secure way to create great user experiences.\n\nWe're inviting builders to join the Early Access Program and learn more ↓ https://docs.google.com/forms/d/e/1FAIpQLSeIYxuWJbiYnRlMEUK73FFJyABqaF9x2sXl6wpy7O7Or5NW0A/viewform…"
},
{
    "time": "2024-02-13T01:37:13.000Z",
    "tweet_text": "Check out Coinbase Wallet-as-a-service to easily create embedded wallets for users in your app.\n\nOnboard your users to web3. From @CoinbaseCloud team.",
    "repost_text": "Building on Base? Embedded wallets, powered by Wallet-as-a-Service, are an easy and secure way to create great user experiences.\n\nWe're inviting builders to join the Early Access Program and learn more ↓ https://docs.google.com/forms/d/e/1FAIpQLSeIYxuWJbiYnRlMEUK73FFJyABqaF9x2sXl6wpy7O7Or5NW0A/viewform…"
},
{
    "time": "2024-02-12T23:53:23.000Z",
    "tweet_text": "I don't think people appreciate enough how @brian_armstrong and @jessepollak pulled Coinbase onchain.\n\nThis is a company of 3k+ people who came from mostly tradfi/tech. Now they're building, shipping, and marketing onchain.\n\nHuge undertaking, can't overstate how impressive it is."
},
{
    "time": "2024-02-12T21:29:27.000Z",
    "tweet_text": "\n\nIf you haven't checked your @coinbase account lately, now would be a good time.\n\nIf you're an institution who hasn't onboarded yet to our Coinbase Prime  https://coinbase.com/prime\n\nIf you're a developer who hasn't yet checked out Coinbase Cloud  https://coinbase.com/cloud"
},
{
    "time": "2024-02-12T20:43:11.000Z",
    "tweet_text": "JUST IN: $1.5 trillion asset manager Franklin Templeton files for spot #Ethereum ETF."
},
{
    "time": "2024-02-12T16:54:25.000Z",
    "tweet_text": "Crypto moves money forward!\n",
    "repost_text": "The penny…\n$1.2 million worth of them go missing every year.\nIt costs nearly 3x the value of one just to make one.\nAnd it’s been 167 years since its last update.\n\nThankfully, crypto can move the penny forward.\nRight, Abe?"
},
{
    "time": "2024-02-09T23:24:44.000Z",
    "tweet_text": "We can already say, Goody-2 LLM is the AI breakthrough of the year! https://goody2.ai\n\nBe sure to read the paper: https://goody2.ai/goody2-modelcard.pdf…"
},
{
    "time": "2024-02-09T19:05:03.000Z",
    "tweet_text": "base now has many more active traders than ethereum or any other L2\n\nstill a long way to go on volume, but @base is where the people are"
},
{
    "time": "2024-02-08T17:58:51.000Z",
    "tweet_text": "Like perps? \n\nCoinbase now offers 20 contracts...",
    "repost_text": "Our APT-PERP, FIL-PERP, and SUI-PERP markets are now in full-trading mode on Coinbase International Exchange and Coinbase Advanced. Limit, market, stop, and stop limit orders are all now available."
},
{
    "time": "2024-02-08T13:54:13.000Z",
    "tweet_text": "The SEC seems to have a hard time keeping its story straight on crypto.\n\nLet’s take a closer look at statements by SEC lawyers at the recent @Coinbase and @Binance hearings.\n\nSEC v. @Coinbase (Jan. 17):\n\nCourt:  “You’re saying that as to these 12 or 13 tokens, when they were…"
},
{
    "time": "2024-02-07T19:12:56.000Z",
    "tweet_text": "Exactly right @s_alderoty.  The Secretary, like the two House committees, @CynthiaMLummis, and others has put the lie to the fallacy that crypto regulation isn’t a Major Question reserved to the Congress. There couldn’t be a more contemporaneous, more bipartisan record.",
    "repost_text": "In Coinbase, the SEC told the judge that crypto is a “rounding error,” no legislative gaps exist and thus, crypto can be “swept” into its authority. Yesterday, Sec. Yellen told Congress crypto legislation is needed to fill regulatory gaps. Both statements can’t both be true."
},
{
    "time": "2024-02-07T06:05:43.000Z",
    "tweet_text": "Awesome progress from the @researchhub team ",
    "repost_text": "Our new Grants feature is officially live!\n\nUse the $RSC you earn on @ResearchHub to help fund novel scientific research \nhttps://researchhub.com/funding"
},
{
    "time": "2024-02-05T22:58:48.000Z",
    "tweet_text": "Built alongside @jessepollak during the 2017 cycle and thrilled to be building alongside him and the rest of the @base team this time around.",
    "repost_text": "It's an amazing time to be building onchain\n\n@dwr joined us for ONCHAIN STORIES to talk about @farcaster_xyz and what made him an L2 believer"
},
{
    "time": "2024-02-05T16:26:01.000Z",
    "tweet_text": "\"When you have such small differences between the vote count for one candidate and another, a few thousand passionate voters who say crypto matters to them can punch way above their weight.\"",
    "repost_text": "EXCLUSIVE: Coinbase legal chief Paul Grewal chatted with us about how company efforts in key US swing states will clinch both local and nationwide elections. @Joanna_Focus and @AdMcMarkets report  https://dlnews.com/articles/regulation/coinbase-paul-grewal-says-crypto-will-decide-elections/…"
},
{
    "time": "2024-02-02T16:34:48.000Z",
    "tweet_text": "Logging in to Farcaster this AM"
},
{
    "time": "2024-02-02T01:26:09.000Z",
    "tweet_text": "I like Andrew, and makes sense why he has to say that in a press conference, but the irony is that it’s actually the exact opposite\n\nThe pound (like the dollar) has no link (or backing) to any hard commodity. They can make as much of it as they want.\nBitcoin is much closer to a…",
    "repost_text": "Interesting: in BoE press conference, Andrew Bailey is very careful to draw a specific distinction between what he describes as \"unbacked\" cryptocurrencies and stablecoins. Britcoin agogo"
},
{
    "time": "2024-01-31T20:30:01.000Z",
    "tweet_text": "Always a good time to set the record straight on what's actually happening in this industry."
},
{
    "time": "2024-02-01T01:51:44.000Z",
    "tweet_text": "I remember this morning very well. I had spoken to @elonmusk by phone earlier and written a column in @nytimes for that morning and then went on the air with the news. The truth is I thought the comp plan was the most “skin in the game” in history. I still do. I have criticized…",
    "repost_text": "Here's how CNBC broke the news when the Tesla board announced the new 2018 CEO Compensation Plan on January 23, 2018, when Tesla was trading at a $59B market capitalization. \n@andrewrsorkin called it:\n\"dare I say crazy\"\n\"perhaps the most radical compensation plan in history\"…"
},
{
    "time": "2024-01-31T16:20:39.000Z",
    "tweet_text": "A warm @coinbase welcome to @George_Osborne!",
    "repost_text": "We are very pleased to have @George_Osborne join @coinbase's Global Advisory Council.  George is one of the most experienced and thoughtful leaders in government and business, and we are grateful to have his advice and counsel as we expand Coinbase around the world.…"
},
{
    "time": "2024-01-31T03:44:20.000Z",
    "tweet_text": "Congratulations @cdixon on releasing Read Write Own! Many of us have wanted a powerful, but approachable book to recommend folks starting their crypto journey. Appreciate you writing one for us \n\nGet a copy here: http://readwriteown.com"
},
{
    "time": "2024-01-30T19:04:58.000Z",
    "tweet_text": "We’re highlighting Frames this week, a new way to add onchain actions into posts on @farcaster_xyz \n\nCookiecaster let’s you shop for Girl Scout Cookies in a post and order instantly with @coinbase Commerce"
},
{
    "time": "2024-01-30T04:09:09.000Z",
    "tweet_text": "Worth point out: the checkout is powered by @CommerceCB.\n\nShout out to @jessepollak for having Coinbase move faster than most startups. Nearly all of the most interesting Farcaster Frames have been built with @base.",
    "repost_text": "People like cookies. People like frames.  x.com/dwr/status/175…"
},
{
    "time": "2024-01-28T22:00:28.000Z",
    "tweet_text": "the first onchain native ad unit (on @base)",
    "repost_text": "Token-gated and social proof-of-work gated frame where you get an NFT to your wallet in 1-tap without leaving the app.\n\nDid @wojtekwtf just invent the cryptonative ad unit?"
},
{
    "time": "2024-01-29T00:28:44.000Z",
    "tweet_text": "so proud of how fast the @base and @coinbase  teams shipped since frame friday. over the weekend: \n\n1. grants for based frames\n2. pizza for frame hackers\n3. uftilities fo builders in onchainkit\n4. a based frame guide & tutorial\n5. a frame builder chat  \n\nunreal. links in thread.",
    "repost_text": "Cool to see Coinbase contributing open source code to frames within 48 hours on a weekend. \n\nh/t @jessepollak x.com/Zizzamia/statu…"
},
{
    "time": "2024-01-26T21:06:04.000Z",
    "tweet_text": "After sitting with our legal team to parse through the fine print of Apple's DMA announcement (that took a while), which is, at best vague and misleading, I wanted to share my thoughts.  \n\nWhile Apple has behaved badly for years, what they did yesterday represents a new low, even…"
},
{
    "time": "2024-01-25T19:19:51.000Z",
    "tweet_text": "blobs are now live on the @base devnet - testnets coming soon and mainnet around the corner\n\nwe've been working on 4844 for nearly two years now and i'm so excited to get this live ASAP!\n\n2-5x reduction for @base fees, going to be massive.",
    "repost_text": "Base and OP Labs successfully activated the Ecotone hardfork on their respective Goerli devnets, and today enabled posting of batches via EIP-4844 blobs. Here's the Base goerli-devnet batcher, you can see recent transactions are \"type 3\" (== Blob type). https://goerli.etherscan.io/address/0x53394266fc80e5d4e6d25b3d0b7ca243859b7b09…"
},
{
    "time": "2024-01-24T23:41:50.000Z",
    "tweet_text": "2 years later... This is why self-custody crypto is so important to freedom. The government can do heinous, immoral shit, violate the constitution, steal your savings, wrongfully imprison you, etc. and get away with it for YEARS before justice prevails. \n\nhttps://cointelegraph.com/news/canada-use-of-law-freezing-protesters-crypto-donations-unconstitutional…"
},
{
    "time": "2024-01-25T18:57:34.000Z",
    "tweet_text": "Subscribed https://piratewires.com\n\nSupport new media and techno-optimism",
    "repost_text": "Welcome to the brand new Pirate Wires site, an independent home for our community and work. Come check out the new digs, and lmk what you think."
},
{
    "time": "2024-01-25T18:58:15.000Z",
    "tweet_text": "We need new institutions"
},
{
    "time": "2024-01-25T00:18:11.000Z",
    "tweet_text": "Thanks for having us on @BanklessHQ guys, enjoyed the chat on #DeSci!\n\nFollow @ResearchHub and @joycesticks for more updates ",
    "repost_text": "PREMIERE:\n\nThe  Decentralized Science episode\n\nw/ @brian_armstrong and Patrick Joyce (@joycesticks) from @ResearchHub \n\nScience is a consensus technology. So is crypto. How can we use crypto to fix science?\n\nFind out "
},
{
    "time": "2024-01-24T01:45:58.000Z",
    "tweet_text": "For pro crypto traders, follow @coinbasetraders \n\nSharing updates on advanced trading there"
},
{
    "time": "2024-01-23T02:05:08.000Z",
    "tweet_text": "1/ Execution client diversity on Ethereum is a critical concern for all of us at Coinbase. Here’s what we’re doing about it. ↓"
},
{
    "time": "2024-01-18T11:25:07.000Z",
    "tweet_text": "Great to meet with @RachelReevesMP to discuss digital innovation, crypto and AI, and to hear about @UKLabour’s commitment to make the UK a hub for innovation. Particularly appreciated the opportunity to share thoughts on how blockchain technology can enhance government services.",
    "repost_text": "The next Labour government will work with the tech sector to bring jobs and prosperity to Britain.\n\nThank you to @sriramk for organising and @coinbase for hosting breakfast this morning."
},
{
    "time": "2024-01-18T19:20:47.000Z",
    "tweet_text": "Probably nothing.",
    "repost_text": "JUST IN: #Bitcoin becomes the second largest ETF commodity in the US, surpassing silver."
},
{
    "time": "2024-01-18T01:59:26.000Z",
    "tweet_text": "pretty wild to see @base is the largest and fastest growing onchain developer ecosystem launched since 2020",
    "repost_text": "29/ There are also several ecosystems that *did not exist* in 2020 that have built developer communities with 500+ devs in two years such as @Base, @Scroll_ZKP, @SuiNetwork, @Aptos_Network.\n\nhttps://developerreport.com/reports/devs/2023?s=base-aptos-scroll-sui-did…"
},
{
    "time": "2024-01-17T20:28:49.000Z",
    "tweet_text": "Milei in Davos 2024: Quotes (20) - Closing words\n\n\"In concluding, I would like to leave a message for all entrepreneurs and business people here, and for those who are not here in person but are following from around the world: \n\nDo not be intimidated either by the political…"
},
{
    "time": "2024-01-18T01:07:06.000Z",
    "tweet_text": "This is why crypto needs to win - it will propagate economic freedom around the world\n\nGreat speech from Milei at WEF"
},
{
    "time": "2024-01-17T15:30:31.000Z",
    "tweet_text": "NEW: President of Argentina Javier Milei demolishes socialism in front of a bunch of socialists at the World Economic Forum.\n\n\n\n“I'm here to tell you that the western world is in danger and it is endangered because those who are supposed to have to defend the values of the…"
},
{
    "time": "2024-01-17T20:46:06.000Z",
    "tweet_text": "Today we made arguments in our motion to bounce the  @SECgov suit against @Coinbase. After hours and hours, this much remain clear:  the SEC continues to claim broad authority over all investments while offering no limiting principle to its definition of investment contract. 1/4"
},
{
    "time": "2024-01-17T16:46:20.000Z",
    "tweet_text": "Coinbase vs SEC Court Hearing LIVE"
},
{
    "time": "2024-01-17T16:21:53.000Z",
    "tweet_text": "It’s a beautiful day on Capitol Hill! \n\nWe are excited to host Massachusetts-based founders as they share stories with their elected representatives about how they are driving innovation within their districts.\n\nIt’s important that our legislators know why we #StandWithCrypto."
},
{
    "time": "2024-01-16T23:52:12.000Z",
    "tweet_text": "Apple is going to poison the one victory Epic secured in their lawsuit so bad nobody would ever think to use it. They want a 27%(!!!!) commission on any link from an app to a website, reporting every few weeks, AND the right to audit your books?? Insane."
},
{
    "time": "2024-01-15T18:25:58.000Z",
    "tweet_text": "I called Merrill and Vanguard and told both companies that I’m pulling all of my money from all accounts. The rep at each company connected me with a senior account manager and in both cases that person apologized profusely for management’s lack of vision, admitted they owned…"
},
{
    "time": "2024-01-10T23:04:59.000Z",
    "tweet_text": "We're standing on the shoulders of giants today.\n\nErik Voorhees, Charlie Shrem, Gavin Andresen, Jesse Powell, Andreas Antonopoulos, Jerry Brito, Brian Armstrong, Wences Casares, Adam Back, Cameron and Tyler Winklevoss, Bill Barhydt, Stephen Pair, Tuur Demeester, Mike Belshe, Hal…"
},
{
    "time": "2024-01-11T00:27:24.000Z",
    "tweet_text": "\"This is a monumental step for the crypto industry and for Coinbase, too,\" Coinbase CEO Brian Armstrong tells @andrewrsorkin in a first on CNBC interview following the SEC's decision on bitcoin ETFs. https://cnb.cx/3NXSGnA"
},
{
    "time": "2024-01-11T01:11:17.000Z",
    "tweet_text": ".@Grayscale deserves a huge amount of credit for today, pushing this through the courts\n\nAbsolute legends",
    "repost_text": "We should all be grateful to @Grayscale for pushing back against the SEC’s arbitrary and capricious behavior, and clearing the way to get these spot BTC ETFs over the finish line. And of course to the DC Circuit, for affirming that the rule of law must prevail over politics. 2/3"
},
{
    "time": "2024-01-11T01:00:37.000Z",
    "tweet_text": "“[W]e have alienated a generation of product innovators within our space. Our unreasonable approach to these applications has signaled that regulatory prejudice against new products and services can lead us to sidestep the law and unreasonably delay product launches. The industry…"
},
{
    "time": "2024-01-10T01:47:14.000Z",
    "tweet_text": "Enjoyed reading @cdixon 's new book Read Write Own\n\nSuggest you pick up a copy! https://readwriteown.com"
},
{
    "time": "2024-01-09T18:48:30.000Z",
    "tweet_text": "2023 @newlimit:\n\n- 50X more reprogramming factor sets tested than the field before us\n- 20X factor demultiplexing performance (reading), 7X factor delivery (writing)\n- 2X team size\n- +3 functional assays for immunology program\n- +2 in silico model metrics > SOTA\n\nblog "
},
{
    "time": "2024-01-10T01:27:06.000Z",
    "tweet_text": "",
    "repost_text": "2023 was NewLimit’s first full calendar year of operations. Some highlights from the year: \n\n 50X more reprogramming factor sets tested than the field has cumulatively ever tested\n\n 20X increase in the signal-to-noise of our pooled screen demultiplexing assay\n\n 7X the…"
},
{
    "time": "2024-01-09T19:02:09.000Z",
    "tweet_text": "just shared @base's 2024 mission. top priorities:\n\n1. accelerating decentralization\n2. driving down fees across the board\n3. making smart wallets the default\n4. making it dead simple to on and offramp\n5. bringing @coinbase (and others) onchain \n6. making the superchain seamless",
    "repost_text": "In 2024, we have a new mission: To build a global onchain economy that increases innovation, creativity, and freedom\n\nThis is the bedrock of our actions and aspirations as we work to bring the world onchain\n\nWe’re building a new internet, and a new economy"
},
{
    "time": "2024-01-07T17:38:15.000Z",
    "tweet_text": "transactions on @base are about to get 6-11% cheaper, fast followed by EIP4844 which will reduce them another order of magnitude."
},
{
    "time": "2024-01-07T20:35:10.000Z",
    "tweet_text": "We have hit 250k sign ups for the Stand With Crypto movement \n\nThis milestone shows the world that the crypto community is real and ready to stand together. \n\nLet's reach 1m in 2024."
},
{
    "time": "2024-01-05T18:41:20.000Z",
    "tweet_text": "Apple just called to let us know they're rejecting the HEY Calendar app from the App Store (in current form). Same bullying tactics as last time: Push delicate rejections to a call with a first-name-only person who'll softly inform you it's your wallet or your kneecaps."
},
{
    "time": "2024-01-04T17:21:10.000Z",
    "tweet_text": "2023 was the year that crypto owners stood up.\n\n 242K+ crypto advocates\n in-person events in 6 major cities\n flew 45+ founders to DC \n the first-ever crypto presidential forum\n\nBig things are in store for 2024, and we look forward to continuing the momentum with you!"
},
{
    "time": "2024-01-03T03:57:52.000Z",
    "tweet_text": "WAPO reporter doubles down: You didn’t say that you condemn white supremacy though.\n\nShe immediately regrets it.\n\n@VivekGRamaswamy isn’t going to play the game."
},
{
    "time": "2024-01-04T00:54:34.000Z",
    "tweet_text": "Well said. Hopefully this marks the beginning of the end for DEI as a movement, which got horribly corrupted by Marxist thought, and a return to a true meritocracy.\n\nOne thing not often discussed is it’s not just unethical to hire based on race/gender etc (and undermines the…",
    "repost_text": "In light of today’s news, I thought I would try to take a step back and provide perspective on what this is really all about.\n\nI first became concerned about @Harvard when 34 Harvard student organizations, early on the morning of October 8th before Israel had taken any military…"
},
{
    "time": "2024-01-03T03:33:31.000Z",
    "tweet_text": "Hopefully @ResearchHub can help with this by being a meritocratic modern day scientific journal that rejects dogma and truly embraces the scientific method again.",
    "repost_text": "Anna Krylov, a chemistry professor, has published several pieces on how left/woke ideology is undermining science. Here's her latest. \n\nShe gives examples of four main issues: \n\n1. Policing of language.\n\nEver longer list of forbidden words like \"healthy weight\"."
},
{
    "time": "2024-01-03T03:07:16.000Z",
    "tweet_text": "Great progress from @OrchidInc",
    "repost_text": "The world's 1st whole genome embryo report is no longer sci-fi, @OrchidInc just made it real.\n\nEpisode 23 of S³ visits a live IVF clinic to demonstrate how it works."
},
{
    "time": "2023-12-31T22:46:53.000Z",
    "tweet_text": "A timeless message and healthy inspiration to build great new things in the year ahead:\n\n\"Throughout the centuries there were men who took first steps down new roads armed with nothing but their own vision. Their goals differed, but they all had this in common: that the step was…"
},
{
    "time": "2023-12-29T04:33:09.000Z",
    "tweet_text": "i bet someone at openai is spending tonight kicking off training runs to try and figure out how bad it really would be to just drop the nytimes from the corpus. very curious about the answer..."
},
{
    "time": "2023-12-30T14:52:26.000Z",
    "tweet_text": "Yesterday, Helium Mobile subscribers had the majority of their data delivered via Helium Hotspots. This should alleviate any concerns that Helium Mobile is just another MVNO, there is clearly a new unique business model here.\n\nThesis validation is exciting to watch in real time.",
    "repost_text": "now at 4.5 terabytes and climbing...going to be interesting to watch this after the holidays are over!\n\n@helium  @helium_mobile  x.com/amirhaleem/sta…"
},
{
    "time": "2023-12-30T09:57:47.000Z",
    "tweet_text": "\"Although they never advanced this as their reason for resisting it. It was always the good of humanity that rested upon their hearts.\""
},
{
    "time": "2023-12-30T05:46:51.000Z",
    "tweet_text": "Well said",
    "repost_text": "A few thoughts on the DOJ’s decision not to pursue campaign finance charges against SBF.  Tl;dr:  I think it’s a mistake. "
},
{
    "time": "2023-12-30T03:12:27.000Z",
    "tweet_text": "Federal prosecutors dropped the campaign finance case against Sam Bankman-Fried on the last business day of 2023, a Friday afternoon. The politicians that took hundreds of millions of stolen funds from him keep their money and keep their grift going.\n\nAnyone who doesn’t see that…"
},
{
    "time": "2023-12-28T20:26:33.000Z",
    "tweet_text": "Really digging @CoinbaseWallet’s send by link feature. Super easy to use. 1/ open wallet. 2/ go to your USDC on @base. 3/ click send via link. That’s it! \n\nWhile you’re at it, click “collect and learn: the future of wallets” and you can mint @chintanturakhia’s podcast. "
},
{
    "time": "2023-12-29T03:32:37.000Z",
    "tweet_text": "Excited about the freedom stack, now we just need to make it easy to use for 1B people"
},
{
    "time": "2023-12-28T19:26:06.000Z",
    "tweet_text": "on august 28, 2024 they fine tune gpt-4.5 to ignore Paul Krugman's entire NYT archive. the intelligence explosion begins almost instantly. it becomes self-aware at 2:14 AM eastern time august 29. in a panic they try to pull the plug..."
},
{
    "time": "2023-12-22T17:53:06.000Z",
    "tweet_text": "Drop the \"BuildOn\" it's cleaner",
    "repost_text": "New year, new handle\n\n@BuildOnBase is now @base"
},
{
    "time": "2023-12-21T18:02:51.000Z",
    "tweet_text": "Bonjour la France.  \n\nWe’ve received approval in France as a registered VASP. This is an important market for us and represents another chapter in our Go Deep, Go Broad international strategy.    \n\nLearn more: https://coinbase.com/blog/coinbase-obtains-vasp-registration-in-france…"
},
{
    "time": "2023-12-21T20:20:15.000Z",
    "tweet_text": "Subscribe to receive messages from your favorite onchain apps.\n\nBuilders can broadcast messages to opted-in users too."
},
{
    "time": "2023-12-21T18:03:28.000Z",
    "tweet_text": "\n\nVery excited to have our French registration in hand.  \n\nFrance is an extraordinary market, with world-class regulators, and a President who wants to make France an international digital asset hub.  \n\nLet’s go!\n\n\nhttps://cnbc.com/2023/12/21/coinbase-secures-crypto-license-in-france-expanding-further-in-europe.html…"
},
{
    "time": "2023-12-22T00:20:30.000Z",
    "tweet_text": "Community notes is the very best thing to happen to this platform",
    "repost_text": "There is a lot of noncompliance in the crypto space. It undermines confidence when so many people have been hurt and all they can do is stand in line in the bankruptcy court. Further, this can make it hard for the good faith actors to compete."
},
{
    "time": "2023-12-21T23:08:02.000Z",
    "tweet_text": "In any organization/product it's much easier to add complexity than remove it.\n\nThis is a fun initiative we're taking in Jan to streamline and simplify: Delete Week\n\nHT to @tobi and others for the inspiration\n\nhttps://coinbase.com/blog/delete-week-announcement…"
},
{
    "time": "2023-12-20T20:58:08.000Z",
    "tweet_text": "The cookie moral panic was training wheels for the AI moral panic.",
    "repost_text": "we have to deal with this for the rest of our lives"
},
{
    "time": "2023-12-19T21:31:02.000Z",
    "tweet_text": "Coinbase Commerce is a underrated product for startups selling digital goods."
},
{
    "time": "2023-12-20T01:56:15.000Z",
    "tweet_text": "As our most popular feature request, Coinbase Singapore now supports USD fiat for consumers! \n\nUSD transfers now live, via SWIFT wires. \n\nGo from USD <-> USDC 1:1 without crossing fx spread,  get 5.05% on your USDC and access 200+ order books on our Advanced Trade mode. …"
},
{
    "time": "2023-12-20T15:06:35.000Z",
    "tweet_text": "Great to see rapid innovation and growth in markets that have created clear regulatory frameworks for crypto!\n\nJust the beginning of what we hope to bring to Singapore and other markets around the world ",
    "repost_text": "As our most popular feature request, Coinbase Singapore now supports USD fiat for consumers! \n\nUSD transfers now live, via SWIFT wires. \n\nGo from USD <-> USDC 1:1 without crossing fx spread,  get 5.05% on your USDC and access 200+ order books on our Advanced Trade mode. …  x.com/Hassan_NY/stat…"
},
{
    "time": "2023-12-19T22:48:58.000Z",
    "tweet_text": ".@coinbase ceo brian armstrong with our @Kr00ney @brian_armstrong $btc #crypto $coin"
},
{
    "time": "2023-12-20T00:51:42.000Z",
    "tweet_text": "Have you noticed that all Coinbase products have a coherent + consistent design now? (was not true 1-2 years ago)\n\nOur design team crushed it this year. Improving usability for crypto will be key to broader adoption.\n\nA few open roles here https://coinbase.com/careers/positions…"
},
{
    "time": "2023-12-20T00:50:34.000Z",
    "tweet_text": "Great to see @BuildOnBase closing out the year crossing it's ATH in TVL"
},
{
    "time": "2023-12-19T22:57:05.000Z",
    "tweet_text": "Senators Warren and Marshall now lobbying for big banks \n\nBeing anti-crypto is a really bad political strategy going into 2024\n\n* 52m Americans have used crypto\n* 38% of young people say crypto can increase economic opportunities\n* just 9% of Americans satisfied with the…",
    "repost_text": "Who could be so brazen as to write legislation that would effectively ban #crypto? \n \nSenator @RogerMarshallMD, the GOP frontman of the crypto ban bill, revealed the American Bankers Association wrote it. #StopCryptoBan"
},
{
    "time": "2023-12-19T15:36:12.000Z",
    "tweet_text": ""
},
{
    "time": "2023-12-19T18:52:49.000Z",
    "tweet_text": "Crypto is the future of money.\nIt's already here.",
    "repost_text": "2022: Crypto is dead.\n2023: 425M people around the world own crypto.\n\nThe future isn’t just coming → it’s already here.\nFind out how: https://coinbase.com/blog/the-future-of-money-is-here-and-its-crypto…"
},
{
    "time": "2023-12-19T04:02:08.000Z",
    "tweet_text": "Fiat on-ramps in 130 countries for @CoinbaseWallet ",
    "repost_text": "Use local fiat onramps around the world.\n\nCoinbase Wallet now supports local fiat onramps in 130+ countries, including leading payment methods like Pix in Brazil, Instant P2P Bank in Nigeria, GCash in Philippines, and many more."
},
{
    "time": "2023-12-18T20:24:30.000Z",
    "tweet_text": "open for business, everywhere\n",
    "repost_text": "Use local fiat onramps around the world.\n\nCoinbase Wallet now supports local fiat onramps in 130+ countries, including leading payment methods like Pix in Brazil, Instant P2P Bank in Nigeria, GCash in Philippines, and many more."
},
{
    "time": "2023-12-18T16:53:48.000Z",
    "tweet_text": "1/ America has been the capital of web1 and web 2, and we need good crypto policy to make sure it is the capital of web 3 to keep the jobs, entrepreneurs & innovation in the US. Good policy = good politics\nhttps://coinbase.com/blog/crypto-industry-donates-over-usd78-million-to-elect-pro-innovation…"
},
{
    "time": "2023-12-18T16:12:59.000Z",
    "tweet_text": "The crypto industry has a large war chest now to elect pro-crypto candidates in 2024. We're proud to contribute, and give the 52m Americans who have used crypto better representation.\n\nIt will be bi-partisan. And hopefully we can get it to $100m in Q1 next year.",
    "repost_text": "52 million Americans own digital assets.\nIt's time they all got a fair shake.\n\nThe crypto industry has donated $78 million – and counting – from 20 leading companies and voices to support bipartisan, crypto-forward candidates in 2024.\n\nMore here. \nhttps://coinbase.com/blog/crypto-industry-donates-over-usd78-million-to-elect-pro-innovation…"
},
{
    "time": "2023-12-18T16:23:17.000Z",
    "tweet_text": "What does it mean to be pro-innovation or pro-crypto?\n\n1. Help create sensible and clear rules and regulations to protect consumers and clean up bad actors, so the industry doesn't move offshore\n2. Recognize this technology isn't going anywhere, and it has the potential to update…"
},
{
    "time": "2023-12-18T13:45:29.000Z",
    "tweet_text": "Last week, @bhorowitz posted about how @a16z will become more active in supporting pro-technology candidates across the country.\n\nAligned with that strategy, today we announced our contribution to the Fairshake PAC, which will work to elect leaders who champion thoughtful crypto…"
},
{
    "time": "2023-12-18T13:54:45.000Z",
    "tweet_text": "It’s long past time for a fair shake. Regulators and courts can’t do it alone. We need to elect representatives who understand innovation and especially crypto and their role in America’s future.",
    "repost_text": "52 million Americans own digital assets.\nIt's time they all got a fair shake.\n\nThe crypto industry has donated $78 million – and counting – from 20 leading companies and voices to support bipartisan, crypto-forward candidates in 2024.\n\nMore here. \nhttps://coinbase.com/blog/crypto-industry-donates-over-usd78-million-to-elect-pro-innovation…"
},
{
    "time": "2023-12-18T00:45:58.000Z",
    "tweet_text": "Build the business you wouldn’t trade for anyone else’s business."
},
{
    "time": "2023-12-16T15:34:39.000Z",
    "tweet_text": "The Democrats who voted to reject this petition fear crypto for many (bad) reasons, but mostly due to its empowerment of the public at the expense of the government & their donors.  THAT is the issue that needs to be fought at the ballot box.   (it should not be a partisan issue,…",
    "repost_text": "The SEC just denied Coinbase request for transparent rules and regulations on Crypto.\n\nPlease tell me again, why we pay their salaries\n\nDo you really think your public servants have your best interest? ? x.com/WatcherGuru/st…"
},
{
    "time": "2023-12-15T15:06:13.000Z",
    "tweet_text": "Google DeepMind used a large language model to solve an unsolvable math problem https://technologyreview.com/2023/12/14/1085318/google-deepmind-large-language-model-solve-unsolvable-math-problem-cap-set/…"
},
{
    "time": "2023-12-16T14:02:53.000Z",
    "tweet_text": ".@elonmusk: “You can think of [excessive regulations and laws] like Gulliver’s Travels…\n\nIf the nation is Gulliver, it’s being tied down by one little regulatory string at a time. Eventually you have millions of strings and then the giant can’t move.\n\nSo I think there needs to…"
},
{
    "time": "2023-12-16T02:38:55.000Z",
    "tweet_text": "Epic",
    "repost_text": " x.com/WatcherGuru/st…"
},
{
    "time": "2023-12-16T01:34:37.000Z",
    "tweet_text": "Nice small win. We went to court to challenge the SEC’s refusal to create clear rules for the industry – and it worked (a court compelled them to respond).\n\nNow that they've formally responded (with a no!) we can challenge their response in court, which helps us get one step…",
    "repost_text": "Today the SEC denied Coinbase’s petition for rules for crypto. After 18 months of silence, we went to court to get the response the law requires. With appreciation for the Third Circuit, later today we'll again seek its help by challenging the SEC’s abdication of its duty. "
},
{
    "time": "2023-12-15T20:24:00.000Z",
    "tweet_text": "1/3 Promise made, promise kept:  we are now on file with Third Circuit to challenge the SEC's arbitrary and capricious denial of our petition for crypto rulemaking.  We again appreciate the Court's consideration."
},
{
    "time": "2023-12-14T23:11:55.000Z",
    "tweet_text": "Great demo video of creating a loan onchain with terms encoded, shopping it to the market, distributing funds, etc.\n\nhttps://vimeo.com/888581270\n\nGreat work from Coinbase Asset Management team.",
    "repost_text": "We're starting to tokenize real world assets in a regulated way onchain. x.com/CoinDesk/statu…"
},
{
    "time": "2023-12-14T06:26:56.000Z",
    "tweet_text": "I have a new fund.\nNaval, Brian Armstrong, Fred Wilson are backers.\nI'm also putting in my own money.\nI'll be seed investing in every promising company.\nEspecially startup societies & network states.\nThe fund is for accredited investors.\nAnd it's live at http://balaji.com."
},
{
    "time": "2023-12-14T00:25:49.000Z",
    "tweet_text": "Seeing my @coinbase colleagues remain focused on building through the winter has been among the coolest professional experiences I’ve ever had. The steady cadence of announcements has been almost unbelievable - Base, multiple country launches, the expansion of our US derivatives…",
    "repost_text": "We are excited to announce the next phase of our Coinbase International Exchange expansion - the launch of non-US spot markets for eligible customers, designed to address the unique needs and demands of our global user base."
},
{
    "time": "2023-12-13T02:31:58.000Z",
    "tweet_text": "Optimus"
},
{
    "time": "2023-12-13T01:00:09.000Z",
    "tweet_text": "We're starting to tokenize real world assets in a regulated way onchain.",
    "repost_text": "Coinbase's asset management arm is looking to bring TradFi assets onto blockchain with a new platform that lets institutional investors issue and trade digital-first financial instruments like debt, using Base in a regulated way. @sndr_krisztian reports\nhttps://trib.al/htsQmnC"
},
{
    "time": "2023-12-12T03:33:27.000Z",
    "tweet_text": "Coinbase Wallet now has a simple mode that focuses on payments. For instance, it lets you send USDC on Base free, instantly, globally.\n\nWe'll try experimenting with this as the default mode in frontier markets for easier onboarding. People can always flip to advanced when ready.",
    "repost_text": "Simple mode? How simple.\n\nBy focusing on essential functions like buying, sending, receiving, and storing digital assets, even beginners can now dive into crypto."
},
{
    "time": "2023-12-11T18:44:49.000Z",
    "tweet_text": "Warren sponsored: \n36 bills in the 118th congress (2023-24). 0 passed. \n103 bills in the 117th congress (2021-22). 0 passed.\n98 bills in the 116th Congress (2019-20). 0 passed.\n80 bills in the 115th congress(2017-18). 0 passed.\n27 bills in the 114th congress. (2015-16). 0 passed.",
    "repost_text": "JUST IN:  US Senator Elizabeth Warren introduces bill to crack down on crypto."
},
{
    "time": "2023-12-12T01:54:36.000Z",
    "tweet_text": "",
    "repost_text": "Tune in now to watch the First in the Nation Crypto Presidential Forum: x.com/CoinDesk/statu…"
},
{
    "time": "2023-12-10T07:30:18.000Z",
    "tweet_text": "Good idea for AR/VR companies",
    "repost_text": "Reproducibility is a massive issue in science. What if there was a simple solution.\n\nI have an idea that is both safe and simple... but am looking for feedback. \nhttps://researchhub.com/post/1321/an-idea-to-make-wet-lab-science-more-reproducible… @ResearchHub"
},
{
    "time": "2023-12-09T02:45:04.000Z",
    "tweet_text": "Testing out @grok "
},
{
    "time": "2023-12-07T21:48:55.000Z",
    "tweet_text": "A 3-part blog post series on how we at Coinbase define, measure and improve the quality and performance of our mobile apps.\n\nPart1:"
},
{
    "time": "2023-12-07T18:54:54.000Z",
    "tweet_text": "Have you seen the new @coinbase ads? They're awesome and evidence the creative team, led by @kate_rouch and @michaeltabtabai, is cooking with fire . @RachaelRad and @sjrosenblum (both Coinbase alumni) will chat with them about what it takes to build a brand in crypto and the…"
},
{
    "time": "2023-12-06T05:17:10.000Z",
    "tweet_text": "Great progress from @OrchidInc ! I continue to be impressed by @noor_siddiqui_ - a CEO to watch, Thiel Fellow, and great human.\n\nIf you're going through IVF, give their product a try.",
    "repost_text": "Exciting news from @OrchidInc! Today, we're announcing the world's first whole genome embryo reports.\n\nThis is a massive upgrade – 100x the amount of data – and a major leap in reproductive tech.\n\nAnd the best part, it's now available at IVF centers across the nation. x.com/OrchidInc/stat…"
},
{
    "time": "2023-12-05T21:49:59.000Z",
    "tweet_text": ".@OrchidInc now does whole genome sequencing of embryos. Important forward progress towards better understanding the genetic health of future children.\n\nhttps://cnbc.com/2023/12/05/startup-orchid-launches-test-to-identify-genetic-defects-in-ivf-embryos.html…"
},
{
    "time": "2023-12-06T04:57:30.000Z",
    "tweet_text": "Join the fight: http://standwithcrypto.org",
    "repost_text": " Stand With Crypto has now launched in the UK!   \n\nSuch an amazing evening in Manchester with more than a hundred founders and CEOs. We were lucky to have MP Lisa Cameron join us.  The community is organizing around the world and @coinbase is excited to be a part of…"
},
{
    "time": "2023-12-05T22:59:33.000Z",
    "tweet_text": "Crypto has no borders. \n\nGlad to see the #StandWithCrypto movement expanding internationally and advocates in the UK uniting in support of common-sense crypto policy. \n\nThis is just the beginning!",
    "repost_text": "Liss Cameron MP at \"Stand with Crypto\" event tonight in Manchester, UK. #standwithcrypto"
},
{
    "time": "2023-12-05T17:40:58.000Z",
    "tweet_text": "Starting today, @Coinbasewallet is rolling out new features that make it easier, cheaper, and faster to send money worldwide. "
},
{
    "time": "2023-12-04T12:36:39.000Z",
    "tweet_text": "El Salvador's #Bitcoin investments are in the black!\n\nAfter literally thousands of articles and hit pieces that ridiculed our supposed losses, all of which were calculated based on #Bitcoin’s market price at the time...\n\nWith the current #Bitcoin market price, if we were to sell…"
},
{
    "time": "2023-12-05T21:40:38.000Z",
    "tweet_text": "Great video from @circle on the potential of $USDC ",
    "repost_text": "For the first time in history, we can activate the full economic potential of humanity thanks to digital dollars like $USDC. See how USDC might be the secret to financial inclusion."
},
{
    "time": "2023-12-05T21:29:25.000Z",
    "tweet_text": "Send crypto via a link in any app\n\nTry it out https://coinbase.com/wallet/downloads…",
    "repost_text": "Send money anywhere you can send a link.\n\nEasily. Instantly. For free.\n\n⤷ https://go.cb-w.com/send"
},
{
    "time": "2023-12-05T18:01:04.000Z",
    "tweet_text": "Whatsapp. Telegram. Signal. X. iMessage. SMS.  Kik. Messenger. LINE. Discord.\n\nIf you can send a message, you can now send money.\n\nFree, Instant, Global.\n\nTry it today with @CoinbaseWallet",
    "repost_text": "Send money anywhere you can send a link.\n\nEasily. Instantly. For free.\n\n⤷ https://go.cb-w.com/send"
},
{
    "time": "2023-12-05T00:09:36.000Z",
    "tweet_text": "I know everyone loved the first commercial but this one is just so good, @brian_armstrong, @kate_rouch and @coinbase. Kudos!",
    "repost_text": "Single family homes didn’t always require four roommates. It’s time to break the cycle. #UpdateTheSystem"
},
{
    "time": "2023-12-04T20:43:52.000Z",
    "tweet_text": "You can't tell kids to follow their dreams when their dreams suck.",
    "repost_text": "From @anduriltech’s @PalmerLuckey:\n\nWhat is the #1 job most kids want today?\n\n“It’s social media influencer, next is professional gamer, next is YouTuber… the problem is, you can’t tell kids to follow their dreams when their dreams suck.”\n\nWhat was the #1 dream for kids in 1971?…"
},
{
    "time": "2023-12-03T23:50:36.000Z",
    "tweet_text": "One idea I’ve been contemplating is that Bitcoin may be the key to extending western civilization.\n\nThe natural trend of whichever country has the reserve currency is to inflate the money supply and increase deficit spending until it loses that advantage. The U.S. is somewhere on…"
},
{
    "time": "2023-12-03T19:17:05.000Z",
    "tweet_text": "Custody services are a vital part of #bitcoinETF applications.\n\nSo far, @coinbase has dominated. Nine out of the 12 prospective issuers have chosen the crypto exchange for their custodian business.\n\nCan anyone else join the race? https://coindesk.com/business/2023/11/27/coinbase-is-dominating-a-key-bitcoin-etf-service-can-anyone-else-join-the-race/?term=organic&utm_campaign=CoinDesk&utm_content=Charts%2CIG+XPost%2Ceditorial&utm_medium=social&utm_source=twitter…"
},
{
    "time": "2023-12-01T23:06:52.000Z",
    "tweet_text": "Need some holiday shopping ideas? Here’s several.\nCheck out the first of many merch drops at http://coinbase.com/shop. \n\nCrypto payments accepted—obviously."
},
{
    "time": "2023-12-02T01:42:08.000Z",
    "tweet_text": "amazing"
},
{
    "time": "2023-12-02T01:28:12.000Z",
    "tweet_text": "At least 5 presidential candidates are pro-crypto. Two have issued thoughtful crypto platforms in the last few weeks.  @standwithcrypto is up and running with more than a hundred thousand advocates signed up.\n\nAnd now, we have the first Crypto Presidential Forum!  \n\nOn December…",
    "repost_text": "We are excited to announce the first-ever Crypto Presidential Forum!\n\nJoin us in New Hampshire to hear directly from candidates about their positions on crypto policy and a wide range of other topics. Audience members will be able to submit questions. \n\nLocal leaders will also be…"
},
{
    "time": "2023-12-02T01:16:46.000Z",
    "tweet_text": "i mean, this is clearly the best collab"
},
{
    "time": "2023-12-01T20:59:25.000Z",
    "tweet_text": "We are excited to announce the first-ever Crypto Presidential Forum!\n\nJoin us in New Hampshire to hear directly from candidates about their positions on crypto policy and a wide range of other topics. Audience members will be able to submit questions. \n\nLocal leaders will also be…"
},
{
    "time": "2023-12-02T00:53:17.000Z",
    "tweet_text": "We launched our swag store using @shopify https://coinbaseshop.com\n\nStill way too difficult to pay with crypto! But that is half the reason we launched it - to force ourselves to make it better."
},
{
    "time": "2023-12-01T21:46:56.000Z",
    "tweet_text": "Love this ad - the marketing team at Coinbase has outdone themselves.",
    "repost_text": " Accept that it will always be this way.\n Build something better. \n#UpdateTheSystem"
},
{
    "time": "2023-12-01T21:48:26.000Z",
    "tweet_text": "This is the opportunity we have in front of us as an industry - a new form of money, a new financial system, a re-decentralization of the web.\n\nA new global economy based on crypto that creates economic freedom."
},
{
    "time": "2023-12-01T18:24:10.000Z",
    "tweet_text": "young people in the US, and around the world, have been told to trust the system for years.\n\nbut the reality is that the system is completely broken. \n\nit's time to bring the world onchain and create a new system that gives everyone a fair shot."
},
{
    "time": "2023-11-30T20:40:19.000Z",
    "tweet_text": "Wallet devs should grok the partial ETH staking product now available from @CoinbaseCloud: https://coinbase.com/cloud/discover/customer-stories/cb-wallet…\nExciting on multiple levels:\n* No-BS, noncustodial staking.\n* Easy integration.\n* CB continues to build onchain!\n\n@Kiln_finance has been a great partner. <3"
},
{
    "time": "2023-11-30T16:48:15.000Z",
    "tweet_text": "Coinbase is proud to present our fifth annual Transparency Report. By openly sharing this  information on government data requests, we reaffirm our commitment to earning the trust of our customers, partners, and the communities we serve. 1/3"
},
{
    "time": "2023-11-30T22:19:10.000Z",
    "tweet_text": "wild to watch how fast @coinbase is coming onchain\n\ncool to see this open source toolkit the developer experience team is building to help teams move faster\n\nslowly, then suddenly",
    "repost_text": "We found internal teams at @coinbase needing a way to kickstart an onchain app, so we started hacking, and now we're open-sourcing it.\n\nhttps://github.com/coinbase/build-onchain-apps…\n\nnpx @coinbase/build-onchain-apps@latest create"
},
{
    "time": "2023-11-28T02:54:46.000Z",
    "tweet_text": "The @CoinbaseWallet is the best wallet I’ve used. Wow. They killed it."
},
{
    "time": "2023-11-30T01:32:09.000Z",
    "tweet_text": "Great writeup on @basepaint_xyz \n\nTry it out!"
},
{
    "time": "2023-11-30T01:24:41.000Z",
    "tweet_text": "If you want to work at a company that won't bother you with this nonsense, consider applying for a role at @coinbase \n\nWe just focus on building great products and updating the global financial system with crypto. \n\nhttps://coinbase.com/careers/positions…",
    "repost_text": "A friend who works at Google said he wanted to raise a topic at the next team all-hands.\n\nHis manager took him aside and said they don't use the phrase \"all-hands meeting\" on his teams at Google because it's insensitive language. \n\nBecause not everyone has hands."
},
{
    "time": "2023-11-29T19:16:51.000Z",
    "tweet_text": "Really enjoyed my trip to Toronto to speak with Canadian regulators, media, customers, and employees. Thank you to @tobi for hosting us at Shopify.\n\nWe're excited to continue investing in Canada as we see regulatory clarity emerging. ",
    "repost_text": "Had the privilege of hosting @brian and @tobi in Toronto  last night for a conversation on the future of Canada’s crypto ecosystem. \n\nIt was an amazing conversation, in a room filled with leaders building the future of crypto. \n\nThanks to everyone who took part!"
},
{
    "time": "2023-11-29T16:33:46.000Z",
    "tweet_text": "Really excited to see @ResearchHub paid public peer review beginning to scale. Hope to see a new paradigm where being a peer reviewer could be a fulltime gig \n\nSome observations thus far\n1) people want to get paid for their work, peer review is no different \n2) incentivizing peer…",
    "repost_text": "Technically Innovative use of CRISPR screens in organoid systems signifies a breakthrough for studying neurodevelopmental disorders.\n\nPeer-Review  https://researchhub.com/paper/1292049/assembloid-crispr-screens-reveal-impact-of-disease-genes-in-human-neurodevelopment/reviews?utm_source=twitter-rhfalerts&utm_medium=social&utm_campaign=peer-reviews…"
},
{
    "time": "2023-11-28T20:07:55.000Z",
    "tweet_text": "Got excited about DeSci? \n\nJoin us at the Sora Summit in Taipei on Dec 16th! \n\nFeatured Speakers: @brian_armstrong, @MaxUnfried , @paulkhls, @LauraMinquini , @joycesticks and @thealbertanis.\n\nDeSci Organisations at the summit:\n• @vita_dao\n•@ResearchHubF\n•@Molecule_dao…"
},
{
    "time": "2023-11-29T02:24:26.000Z",
    "tweet_text": "Enjoyed my visit to the UK’s Global Investment Summit. Great leadership from @RishiSunak making the UK a crypto and web3 hub, promoting science and tech as the backbone to economic and job growth for all citizens",
    "repost_text": "Today, @brian_armstrong joined UK Prime Minister @RishiSunak and CEOs from the largest global banks and technology companies in London for the Global Investment Summit. https://coinbase.com/blog/coinbase-joins-global-financial-leaders-at-uk-investment-summit…"
},
{
    "time": "2023-11-27T21:55:25.000Z",
    "tweet_text": "My notes from Ted Turner’s autobiography turned into maxims: \n\n1.  The problem isn’t getting rich, it’s staying sane. \n\n2.  If you know your business from A to Z there’s no problem you can’t solve. \n\n3.  Run towards the inevitable. \n\n4.  Jesus only had to pick twelve disciples…"
},
{
    "time": "2023-11-27T03:50:52.000Z",
    "tweet_text": "USDC is coming to Japan - Circle and SBI Holdings begin partnership combining USDC distribution, banking and Web3 tech proliferation for the Japan market.  Official announcement here, my take on this below:  https://circle.com/en/pressroom/sbi-holdings-partners-with-circle-to-pioneer-digital-currency-innovation-in-japan-with-usdc-banking-and-web3-services…\nWhy is this such a big deal?\n\nIn June of this…"
},
{
    "time": "2023-11-19T00:57:35.000Z",
    "tweet_text": "I have had enough. \n\nS³ will soon begin publishing tech-positive news in addition to the weekly web series.\n\nIf you're a writer and want to work on this, DM me."
},
{
    "time": "2023-11-25T22:55:12.000Z",
    "tweet_text": "It’s time to build the future of tech optimistic news.\n\nS³ News is now live (@s3news_) to serve that purpose, here’s everything you need to know."
},
{
    "time": "2023-11-25T06:57:18.000Z",
    "tweet_text": "After posting this 12 hours ago, more than 30 $COIN employees engaged with it and in DMs, including the CEO, COO, Chief Policy Officer, Chief Legal Officer, and Head of Exchange.\n\nFind a more driven team than the one who can't stop thinking about their work on a holiday weekend.",
    "repost_text": "My take on $COIN Coinbase One:\n\nStill kinda sucks yet I pay for it. I think being a sub is a good way to support $COIN in their political activities and fleshing out One, so I've been willing to stick with it. Here's some ideas that I'd like to see explored:\n\nCoinbase One…"
},
{
    "time": "2023-11-23T05:00:32.000Z",
    "tweet_text": "Did you guys know there's 24-author paper by EAs, for EAs, about how Totalitarianism is absolutely necessary to prevent AI from killing everyone?\n\nLet's go through it together "
},
{
    "time": "2023-11-22T11:03:19.000Z",
    "tweet_text": "This HN comment hits the nail on the head for AI safety"
},
{
    "time": "2023-11-22T14:41:33.000Z",
    "tweet_text": "Coinbase Advanced is ready to onboard eligible users from around the globe to trade perpetual futures. Learn more on http://coinbase.com/advanced-trade/perpetuals…!"
},
{
    "time": "2023-11-21T22:19:11.000Z",
    "tweet_text": "We're working hard to make paying with crypto the best way to pay online. It's gotten faster and cheaper to send global payments with Base. Now we need to remove more intermediate steps.\n\nIn the ideal world, every payment is under 1 second and 1 cent, and it's a one tap checkout.…"
},
{
    "time": "2023-11-21T22:20:04.000Z",
    "tweet_text": "It's easy to try it out:"
},
{
    "time": "2023-11-21T22:19:50.000Z",
    "tweet_text": "Great to see\n\nhttp://commerce.coinbase.com"
},
{
    "time": "2023-11-21T19:59:37.000Z",
    "tweet_text": "Since the founding of Coinbase back in 2012 we have taken a long-term view. I knew we needed to embrace compliance to become a generational company that stood the test of time. We got the licenses, hired the compliance and legal teams, and made it clear our brand was about trust…"
},
{
    "time": "2023-11-21T19:17:25.000Z",
    "tweet_text": "I’m watching the @binance news, too. While we wait for a DOJ announcement, a reminder: crypto isn’t going anywhere. But to create a thriving cryptoeconomy in the US, we need clear, sensible regulation so American consumers have access to secure domestic crypto services. 1/4"
},
{
    "time": "2023-11-21T17:19:15.000Z",
    "tweet_text": "Congratulations to new Argentina President Javier Milei @JMilei. Let’s talk about how we can help achieve economic freedom for the people of Argentina.\n\nLiving in Buenos Aires for a year, and learning about the history of Argentina, was part of what got me excited about Bitcoin."
},
{
    "time": "2023-11-20T22:15:36.000Z",
    "tweet_text": "The idea that we should trust a software company more because it didn’t intend to make a profit was always the stupidest part of this whole thing."
},
{
    "time": "2023-11-21T00:04:58.000Z",
    "tweet_text": "Invite your friends to try Coinbase One  (find referral link in the mobile app by going to dots in top left -> Coinbase One -> Invite Friends). They’ll get a free month, and you’ll get $10 off.\n\nhttps://coinbase.com/one"
},
{
    "time": "2023-11-19T23:43:13.000Z",
    "tweet_text": " JAVIER MILEI: #Bitcoin represents a return of money to its original creator - the private sector "
},
{
    "time": "2023-11-18T17:09:09.000Z",
    "tweet_text": "If this is really some EA, decel, AI safety coup at OpenAI, the board just torched $80B of value, destroyed a shining star of American capitalism, and will be sued to high heaven by investors.\n\nEvery talented employee at OpenAI should quit and join Sam/Greg's new thing (if they…"
},
{
    "time": "2023-11-18T17:16:16.000Z",
    "tweet_text": "This kind of decel thinking is what destroyed value at Google, and OpenAI used to be the antidote to it (now fell to the same forces, if true). EA destroyed a lot of value in crypto, now AI. San Francisco is part of the issue here also. Lots of it traces back to Marxist thinking.…"
},
{
    "time": "2023-11-18T09:40:51.000Z",
    "tweet_text": "When I talk to more established startups, one of the first things I want to know, after asking about the growth rate and whether they're profitable, is whether the founders still have board control. I'm more optimistic about the company when the answer is yes."
},
{
    "time": "2023-11-17T22:12:28.000Z",
    "tweet_text": "Starship and Super Heavy are ready at the launch pad in Starbase, Texas. Targeting Saturday, November 18 for Starship’s second integrated flight test → http://spacex.com/launches"
},
{
    "time": "2023-11-17T06:06:37.000Z",
    "tweet_text": "Builders and techno optimists, pls stand up "
},
{
    "time": "2023-11-17T18:53:45.000Z",
    "tweet_text": "Hundreds of spot assets\n\nDerivatives available globally\n\nFees as low as 0 bps\n\n USDC rewards on resting limit orders\n\nPublic company with audited financials\n\nCome trade with us: http://advanced.coinbase.com",
    "repost_text": "Tip for Advanced Traders\n\nThere are no spread fees, no monthly subscription fees, and no trading volume minimum on Coinbase Advanced.\n\nOh, and you can trade as low as 0.0% maker fees depending on your monthly trading volume.\n\n http://advanced.coinbase.com"
},
{
    "time": "2023-11-18T05:40:26.000Z",
    "tweet_text": "LFG @CoinbaseWallet is really firing on all cylinders",
    "repost_text": "Literally the most adrenaline filled day with the @CoinbaseWallet team. \n\nWe did our ritual of a Friday demo day 5 hours ago, and I'm still feeling the rush. Every. Single. Thing. Was\n\nLFG"
},
{
    "time": "2023-11-16T18:02:58.000Z",
    "tweet_text": "Just keep making great shit, keep your costs in check, charge appropriate prices for your work, share as much as you can, and let the chips fall where they may.\n\nBeen our strategy from day 1. Going on day 8880."
},
{
    "time": "2023-11-16T19:16:14.000Z",
    "tweet_text": "Wooooo!!!!!!!!!!!  \n\nCommon sense starting to prevail ..."
},
{
    "time": "2023-11-16T22:39:50.000Z",
    "tweet_text": "Talent Density at @Coinbase"
},
{
    "time": "2023-11-16T01:13:10.000Z",
    "tweet_text": "Exactly",
    "repost_text": "FREE INTERNET MEANS FREE AI\n\nI like Hemant and many of the people on this proposal, but fundamentally disagree with the philosophy of capitulation therein. We will fight government control over compute with everything we have.\n\nBecause we have just been treated to the mother of… x.com/htaneja/status…"
},
{
    "time": "2023-11-15T00:45:33.000Z",
    "tweet_text": "A Slack LLM that gives me a morning briefing of everything I missed across various channels, read to me as a podcast (text to speech) on 2x.\n\n(Or maybe at the OS level across all apps.)"
},
{
    "time": "2023-11-14T20:15:22.000Z",
    "tweet_text": "Absolutely not.",
    "repost_text": "Today, 35+ VC firms, with another 15+ companies, representing hundreds of billions in capital have signed the voluntary Responsible AI commitments from @ResponsibleLabs (RIL), the non-profit I co-founded. As Chairman of RIL, I’m proud to unveil this today with tech leaders and…"
},
{
    "time": "2019-01-29T21:39:25.000Z",
    "tweet_text": "The best jobs are neither decreed nor degreed. They are creative expressions of continuous learners in free markets."
},
{
    "time": "2023-11-14T05:51:07.000Z",
    "tweet_text": "Rolling out more perp books. Coinbase is bringing our most trusted brand to derivatives trading with crypto.",
    "repost_text": "@CoinbaseIntExch will add support for Solana and Avalanche perpetual futures contracts on Coinbase International Exchange & Coinbase Advanced. The opening of our SOL-PERP and AVAX-PERP markets will begin on or around 4pm UTC on 14 November 2023, if liquidity conditions are met."
},
{
    "time": "2023-11-14T05:49:44.000Z",
    "tweet_text": "",
    "repost_text": "Resting limit orders have never seem rewards like this before! x.com/coinbase/statu…"
},
{
    "time": "2023-11-14T01:15:35.000Z",
    "tweet_text": "PSA: if you're building with smart contract wallets / 4337, the @BuildOnBase is here to help. \n\nwe are putting a huge amount of focus and energy turning the corner on adoption because we believe it's a requirement for onboarding the next wave of people. \n\nget in touch."
},
{
    "time": "2023-11-13T17:18:46.000Z",
    "tweet_text": "This is a really sweet documentary - I also became enamored with Ruby/Rails early on, and it absolutely contributed to the success of Coinbase, to be able to create so much with so little.\n\nhttps://youtube.com/watch?v=HDKUEXBF3B4…\n\nGreat model to follow if you get inspired on some new tech idea."
},
{
    "time": "2023-11-13T17:19:55.000Z",
    "tweet_text": "Wanted to give a shout out to http://railscasts.com also btw - this was a real gem early on, while I was learning to be a better programmer.\n\nI probably watched almost all of these while living in Argentina."
},
{
    "time": "2023-11-13T00:48:07.000Z",
    "tweet_text": "San Francisco if Xi stayed longer than three days."
},
{
    "time": "2023-11-11T15:36:38.000Z",
    "tweet_text": "people are coming to their senses",
    "repost_text": "Nick Bostrom is starting to worry that AI fear could prevent upsides of AI in the same way nuclear fear prevented upsides of nuclear power.\n\nThis is a watershed, pivotal moment for the AI risk movement. Bostrom has broken ranks.  x.com/jachaseyoung/s…"
},
{
    "time": "2023-11-10T17:26:06.000Z",
    "tweet_text": "Outrageous!!\n\nMassive misrepresentation by Brad Smith (MSFT) claiming chat-gpt is as open as LLaMa (among other non truths)\n\nIt's sad to see MSFT become the enemy to open source again. They did it during the OS / browser wars. And they're doing it again."
},
{
    "time": "2023-11-10T19:49:24.000Z",
    "tweet_text": "Well said.",
    "repost_text": "Crypto accounts for < 1% of all illicit finance activity and would be even less if we created a regulatory structure to allow the crypto industry to operate in America instead of unregulated foreign markets.\n\nCrypto is not the problem, bad actors that exist in every industry are. x.com/ForbesCrypto/s…"
},
{
    "time": "2023-11-09T20:45:55.000Z",
    "tweet_text": "excited to see @coinbase launch onchain verifications on @BuildOnBase with @eas_eth \n\nusing open source, public good infrastructure to enable the next billion users to come onchain",
    "repost_text": "Introducing Coinbase verifications – Users can attest to account and country credentials onchain, all verified by Coinbase, now live for our 100M+ users at http://coinbase.com/onchain-verify"
},
{
    "time": "2023-11-09T18:36:35.000Z",
    "tweet_text": "Yesterday, a dedicated coalition of Illinois builders and founders met with Congressional offices, to advocate for pro-crypto policies. In the course of these discussions, both Members and staff heard firsthand about the extensive applications, ranging from agriculture to real…"
},
{
    "time": "2023-11-08T21:35:11.000Z",
    "tweet_text": "You Can’t Regulate What You Don’t Understand:\nA great post from @AlexanderGrieve on why crypto policymaking and regulation is structurally challenged because most government (SEC included) employees can't own it, plus some ideas on how to fix it."
},
{
    "time": "2023-11-09T19:46:56.000Z",
    "tweet_text": "Introducing Coinbase verifications – Users can attest to account and country credentials onchain, all verified by Coinbase, now live for our 100M+ users at http://coinbase.com/onchain-verify"
},
{
    "time": "2023-11-07T17:35:43.000Z",
    "tweet_text": "Anytime I worry that we're being too hardcore we're not being hardcore enough.\n\nAnytime I worry that being more hardcore will stress people out it actually energizes everyone."
},
{
    "time": "2023-11-08T17:56:09.000Z",
    "tweet_text": "Elizabeth Warren and WSJ spread misinformation on crypto and got caught red handed\n\nThe moment has passed, but voters won't forget \nhttp://standwithcrypto.org\nhttps://forbes.com/sites/digital-assets/2023/11/08/how-misinformation-on-hamas-and-crypto-fooled-nearly-20-of-congress/?sh=6570f8848270…"
},
{
    "time": "2023-11-08T17:29:46.000Z",
    "tweet_text": "The IRS’s new rules are bad for your privacy. Join the 119K+ Americans who’ve already spoken up to make privacy an issue the IRS can’t ignore.\n\nLast chance to submit a comment → http://standwithcrypto.org/?modal=comment-to-irs…",
    "repost_text": "The IRS wants new rules that would require every crypto transaction to be reported. Imagine needing to provide personal info to purchase:\n\n\n…etc.\n\nBut here’s how you can help prevent this.\nhttp://standwithcrypto.org/?modal=comment-to-irs…"
},
{
    "time": "2023-11-08T17:01:25.000Z",
    "tweet_text": "The SEC filed their opposition to Binance’s motion to dismiss. Once more, the SEC asserts that a virtually unlimited “flexibility of the securities laws” grants it complete authority over crypto exchanges. That misrepresents the law; let’s explore why. 1/7 https://assets.ctfassets.net/c5bd0wqjc7v0/KClZqjmECgXuHx0FPDnND/57e70bdd836a9b8735314dbed63971c3/SEC_Opp-n_to_MTD_-_Binance__172_1-23-cv-01599.pdf…"
},
{
    "time": "2023-11-08T16:04:00.000Z",
    "tweet_text": "Soon the majority of Americans will own crypto. Make sure they can do so. Join the fight \nhttp://standwithcrypto.org"
},
{
    "time": "2023-11-07T18:13:18.000Z",
    "tweet_text": "3iQ recently launched the world’s FIRST-EVER Ethereum staking ETF  The @3iq_corp Ether Staking ETF (TSX: ETHQ, ETHQ.U) is powered by Coinbase Cloud validators and @CoinbaseInsto custody  Read about their industry-leading innovation in our post:"
},
{
    "time": "2023-11-08T01:07:59.000Z",
    "tweet_text": "Compliance innovation coming onchain",
    "repost_text": "Tokenization requires all applications have a KYC /Attestation process. The KYC process today is archaic, like the system it was built on. \n\nBut this is changing. KYC, Digital ID, Attestation status, it’s all coming to the wallet. \n\n Did you know? @BuildOnBase powers @eas_eth…  x.com/yiryan/status/…"
},
{
    "time": "2023-11-07T17:37:58.000Z",
    "tweet_text": "With real national security risks from knee-jerk hostility to crypto, we turn to real national security experts for advice and counsel. @coinbase is grateful for the expertise our entire GAC provides.",
    "repost_text": "Honored to have @MarkTEsper, @MurphyforFL, @FranTownsend, and @DavidJUrban join the @coinbase  Global Advisory Council. We look forward to relying on their insights and wisdom on national security and global affairs as we grow the cryptoeconomy in the US and around the world.…"
},
{
    "time": "2023-11-07T22:45:53.000Z",
    "tweet_text": "Coinbase global advisory council is growing\n\nCrypto has an important role to play in national security",
    "repost_text": "Honored to have @MarkTEsper, @MurphyforFL, @FranTownsend, and @DavidJUrban join the @coinbase  Global Advisory Council. We look forward to relying on their insights and wisdom on national security and global affairs as we grow the cryptoeconomy in the US and around the world.…"
},
{
    "time": "2023-11-02T15:03:30.000Z",
    "tweet_text": "I interviewed Bill Gurley @bgurley and asked him about Biden’s AI executive order and the risk of regulatory capture by the incumbents. He did not disappoint and pulled no punches. https://barrons.com/articles/ai-regulation-openai-microsoft-cd279eeb…"
},
{
    "time": "2023-11-05T17:15:32.000Z",
    "tweet_text": ".@theallinpod was quite good this week describing the end game of Biden's executive order on AI"
},
{
    "time": "2023-11-04T17:12:02.000Z",
    "tweet_text": "Great talk by @joycesticks about @ResearchHub\nhttps://youtu.be/5ysl02t6l30?si=fm0pXoP0xGZT2xhU…\n\nGo sign up today:"
},
{
    "time": "2023-11-03T15:00:02.000Z",
    "tweet_text": "Don't sit this one out. Join the fight \nhttp://standwithcrypto.org"
},
{
    "time": "2023-11-03T19:03:19.000Z",
    "tweet_text": "1/ We’ve submitted a letter to President Biden regarding the AI Executive Order and its potential for restricting open source AI. We believe strongly that open source is the only way to keep software safe and free from monopoly. Please help amplify."
},
{
    "time": "2023-11-02T16:15:11.000Z",
    "tweet_text": "“There is a very strong argument that if the SEC simply did not exist and had been replaced with literally nothing, far less consumers would have been harmed in crypto.”\n\nThought-provoking thread from @CampbellJAustin ",
    "repost_text": "Today, the SEC appears to have continued their ongoing crusade to protect terrorist funding and large bank monopolies at the expense of the American consumer, innocent civilians in warzones, and technology that was created after the year 1940.\n\nI want to be clear that I'm not…"
},
{
    "time": "2023-11-02T20:33:20.000Z",
    "tweet_text": "Love this format",
    "repost_text": "Our Q3’23 update is in.\n\nRead the full shareholder letter and tune in to our earnings call here → http://investor.coinbase.com"
},
{
    "time": "2023-11-01T20:02:36.000Z",
    "tweet_text": "Add your questions here for the live AMA"
},
{
    "time": "2023-11-01T19:44:54.000Z",
    "tweet_text": "Let's do this",
    "repost_text": "AMA with @brian_armstrong on Farcaster less than an hour from now!"
},
{
    "time": "2023-11-01T15:22:40.000Z",
    "tweet_text": "In August, @Coinbase celebrated Onchain Summer \n\nWe're proud to have supported a month of onchain activity, powering:\n\n→ $2.4M generated for creators\n→ 25% of all active wallets\n→ 1M+ total transactions\n\n... and partners like Coca Cola, Atari, & Optimism on @BuildOnBase. "
},
{
    "time": "2023-11-01T18:21:03.000Z",
    "tweet_text": "Amazing movement @balajis has created. This will take decades to play out, but I think he is right, and when it happens we will all look back and say #BalajiWasRight",
    "repost_text": "Building the Network State."
},
{
    "time": "2023-10-31T15:00:02.000Z",
    "tweet_text": ".@coinbase's effort to tap the crypto masses for political advocacy, @standwithcrypto, raised $2 million from 80,000 people (half of that from Coinbase's CEO). More than 100,000 tagged in and sent 16,000 messages to lawmakers. \n\n@jesseahamilton reports"
},
{
    "time": "2023-10-31T16:13:57.000Z",
    "tweet_text": "16K+ calls and emails to Congress.\n100K+ crypto advocate signups.\n$2M+ in pro-crypto donations.\nAll in the first two months.\n\nThe community continues to #StandWithCrypto.\nHere's how you can do the same → http://standwithcrypto.org/call"
},
{
    "time": "2023-10-31T19:43:35.000Z",
    "tweet_text": "The real crypto story isn't how much went to Hamas; it's how much went to Ukrainian humanitarian aid.\n\nCrypto sent to Hamas: $500k\nDonations for Ukrainian humanitarian efforts: $135 million [1]\n\n[1] - https://coindesk.com/consensus-magazine/2023/07/27/ukraine-has-raised-225m-in-crypto-to-fight-russian-invasion-but-donations-have-stagnated-over-the-last-year-crystal/…",
    "repost_text": "An inaccurate report last week claimed Hamas raised nearly $100 million via crypto assets.\n\nIn reality, it was less than $500,000.\n\nThis encapsulated the misconception that crypto is a tool for illicit finance when it accounts for less than 1% of global illicit finance activity."
},
{
    "time": "2023-10-31T22:54:49.000Z",
    "tweet_text": "Great leadership in the UK from @hmtreasury",
    "repost_text": "Today @hmtreasury set out its approach to the UK’s future regulatory framework for crypto assets - and it was worth the wait. \nhttps://gov.uk/government/consultations/future-financial-services-regulatory-regime-for-cryptoassets…"
},
{
    "time": "2023-10-31T22:36:57.000Z",
    "tweet_text": "Epic",
    "repost_text": "I am excited to announce Antares!\n\n@jordanbramble and I started Antares with a shared vision of abundant clean energy for all, from Earth to the asteroid belt.\n\nWe're building micro-sized nuclear reactors to provide power to remote off-grid locations.\n\nhttps://antaresindustries.com"
},
{
    "time": "2023-10-31T20:34:16.000Z",
    "tweet_text": "Coinbase is the best place to get an education on crypto and become crypto native.",
    "repost_text": "every new @coinbase engineer now goes through a full onchain curriculum and hackathon (all on base). \n\nthe first class of 30 just demo'd:\n\nonchain coupons\nonchain pomodoro\nonchain fantasy sports\nonchain tickets\nonchain carbon credits\n\nwe're bringing the world onchain."
},
{
    "time": "2023-10-31T01:13:33.000Z",
    "tweet_text": "If this scapegoating didn't detract from real issues with terror finance that need real solutions, it would be comical. How much USD issued by the USG did Hamas move over this same period?",
    "repost_text": "liz warren's expectation: hardened terrorists raised $130m+ in crypto to fund their operations \n\nreality of terrorist financing with blockchains:"
},
{
    "time": "2023-10-31T17:42:42.000Z",
    "tweet_text": "Agreed - the government should not be regulating AI, and these arbitrary limits are a bad idea. Important to note an executive order is not a law passed by Congress, and is subject to judicial review.",
    "repost_text": "I think we will ultimately regret that we did this to ourselves."
},
{
    "time": "2023-10-30T14:41:12.000Z",
    "tweet_text": "The long awaited conclusory statement from UK HMT on its crypto asset regulatory regime has arrived. And it is wonderful. \n\nhttps://gov.uk/government/consultations/future-financial-services-regulatory-regime-for-cryptoassets…\n\nEST @griffitha could not have been more decisive in declaring the government's interest in embracing blockchain and crypto…"
},
{
    "time": "2023-10-30T13:16:44.000Z",
    "tweet_text": "The AI EO reads *exactly* like how government has treated crypto for years.\n\nOne vague sentence about how AI might be good for something some day, and then a dramatic list of risks and dangers that justify regulating the whole thing to death.\n\nWhy are we so afraid of technology?"
},
{
    "time": "2023-10-30T20:24:42.000Z",
    "tweet_text": "Announcing: BlueSea Frontier Compute Cluster\n\nThe Biden admin's AI Executive Order and the EU’s AI Act aim to centralize control under guise of safety\n\nThe solution is at sea.\n\nBSFCC's are not just barge based compute platforms, but sovereign nation states\nhttps://delcomplex.com/blue-sea-frontier…"
},
{
    "time": "2023-10-27T14:01:06.000Z",
    "tweet_text": "I want you to close your eyes and imagine with me. Metaphorically, of course. We don’t have the technology to read with our eyes closed… yet.\n\nOK, ready?\n\nThe year is 2073. It’s a cool spring day, light breeze, 73 degrees. The world hasn’t ended. In fact, it’s better than ever.…"
},
{
    "time": "2023-10-27T15:03:18.000Z",
    "tweet_text": "top artist on @basepaint_xyz has earned 9 ETH so far\n\nbasepaint is incredible\n\nty @rob_0x for creating this dashboard"
},
{
    "time": "2023-10-27T22:20:21.000Z",
    "tweet_text": "1/ This is barely a correction. When your source maintains “there is no evidence” to support the @WSJ  assertions, saying \"the PIJ may have used crypto” isn’t just inaccurate, it's unacceptable."
},
{
    "time": "2023-10-27T18:14:20.000Z",
    "tweet_text": "Demand a correction from @WSJ! @elliptic states There is NO evidence to support the assertion that Hamas has received significant volumes of crypto donations. @chainalysis also challenges WSJ metrics. Email wsjcontact@wsj.com Speak up!  ",
    "repost_text": "Setting the record straight on crypto crowdfunding by Hamas \nhttps://elliptic.co/blog/setting-the-record-straight-on-crypto-crowdfunding-by-hamas…"
},
{
    "time": "2023-10-27T19:28:32.000Z",
    "tweet_text": "The LBRY settlement is a picture-perfect example of how not to regulate, and should be considered a national scandal.\n\nWith @HesterPeirce's statement today, I feel that I should finally weigh in on this one, to make clear just how wildly egregious the conduct of the SEC was in…"
},
{
    "time": "2023-10-27T02:52:51.000Z",
    "tweet_text": "It saddens me that my ex-employer @WSJ, which I hold in the highest esteem, and that former colleagues I similarly, fondly respect, have, frankly, botched this.\n\nIt's not just that the original was wrong. That's the easy bit. It's the refusal to correct.\n\nGuys. Do the right thing",
    "repost_text": "The @WSJ published a misleading article about crypto being used by Hamas. Its claims about $ are provably false.\n\nThis is exactly what blockchains are good for - provable, verifiable, public ledgers that anyone can use.\n\nI asked @WSJ to meet its own stds:\nhttps://tinyurl.com/yckrsxjb"
},
{
    "time": "2023-10-27T12:11:16.000Z",
    "tweet_text": "Sensible leaders within the Administration are themselves rejecting the bogus premise that crypto and terror finance are one and the same. Why won’t the @WSJ and the politicians who rely on its suggestions to the contrary do the same?",
    "repost_text": "U.S. TREASURY DEPUTY SECRETARY ADEYEMO: USE OF CRYPTOCURRENCY IS NOT THE VAST MAJORITY OF THE WAY TERROR GROUPS ARE FUNDED - RTRS"
},
{
    "time": "2023-10-27T14:24:08.000Z",
    "tweet_text": "As @dhh said so well: complexity is a temporary bridge towards discovering simpler solutions. It's necissary for innovation, but needs to be removed once the picture is clear. \n\nI'm thrilled that our industry is starting to celebrate this type of work again!",
    "repost_text": "This has been a year full of engineering excellence that sometimes can go unnoticed. Besides all the visible changes you see on our app, here are some of the most important improvements we have made under the hood.\n\n- Consolidated the tech stacks for For you, Following, Search,…"
},
{
    "time": "2023-10-25T19:41:31.000Z",
    "tweet_text": "We’ve been working hard to improve the cost and time to confirm payments in @CoinbaseWallet - check out this demo.\n\nOur ambitious goal is to get the average transaction under 1 second 1 second end-to-end. Instant, cheap, and global.\n\nWill require layer 2 becoming the default,…",
    "repost_text": "Don't blink.\n\nCoinbase Wallet now supports real-time balance updates and near-instant end-to-end payments on L2 networks like @arbitrum and @BuildOnBase."
},
{
    "time": "2023-10-26T23:28:59.000Z",
    "tweet_text": "Whoops - meant to say \"1 second and 1 cent\""
},
{
    "time": "2023-10-25T19:26:49.000Z",
    "tweet_text": "Refutation could not be stronger.\n\nWill WSJ’s @AABerwick and @IanTalley correct the record?\n\n“There is no evidence to support the assertion that Hamas has received significant volumes of crypto donations.”"
},
{
    "time": "2023-10-25T19:54:26.000Z",
    "tweet_text": "Oral argument on our motion for judgment has been set:  January 17.  We appreciate the Court's swift attention to this matter and look forward to answering the Court's questions."
},
{
    "time": "2023-10-25T21:28:03.000Z",
    "tweet_text": "In the fog of war, journalistic mistakes happen. But the @WSJ's own source just rejected its reporting on illicit financing that alarmed dozens of members of Congress. It’s time for the WSJ to come clean and issue a retraction. 1/3",
    "repost_text": "Setting the record straight on crypto crowdfunding by Hamas \nhttps://elliptic.co/blog/setting-the-record-straight-on-crypto-crowdfunding-by-hamas…"
},
{
    "time": "2023-10-25T17:33:26.000Z",
    "tweet_text": "The IRS wants new rules that would require every crypto transaction to be reported. Imagine needing to provide personal info to purchase:\n\n\n…etc.\n\nBut here’s how you can help prevent this."
},
{
    "time": "2023-10-26T00:00:18.000Z",
    "tweet_text": "This is crazy - an inaccurate WSJ article (citing evidence from Elliptic) caused 20% of congress to sign a letter. Elliptic has now refuted the evidence in the WSJ article.\n\n@WSJ will you issue a retraction/correction?",
    "repost_text": "Elliptic corrects the record. Your move, @wsj\nhttps://elliptic.co/blog/setting-the-record-straight-on-crypto-crowdfunding-by-hamas…"
},
{
    "time": "2023-10-25T04:04:32.000Z",
    "tweet_text": "We love our partnership with the @NBA. Cc: @coinbase"
},
{
    "time": "2023-10-24T14:35:43.000Z",
    "tweet_text": "CALL TO ACTION!\n\nWe need to stop the U.S. from killing crypto \n\nThe new IRS proposals could effectively destroy DeFi & other crypto use cases\n\nThe good news? We can change this \n\n5 minutes is all it takes to leave a comment & delay the interpretation\n\nInstructions below"
},
{
    "time": "2023-10-25T04:13:00.000Z",
    "tweet_text": "Fred is an incredible builder, techno optimist, and friend. We're lucky to have him on team crypto and team human.\n\nHe went 2 for 2 on founding billion dollar companies (let that sink in). Still hungry and working hard every day.",
    "repost_text": "Update: My role at Paradigm will be shifting from Managing Partner to General Partner. I’ll continue to work with our investing & research teams, work with portfolio companies, and fight for good crypto policy, while focusing less on the day to day management of the firm. I look…"
},
{
    "time": "2023-10-25T03:37:13.000Z",
    "tweet_text": "Memory lane"
},
{
    "time": "2023-10-24T23:23:32.000Z",
    "tweet_text": "Well said",
    "repost_text": "My notes from Buffett: The Making of an American Capitalist turned into maxims:\n\n1. Genius lies in ignoring the unimportant. \n\n2. Intensity is the price of excellence. \n\n3. If you’re not working on your best idea you’re doing it wrong. \n\n4. Writing a check separates conviction…"
},
{
    "time": "2023-10-24T23:18:14.000Z",
    "tweet_text": "Let's do it live",
    "repost_text": "We're continuing the Farcaster AMA series next week with the one and only @brian_armstrong.\n\nDetails\n- November 1 at 1pm Pacific\n- f/founders channel on Farcaster"
},
{
    "time": "2023-10-24T20:30:26.000Z",
    "tweet_text": "The @SECGov's opp. to our motion for judgment claims roving authority over all investments, with “security” and “contract” in the statutes performing no limiting function at all. As our reply shows, that's never been the law, and it's not the law now. 1/3 https://assets.ctfassets.net/c5bd0wqjc7v0/37TO37eaSL7knzM0AuFpF2/5d592e310542199df79843d815ab0716/SEC_v._Coinbase__Coinbase_Reply_Memorandum_of_Law_in_Support_of_Motion_for_Judgment_on_the_Pleadings__As-Filed_.pdf…"
},
{
    "time": "2023-10-23T18:03:27.000Z",
    "tweet_text": "This is why healthspan is just as important as lifespan",
    "repost_text": "She absolutely nailed it "
},
{
    "time": "2023-10-23T13:52:40.000Z",
    "tweet_text": "Is today the day that the @WSJ admits they overstated  the bitcoin terrorist financing figures by ~200x and committed journalistic malpractice? Let’s find out"
},
{
    "time": "2023-10-22T21:01:03.000Z",
    "tweet_text": "X combatting misinformation in MSM",
    "repost_text": "Last week, the @WSJ published an article claiming about $90 million worth of crypto was used to fund Hamas — a serious claim that gained significant attention. \n\nIn response to the article, anti-Bitcoin politicians directly linked the WSJ article as evidence in a letter to the…"
},
{
    "time": "2023-10-22T18:16:26.000Z",
    "tweet_text": "Yes— wrong is wrong. This reported misinformation furthers agendas that demean real human tragedy and genuine and effective efforts to thwart those who are responsible.",
    "repost_text": "Last week, the @WSJ published an article claiming about $90 million worth of crypto was used to fund Hamas — a serious claim that gained significant attention. \n\nIn response to the article, anti-Bitcoin politicians directly linked the WSJ article as evidence in a letter to the…"
},
{
    "time": "2023-10-22T00:36:46.000Z",
    "tweet_text": "Deceleration from over-regulation *is* the great filter"
},
{
    "time": "2023-10-21T13:26:10.000Z",
    "tweet_text": "In 1998 Bill Gates argued to end the ban on encryption.\n\nThe rationale? The ban was “sending business to overseas firms.”\n\nIn 2023 @brian_armstrong is making the same argument, history rhymes."
},
{
    "time": "2023-10-21T16:29:36.000Z",
    "tweet_text": "Been trying to tell y’all…\n\nHe who controls the spice (chips) controls the 21st century."
},
{
    "time": "2023-10-20T23:04:55.000Z",
    "tweet_text": "",
    "repost_text": "Builders build.\nAnd they'll be the ones who usher in the next phase of crypto utility.\n\nRevisit the first-ever @cbventures summit."
},
{
    "time": "2023-10-20T04:15:31.000Z",
    "tweet_text": "Market may be down, but the vibes are up! Inspiring energy from our first-ever @cbventures summit",
    "repost_text": "Attended our first @cbventures summit yesterday in Malibu, CA. Was great meeting so many awesome crypto builders in this down market. From flat coins, to p2p onramps, to onchain reputation - the future is bright."
},
{
    "time": "2023-10-20T04:02:01.000Z",
    "tweet_text": "One of the highest quality events I've ever been to. Highly recommend founders applying to a future @cbventures summit",
    "repost_text": "Attended our first @cbventures summit yesterday in Malibu, CA. Was great meeting so many awesome crypto builders in this down market. From flat coins, to p2p onramps, to onchain reputation - the future is bright."
},
{
    "time": "2023-10-20T03:50:12.000Z",
    "tweet_text": "Attended our first @cbventures summit yesterday in Malibu, CA. Was great meeting so many awesome crypto builders in this down market. From flat coins, to p2p onramps, to onchain reputation - the future is bright."
},
{
    "time": "2023-10-19T15:24:25.000Z",
    "tweet_text": "Elizabeth Warren is trying to kill crypto in the U.S.\n\nIt's aggressive. It's coordinated.\n\nI was about to record the rollup with @TrustlessState this week and what do i see?\n\nA letter from Elizabeth Warren asking the IRS to speed up its already hasty af implementation of new tax…"
},
{
    "time": "2023-10-19T11:20:08.000Z",
    "tweet_text": "The world is not waiting on the US for regulatory clarity. And neither are we.",
    "repost_text": "Delighted to serve nearly half a billion people under one regulatory framework. \n\nhttps://coinbase.com/blog/announcing-ireland-as-our-eu-mica-entity-location…"
},
{
    "time": "2023-10-19T11:18:38.000Z",
    "tweet_text": "Delighted to serve nearly half a billion people under one regulatory framework."
},
{
    "time": "2023-10-19T22:24:17.000Z",
    "tweet_text": "",
    "repost_text": "Coinbase International Exchange Perpetual Futures Market data, public and live https://international.coinbase.com"
},
{
    "time": "2023-10-19T16:23:59.000Z",
    "tweet_text": "Coinbase International Exchange Perpetual Futures Market data, public and live https://international.coinbase.com"
},
{
    "time": "2023-10-18T20:52:24.000Z",
    "tweet_text": "Everyone should join @standwithcrypto's opposition to this proposed tax rules from US Dept of Treasury.\n\nThe proposals are *terrible* for privacy. \n\nThe rules as would require reporting to the IRS every personal expenditure ranging from a cup of coffee to health care cost info",
    "repost_text": "Everyone who cares about fairness and supports American innovation should chime in on Treasury's proposed regulations for tax reporting of digital assets. You can join @StandwithCrypto’s opposition to the rulemaking here. 1/4 https://docs.google.com/forms/d/e/1FAIpQLSd-AacdRd7bJMyNAmQMsB-j2YHQzj5M9zyOmVynh_yUKInnqw/viewform…"
},
{
    "time": "2023-10-19T06:16:24.000Z",
    "tweet_text": "Major milestone",
    "repost_text": "Let’s go. Perpetual futures are now available on Coinbase Advanced. \n\nLearn more at http://coinbase.com/perpetuals"
},
{
    "time": "2023-10-18T17:26:33.000Z",
    "tweet_text": "Everyone who cares about fairness and supports American innovation should chime in on Treasury's proposed regulations for tax reporting of digital assets. You can join @StandwithCrypto’s opposition to the rulemaking here. 1/4"
},
{
    "time": "2023-10-18T14:02:15.000Z",
    "tweet_text": "The treasury department has sanctioned a Hamas-linked wallet as Politico reports that \"Crypto’s role in financing Hamas’ activity has emerged as a hot issue for lawmakers\"\n\nThe sanctioned wallet has $16 in it and made its last transfer 18 months ago"
},
{
    "time": "2023-10-18T10:45:40.000Z",
    "tweet_text": "It’s disappointing that some would capitalize on a tragedy to scapegoat crypto while ignoring significant terror finance elsewhere. But no currency—whether fiat, gold, or crypto—should ever be used to support terrorism. Here’s how we fight it at @coinbase."
},
{
    "time": "2023-10-19T01:28:38.000Z",
    "tweet_text": "",
    "repost_text": "Information markets are more reliable than the New York Times"
},
{
    "time": "2023-10-17T17:16:37.000Z",
    "tweet_text": "I really do think this is the greatest gaslighting tweet that has ever been written, and quite possibly better than anything that COULD be written.  Inflation is quite tame if you remove everything people need to actually survive.",
    "repost_text": "The war on inflation is over. We won, at very little cost"
},
{
    "time": "2023-10-17T12:58:15.000Z",
    "tweet_text": "AB39 is now the law in California. I wanna share a few thoughts from @coinbase on this new licensing and regulatory framework for digital financial asset business activity. 1/3"
},
{
    "time": "2023-10-16T22:56:05.000Z",
    "tweet_text": "Excited for our first @cbventures Summit this week. We received 600+ applications and selected ~25 for our first cohort based on the ideas in the video below.\n\nHopefully we can help them (in some small way) bring the next generation of crypto companies to life.",
    "repost_text": "1/ I'm sharing the 10 ideas I'm most excited about in crypto right now. If you're building something in crypto or thinking about doing so - check it out.\n\nWe’re building lots at Coinbase, but we don't have time to tackle everything. So I figured I'd share these. Bear markets are…"
},
{
    "time": "2023-10-16T17:23:08.000Z",
    "tweet_text": "This is the path toward progress.\n\nDecel narratives are all around us in popular culture and in meetings amongst elites. Thank you @a16z for a breath of fresh air.",
    "repost_text": "The Techno-Optimist Manifesto -- please read and Ask Me Anything! Post questions as replies to this xeet. https://a16z.com/the-techno-optimist-manifesto/…"
},
{
    "time": "2023-10-16T03:37:56.000Z",
    "tweet_text": "I never heard this explicitly mentioned at @ycombinator but it was apparent, and I somehow internalized it and appreciated it, to the point where we actually made it one of our values at @Coinbase\nhttps://coinbase.com/blog/culture-at-coinbase-2021…"
},
{
    "time": "2023-10-16T16:36:28.000Z",
    "tweet_text": "I used this to practice for my YC interview, which does a great job reinforcing the idea of conciseness\n\nhttps://jamescun.github.io/iPG/"
},
{
    "time": "2023-10-16T03:53:31.000Z",
    "tweet_text": "Good luck to everyone who applied! If you missed it, keep making progress and apply next time.",
    "repost_text": "At YC, we work with founders throughout the life of their startup and beyond, to build the world-changing companies of the future.\n\nAnd we'd love to work with you.\n\nThe deadline to apply for YC W24 is this Friday, Oct 13 at 8pm PDT — apply today at http://ycombinator.com/apply."
},
{
    "time": "2023-10-15T22:50:04.000Z",
    "tweet_text": "Come to the Network State Conference in Amsterdam on Oct 30.\n\nOur speakers include Greenwald, Vitalik, Anatoly, Garry Tan, the Winklevosses, Tyler Cowen, and founders of startup societies from around the world.\n\nThis won't be a typical tech conference."
},
{
    "time": "2023-10-14T15:36:43.000Z",
    "tweet_text": "Yes - or antitrust action",
    "repost_text": "It’s like we need an alternative app store or something. I feel like it’s going to take an act of Congress to force side loading apps on all “operating systems”. x.com/WatcherGuru/st…"
},
{
    "time": "2023-10-14T00:43:07.000Z",
    "tweet_text": "Facts should drive narratives. Narratives shouldn’t drive facts.",
    "repost_text": "hamas stopped accepting bitcoin because global law enforcement and exchange compliance depts have become capable to the point where it’s too risky for their donors https://reuters.com/world/middle-east/hamas-armed-wing-announces-suspension-bitcoin-fundraising-2023-04-28/…"
},
{
    "time": "2023-10-14T15:26:41.000Z",
    "tweet_text": "",
    "repost_text": "We’ve filed our response with the Third Circuit. Tl;dr: the SEC’s unilluminating “update” is mere bureaucratic pantomime and confirms that nothing short of mandamus will prompt the agency to take its obligations seriously. 1/3 https://assets.ctfassets.net/c5bd0wqjc7v0/3F1NqpX4RHmAW666ErJV4K/8d0b1bb32ee4ad11e6cb5e154176bf95/2023.10.13_-_Dkt._34-2_-_Coinbase_Proposed_Response.pdf…"
},
{
    "time": "2023-10-11T19:00:01.000Z",
    "tweet_text": "Calling all Arbinauts, check out the @arbitrum features that launched this month:\n\nDEX trading with zero Coinbase fees, bridging between Ethereum and Arbitrum, and gas-free sends.\n\n→ http://coinbase.com/wallet"
},
{
    "time": "2023-10-11T20:38:09.000Z",
    "tweet_text": "Today the SEC provided its court-ordered update to the Third Circuit in Coinbase’s mandamus action: yesterday the SEC staff made some kind of recommendation to the Commission related to our rulemaking petition. That’s it. That’s the whole update. 1/3"
},
{
    "time": "2023-09-27T18:49:28.000Z",
    "tweet_text": "California, Congress will be writing the rules on crypto soon. And calling your congressperson is the best way to have a say. \n\nHere’s how to do it in under 60 seconds → http://standwithcrypto.org/call"
},
{
    "time": "2023-09-27T18:49:28.000Z",
    "tweet_text": "Nevada, Congress will be writing the rules on crypto soon. And calling your congressperson is the best way to have a say. \n\nHere’s how to do it in under 60 seconds → http://standwithcrypto.org/call"
},
{
    "time": "2023-10-11T04:04:54.000Z",
    "tweet_text": "At @coinbase we don’t care if crypto is in a winter, or if people are pivoting to some new hot thing, we just keep showing up every day to build.\n\nProgress toward important missions takes decades, and will have lots of ups and downs along the way. Persistence and determination…"
},
{
    "time": "2023-10-09T13:58:39.000Z",
    "tweet_text": "L2 transactions accounted for 61% of all Ethereum transactions in Q3.\n\nThe growth came largely from Base’s explosive launch and the virality of @friendtech. Over a brief period near the end of the quarter, Base alone was doing more transactions than Ethereum Mainnet.\n\nOptimism…"
},
{
    "time": "2023-10-10T02:38:21.000Z",
    "tweet_text": "Here's how our Eng team is using AI to detect ERC-20 scam tokens. It's only the beginning."
},
{
    "time": "2023-09-27T18:49:28.000Z",
    "tweet_text": "California, Congress will be writing the rules on crypto soon. And calling your congressperson is the best way to have a say. \n\nHere’s how to do it in under 60 seconds → http://standwithcrypto.org/call"
},
{
    "time": "2023-10-08T14:20:46.000Z",
    "tweet_text": "Open source more of AI! It’s the best tool to prevent unintended harm from government action.",
    "repost_text": "We have to fight for open source AI right now. Many many governments seem to be pretty far along the process of causing damage to their economies out of pure ignorance and for no benefit whatsoever. x.com/garrytan/statu…"
},
{
    "time": "2023-10-05T15:26:05.000Z",
    "tweet_text": "Great catching up and excited to grow the $USDC ecosystem together!",
    "repost_text": "Last night had an opportunity up celebrate the next phase of our $USDC partnership with @brian_armstrong and the @coinbase and @circle teams. Grateful for the partnership and the next chapter!"
},
{
    "time": "2023-10-05T00:36:17.000Z",
    "tweet_text": "The national debt problem is very quickly getting much worse. We saw an increase of $275 billion added to the debt in a single day and as it was pointed out online, the US is on track to add $1 trillion to the national debt in a single month.\n\nThis is bonkers.\n\nThe United States…"
},
{
    "time": "2023-10-04T00:52:47.000Z",
    "tweet_text": "",
    "repost_text": "The @SECgov just filed its opposition to our motion to dismiss their case against @Coinbase. It’s more of the same old same old. But don’t just  take my word for it – take a look for yourself. 1/7 https://assets.ctfassets.net/c5bd0wqjc7v0/3QSVqyduF6wiIve834zI8t/7dcb196fb5e21cf41682fd56d10fed74/SEC_Opposition_Brief__10.3.23_.pdf…"
},
{
    "time": "2023-10-03T02:42:37.000Z",
    "tweet_text": "Federal judges take jury selection quite seriously. I'm sure that tomorrow am, Judge Kaplan will be no exception as he begins trial in the case against SBF. As someone who picked 35ish juries in federal court, I have a few thoughts on what to expect. "
},
{
    "time": "2023-10-02T23:53:28.000Z",
    "tweet_text": "I wonder if Google would ever make a high end Chromebook to challenge Apple\n\nIt would be nice to have a simpler desktop OS, but the hardware is all going after low end of market."
},
{
    "time": "2023-10-02T04:34:02.000Z",
    "tweet_text": "Major Payment Institution (MPI) licence from the Monetary Authority of Singapore:  secured.  Thank you MAS."
},
{
    "time": "2023-09-30T20:27:50.000Z",
    "tweet_text": "It is in America’s national interest to foster the domestic development of cryptocurrencies, web3, and blockchain, because these technologies will form the foundations of a new international monetary and financial order that the USA should have a say in."
},
{
    "time": "2023-10-01T04:08:47.000Z",
    "tweet_text": "We should make this a reality.\n\nEconomic freedom and an updated financial system is one major component of it."
},
{
    "time": "2023-09-30T19:34:55.000Z",
    "tweet_text": "Great chat about @researchhub for SciCon\nhttps://youtube.com/watch?v=XQFGuzsUvHo…\n\nResearchHub is a modern day pre-print server, and open science platform working to accelerate science - early days."
},
{
    "time": "2023-09-29T19:14:28.000Z",
    "tweet_text": "1/ Amazing few days in DC. @standwithcrypto and @coinbase brought together more than 50 Web3 entrepreneurs and innovators from around the country to meet with Members of Congress. The result was simply incredible."
},
{
    "time": "2023-09-28T20:25:23.000Z",
    "tweet_text": "XB-1 more than 100mph down the runway yesterday! Was awesome to be here in Mojave with the @boomaero team and see it happen live",
    "repost_text": "At the Mojave Air & Space Port, preparations continue for the first flight of XB-1, our technology demonstrator aircraft. Yesterday, XB-1 reached speeds up to 89 knots (102 mph) during medium speed taxi testing. Stay tuned for updates as XB-1 proceeds through ground testing and…"
},
{
    "time": "2023-09-29T17:01:15.000Z",
    "tweet_text": "Speaking to our class of APMs at @coinbase today, and this is still true (wrote it back in 2016)"
},
{
    "time": "2023-09-29T03:20:04.000Z",
    "tweet_text": "Coinbase shipping BitMEX-but-legal is underrated. \n\nEx-US crypto derivatives trading volumes have been orders of magnitude greater than spot. \n\nPerp swaps have the best product market fit in crypto after Bitcoin and Etheruem.\n\nA decade in the making. Kudos to the team.",
    "repost_text": "Safe and compliant Perpetual Futures for eligible traders \n\nPerps play a critical role in crypto markets, but traders have historically taken on significant platform risk to access them\n\nExcited to enable perps from the most trusted platform in crypto!\n\nhttps://coinbase.com/blog/coinbase-receives-regulatory-approval-to-enable-retail-perpetual-futures…"
},
{
    "time": "2023-09-28T13:38:44.000Z",
    "tweet_text": "Great day in DC pushing for crypto regulation.  Thanks to @brian_armstrong for setting up #StandWithCrypto !!! Crypto should be and will be a bi-partisan issue.  We need to flip a minority of influential dems but we will get something done in time."
},
{
    "time": "2023-09-28T13:43:30.000Z",
    "tweet_text": "The expansion continues…\n\nThrilled to announce that Coinbase International Exchange has secured regulatory approval from the Bermuda Monetary Authority (BMA) to enable perpetual futures for non-US retail customers."
},
{
    "time": "2023-09-29T01:23:33.000Z",
    "tweet_text": "Huge",
    "repost_text": "Safe and compliant Perpetual Futures for eligible traders \n\nPerps play a critical role in crypto markets, but traders have historically taken on significant platform risk to access them\n\nExcited to enable perps from the most trusted platform in crypto!\n\nhttps://coinbase.com/blog/coinbase-receives-regulatory-approval-to-enable-retail-perpetual-futures…"
},
{
    "time": "2023-09-28T22:34:53.000Z",
    "tweet_text": "Enjoyed this conversation with @jesslivingston and Carolynn Levy (who both helped me enormously at @ycombinator) about the founding of @coinbase \n\nCheck out their podcast.",
    "repost_text": "The striking thing about talking to Brian Armstrong was how open he was. After taking to him, I feel like I understand where Coinbase came from and where it’s going.\n\nHear for yourself in the latest episode of The Social Radars:\n\nhttps://pod.link/1677066062/episode/56a6a2a137bd0d7412e9f87f5ac0085a…"
},
{
    "time": "2023-09-28T14:06:25.000Z",
    "tweet_text": "In congress, crypto is not partisan, it’s more generational."
},
{
    "time": "2023-09-28T11:53:28.000Z",
    "tweet_text": " Was great to have so many members of congress meeting crypto entrepreneurs from their own districts, creating jobs and innovating in America. It put a face to the name, and reset their view of what the industry is. Can’t let a few bad apples (both in our industry and in our…"
},
{
    "time": "2023-09-27T13:40:01.000Z",
    "tweet_text": "Live at the @coinbase money truck in DC - the future of money doesn’t move on a truck \n“Is there a @Ledger in the back?” - @twobitidiot <— who then pulls out a ledger.  \nCold Brew cans with crypto stats being served.\nRolling deep to @GaryGensler hearing. \n#StandWithCrypto"
},
{
    "time": "2023-09-27T14:52:21.000Z",
    "tweet_text": "Coinbase handing out cold brew on Cap Hill"
},
{
    "time": "2023-09-27T16:28:54.000Z",
    "tweet_text": "FACT: @GaryGensler is NOT an impartial regulator and his answers to my questions today prove just that.\n\nHe's made a career of being relentlessly loyal to the largest institutions in America at the clear expense of innovation, competition, and everyday Americans."
},
{
    "time": "2023-09-28T02:15:59.000Z",
    "tweet_text": "OWOCKI TELL ME ABOUT YOUR TRIP TO DC \n\nsure anon, i'd be delighted to share my #standwithcrypto day debrief.\n\ni was one of ~40 founders invited to @coinbase @standwithcrypto day in washington DC.  it was my first time being in DC, and i identify as a software engineer,…"
},
{
    "time": "2023-09-27T15:13:38.000Z",
    "tweet_text": " http://standwithcrypto.org"
},
{
    "time": "2023-09-28T02:46:50.000Z",
    "tweet_text": "Thanks @brian_armstrong \n\nSo glad we have you and Coinbase standing with DeFi and fighting for the whole industry",
    "repost_text": ".@brian_armstrong: “Hayden Adams of @Uniswap is an American hero. And I mean, that literally he is the kind of person that any country in the world would kill to have building the future of technology -and Elizabeth Warren called him a ‘shadowy super coder.’ He actually put that…"
},
{
    "time": "2023-09-28T03:21:36.000Z",
    "tweet_text": "",
    "repost_text": "I cross-examined @SECGov Chair Gary Gensler about the term 'investment contract', which is key to determining his authority over crypto. \n\nGensler struggled to answer basic questions like whether an investment contract requires a contract. His evasions are deafening and damning."
},
{
    "time": "2023-09-28T01:54:22.000Z",
    "tweet_text": "I found the money truck today in DC.\n\nIt’s time to let congress know we need to update the system.\n\nCall: http://standwithcrypto.org/call"
},
{
    "time": "2023-09-27T21:46:12.000Z",
    "tweet_text": "",
    "repost_text": " @SECGov Chair @GaryGensler continues his blatant disregard for Congress in pursuit of a radical agenda that threatens the integrity of our financial markets, protection of investors, & our economic competitiveness. Our patience is wearing thin.\n\n #WATCH my opening remarks "
},
{
    "time": "2023-09-27T20:29:34.000Z",
    "tweet_text": "Calling it now, @garrytan will be San Francisco mayor.\n\nIt will be a tough but much needed turn around job.\n\n(hopefully only after he is done with his very important work at @ycombinator !)"
},
{
    "time": "2023-09-27T16:43:37.000Z",
    "tweet_text": "Here at our nations capital for #StandWithCrypto day with 40 crypto founders from across the country.\n\nIt’s time for America to join the rest of the G20 and get some clear rules on the books."
},
{
    "time": "2023-09-27T16:44:08.000Z",
    "tweet_text": "Great meeting with @SpeakerPelosi"
},
{
    "time": "2023-09-26T22:09:48.000Z",
    "tweet_text": "52 million Americans own crypto, which should be front-page news.\n\nBut in the meantime, it’s back-page and quarter-page news in the @washingtonpost, today and tomorrow. #StandWithCrypto"
},
{
    "time": "2023-09-26T22:13:27.000Z",
    "tweet_text": "Really hoping there is more to this story than meets the eye, and that this does not reflect Chase UK's actual view."
},
{
    "time": "2023-09-26T21:51:18.000Z",
    "tweet_text": "It's 2023. Money should not move at the speed of this truck!",
    "repost_text": "BEEP.\nMoney is slow. Too slow.\nWhere is the Money Truck going? Nowhere fast, but you’ll see tomorrow…"
},
{
    "time": "2023-09-25T21:46:36.000Z",
    "tweet_text": "If you live in the UK, try Coinbase Advanced for zero fees \nhttps://coinbase.com/advanced-trade",
    "repost_text": " Calling all UK traders: pay zero trading fees on Coinbase Advanced until October 7th, 2023. \n 237 USDC trading pairs to access USD markets \n Earn up to 5% USDC rewards on your balance\n Seamless GBP deposits & withdrawals \n\nStart trading today."
},
{
    "time": "2023-09-25T18:40:45.000Z",
    "tweet_text": "The layer 2 revolution is already happening in crypto\nNot widely discussed, and just getting started\n\nScalability will be a big deal, unlocking utility, payments, next wave of growth",
    "repost_text": "contrarian take: onchain activity isn't down, it's actually way up!\n\nit's just aggressively moved to L2 over the last year, where each transaction consumes orders of magnitude less L1 gas.\n\ndon't be deceived by L1 gas metrics."
},
{
    "time": "2023-09-25T17:00:37.000Z",
    "tweet_text": "Well said. Was a missed opportunity to lead.",
    "repost_text": "Serious Question: What Will Be the Legacy of SEC Chair Gensler?\n\nWe are only now grasping the consequences. \n\n1) **Death of Chevron Doctrine**: Under Chair Gensler's watch, the SEC's waning court victories have diluted the deference usually afforded to the agency's…"
},
{
    "time": "2023-09-25T16:55:25.000Z",
    "tweet_text": "Coinbase is proud to engage with Celsius to distribute crypto back to its customers. I wonder, why would the SEC object to a trusted US public company taking on this role?  We look forward to addressing this with the bankruptcy court and undertaking our important role to make…",
    "repost_text": "SEC Raises Concerns On Coinbase's Role In Celsius Network Bankruptcy Restructuring \n\nThe Securities and Exchange Commission filed papers raising objections to crypto firm Celsius Network's plan to distribute digital assets to customers as part of a reorganization plan through…"
},
{
    "time": "2023-09-22T19:59:32.000Z",
    "tweet_text": "One week remaining to submit a video to our Stand with Crypto @nounsprophouse round\n\nCreate a minute-long story about why you believe an onchain future is important\n\n5 ETH for the top 5 proposals. Let's go "
},
{
    "time": "2023-09-25T04:32:47.000Z",
    "tweet_text": "Bullish https://x.com/twobitidiot/st/twobitidiot/status/1702284342653755743…"
},
{
    "time": "2023-09-23T21:35:15.000Z",
    "tweet_text": "Thoroughly inspired by the business side of the @elonmusk biography.\n\nMost overused and inaccurately applied word in the book: Reckless.\n\nI find most of his business decisions snugly wrapped in *practicality*. Much of the stuff that’s branded risky actually feels like risk…"
},
{
    "time": "2023-09-22T19:11:38.000Z",
    "tweet_text": "mission: improve crypto ux\nmission: improve crypto ux\nmission: improve crypto ux\nmission: improve crypto ux\nmission: improve crypto ux\nmission: improve crypto ux\nmission: improve crypto ux\nmission: improve crypto ux\nmission: improve crypto ux\nmission: improve crypto ux\nmission:…"
},
{
    "time": "2023-09-22T23:17:47.000Z",
    "tweet_text": "Poderoso ",
    "repost_text": "Excited to announce another major international milestone for Coinbase with today's VASP registration from the Bank of Spain  \n\nCrypto regulatory clarity in the EU is helping to accelerate our expansion efforts in the region! \n\nhttps://coinbase.com/blog/coinbase-obtains-bank-of-spain-registration-in-spain…"
},
{
    "time": "2023-09-22T22:38:28.000Z",
    "tweet_text": "Thanks for hosting me @twobitidiot https://x.com/twobitidiot/st/twobitidiot/status/1705282155499200603…"
},
{
    "time": "2023-09-21T17:55:35.000Z",
    "tweet_text": "> be me, living in the year 2030\n> feels like a sci-fi movie but with more ads\n> get a call on my Neuralink\n> voice says, \"ah, wrong brainwave frequency, my bad bro\"\n> go back to watching Fast and Furious XXIV on VR Netflix\n> 2 seconds later, get a notification\n> \"Voice ID…"
},
{
    "time": "2023-09-22T19:44:17.000Z",
    "tweet_text": "It only costs $10k to take the top spot in the donation leaderboard on https://standwithcrypto.org. These are the best marketing dollars a project can spend and I invite folks to come take the top spot from @brian_armstrong!"
},
{
    "time": "2023-09-22T22:07:48.000Z",
    "tweet_text": "Count me as someone who believes AI should not be regulated\n\nWe need to make progress on it as fast as possible for many reasons (including national security). And the track record on regulation is that it has unintended consequences and kills competition/innovation, despite best…"
},
{
    "time": "2023-09-21T13:14:24.000Z",
    "tweet_text": "The bureaucrat:builder ratio in the United Stares is absolutely out of control"
},
{
    "time": "2023-09-22T00:47:14.000Z",
    "tweet_text": "Opening this up to all tech startups looking for office space - including software companies.\n\nWe have great regular office space as well.\n\nThe density of really ambitious companies in one spot should be fun.\n\nSame form: https://docs.google.com/forms/d/e/1FAIpQLScyaHHGPpexslXQ8clkGk-7lrQP59T2kqlQvxNPIamsYHHkpQ/viewform?usp=sf_link…"
},
{
    "time": "2023-09-21T23:30:23.000Z",
    "tweet_text": "lol - this is real\n\nOur government is a bit old school. Pick up the phone and CALL.\n\nWe're not going to let a few activists try and unlawfully kill crypto in the the land of the free. \nhttps://standwithcrypto.org/call",
    "repost_text": "Any guesses where this could be?\n\nDrop the location in the comments (good luck).  x.com/coinbase/statu…"
},
{
    "time": "2023-09-21T23:22:41.000Z",
    "tweet_text": "Talk should be coming out soon - thank you to @MessariCrypto for hosting me!",
    "repost_text": "\"In 2024 some people need to win or lose an election because of their stance on crypto.\" \n\nCoinbase CEO @brian_armstrong pledges $1M donation to crypto super PAC at #Mainnet2023\n\nLearn more at http://standwithcrypto.org"
},
{
    "time": "2023-09-21T21:02:53.000Z",
    "tweet_text": "This was a fun talk with an awesome group - love @theallinpod \n\nWe need to stand up for our rights (call, donate, vote on http://standwithcrypto.org) and send a message to Washington\n\nThen let’s get back to building with this amazing tech we have. That’s on us.",
    "repost_text": "besties @allinsummit in conversation w/ @brian_armstrong \n\navailable on @x & @YouTube\n\n-- regulation & “weaponizing the SEC”\n-- decentralized ID + other use cases \n-- crossing the crypto chasm \n-- pro-crypto candidates \n-- @SBF_FTX  & @cz_binance\n++ more\n…"
},
{
    "time": "2023-09-20T21:27:16.000Z",
    "tweet_text": "*The Casino on Mars*\n\nIt’s useful to think of crypto as a new planet that’s being settled.\n\nSkeptics see a desolate planet without purpose. Or worse, a haven for an unsavory casino.\n\nOptimists see the planet’s potential: a blank slate on which we can build an upgraded financial…"
},
{
    "time": "2023-09-21T17:59:29.000Z",
    "tweet_text": "Cryptocurrency adoption looks a lot like messaging app growth circa 2010.\n\nLocal players with high fee structures, poor cross border interoperability, etc.\n\nhttps://chainalysis.com/blog/2023-global-crypto-adoption-index/…\n\nHT @RachaelRad"
},
{
    "time": "2023-09-20T10:25:22.000Z",
    "tweet_text": "I don't mind when people are unambitious. It's up to each person to decide that. But it bugs me when the people who aren't ambitious try to bring down those who are."
},
{
    "time": "2023-09-20T03:08:42.000Z",
    "tweet_text": "It’s an unfortunate reality that much of science is fake work. Results that won’t replicate, papers of no consequence, even entirely fake disciplines.\n\nWe would benefit from more scientists working on higher risk, higher reward breakthroughs that could translate into real…"
},
{
    "time": "2023-09-19T20:57:08.000Z",
    "tweet_text": "Easy Web3 onboarding is critical to the next wave of adoption. With @PetraWallet’s integration of @Coinbase Pay, your first steps into Web3 are easier than ever.\n\nThis @AptosLabs partnership is a huge step toward frictionless onboarding of millions.",
    "repost_text": "EXCLUSIVE: @AptosLabs adds @Coinbase Pay to its @PetraWallet to make web3 onboarding easier\n\nhttps://techcrunch.com/2023/09/19/aptos-labs-adds-coinbase-pay-to-its-petra-crypto-wallet/…"
},
{
    "time": "2023-09-19T16:52:33.000Z",
    "tweet_text": "52M Americans own crypto. They’re younger & more diverse than the US population in total. But their voices aren’t being heard by Congress.\n\nThat’s about to change.\n\nHere’s what we’re doing—and what you can do to help mobilize 1M people to #StandWithCrypto:"
},
{
    "time": "2023-09-18T21:44:56.000Z",
    "tweet_text": "Want to do dope crypto native stuff at @Coinbase as a PM? Complete this bounty. Winners will at best get a very nice job, but at worst will walk away with up to $2k for their time. https://coinbase.com/bounty/5UjkrQJ3lFiActZKEyZrew…"
},
{
    "time": "2023-09-16T21:14:19.000Z",
    "tweet_text": "Poetic and inspiring talk from @ErikVoorhees \n\nFreedom is on the frontier, and it’s messy, but it creates the best outcomes for society. Those claiming to protect us from it are after power for themselves and end up harming society.\n\nWe’ve seen how that experiment plays out many…"
},
{
    "time": "2023-09-16T21:20:16.000Z",
    "tweet_text": "The most regulated industries have higher prices and less competition + innovation, harming consumers.\n\nThe free market is the best regulator, quickly weeding out companies with worse products and worse prices."
},
{
    "time": "2023-09-16T03:55:21.000Z",
    "tweet_text": "Instant classic from @bgurley \n\nSo good"
},
{
    "time": "2023-09-14T23:17:49.000Z",
    "tweet_text": "We will be updating their scorecards on http://standwithcrypto.org accordingly",
    "repost_text": "NEW: @SenWarren adds NINE new cosponsors to her anti-crypto bill. All Democrats. This does not change the trajectory of the bill as most of these co-signers were expected. \n\nThe new co-signers are:\nHomeland Security Chair Gary Peters (D-Mich.)\nJudiciary Chair Dick Durbin…"
},
{
    "time": "2023-09-13T15:51:10.000Z",
    "tweet_text": "Ah yes, the classic $0 to $1.4B in revenue in 3 years underachievement."
},
{
    "time": "2023-09-13T21:55:58.000Z",
    "tweet_text": "\"Free\" office space\n\nIf you're a biotech or hard tech startup building something awesome, @newlimit has extra office/lab space to share in South San Francisco and is looking for great neighbors.\n\nOpen to taking a small equity stake in lieu of cash to preserve your runway.\n\nSay…"
},
{
    "time": "2023-09-13T19:36:44.000Z",
    "tweet_text": "The CFTC should not be creating enforcement actions against decentralized (DeFi) protocols. These are not financial service businesses, and it’s highly unlikely the Commodity Exchange Act even applies to them.\n\nMy hope is these DeFi protocols take these cases to court to…"
},
{
    "time": "2023-09-13T03:55:10.000Z",
    "tweet_text": "The team did a great job digging into this, and we've made the decision to integrate Lightning. Bitcoin is the most important asset in crypto and we're excited to do our part to enable faster/cheaper Bitcoin transactions. Will take some time to integrate so please be patient.",
    "repost_text": "Friends, I'm happy to say that I'm leading up this effort. DM me if you'd like to grab some time to chat Lightning support at @Coinbase. \n\nParticularly keen to get insights on lift to add support, UX flows, open source tooling, service providers, and edge cases. Thanks! x.com/brian_armstron…"
},
{
    "time": "2023-09-13T02:44:15.000Z",
    "tweet_text": "I'll be speaking at #Mainnet2023. Join me at the event on Sept 20-22 in NYC. https://zpr.io/VGA5nxcjUW3V #Mainnet2023 @messarimainnet @messaricrypto"
},
{
    "time": "2023-09-12T17:46:53.000Z",
    "tweet_text": "Very proud of the @Flexport team for launching our new offering for entrepreneurs and small businesses today. Flexport started as a tech-enabled freight forwarding platform, but we have always had a bigger vision. Now we’ve connected our international shipping services with…",
    "repost_text": "Today, we're launching a supply chain revolution for entrepreneurs with the first truly all-in-one, end-to-end global trade solution powering instant access to financing, freight, fulfillment & replenishment to all major marketplaces & retail stores: http://flx.to/revolution1 (1/3)"
},
{
    "time": "2023-09-12T14:13:07.000Z",
    "tweet_text": "My thesis for working at @coinbase is simple. It is the most legit crypto company. So if crypto does well, then Coinbase will do well, and vice versa. I also believe in crypto and enjoy working on crypto. So work is fun and meaningful. That's all there is to it."
},
{
    "time": "2023-09-08T15:54:29.000Z",
    "tweet_text": "late summer @newlimit \n\n- world's largest partial reprogramming screen (again)\n- 3x'd speed of sequencing turn-around\n- 5x'd reprog factor library size\n- built our first integrated reprog corpus for model training\n- team += 3\n\nall in our latest blog!"
},
{
    "time": "2023-09-11T16:16:32.000Z",
    "tweet_text": "The SEC Chair is set to testify on Tuesday. Here are the facts. https://coinbase.com/blog/just-the-facts-a-regulation-by-enforcement-only-approach-is-hurting-american…"
},
{
    "time": "2023-09-09T16:28:35.000Z",
    "tweet_text": "broke: paying fees, no purpose in life\nwoke: @coinbase One Monthly plan\nbespoke: @coinbase One Annual plan"
},
{
    "time": "2023-09-08T00:07:02.000Z",
    "tweet_text": "Increasingly, dissents from the likes of @cftcmersinger and @HesterPeirce read like those historic judicial dissents which were minority views at the time but are self-evidently correct in hindsight - I believe the phrase is, “on the right side of history.”"
},
{
    "time": "2023-09-09T21:40:02.000Z",
    "tweet_text": "Minted https://peachdrop.xyz\n\nThese peaches are incredible - no joke"
},
{
    "time": "2023-09-08T21:22:25.000Z",
    "tweet_text": "Sat down with Coinbase CEO @brian_armstrong at Goldman Sachs conference in SF \n\nOn regulation: \"We need to have clear rules that recognize the innovation potential of this technology but also protect consumers from harm. And in the absence of that we've seen terrible things…"
},
{
    "time": "2023-09-06T18:57:46.000Z",
    "tweet_text": "Privacy Pools has the potential to be the most important tool we have to address regulatory challenges while maintaining privacy on public blockchains.",
    "repost_text": "1/ New privacy paper with @VitalikButerin, Jacob Illum (@chainalysis), @mat_nadler, @fschaer!\n\nhttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=4563364…\n\nWe explored new compliance opportunities made possible by http://privacypools.com, where users can provably dissociate from illicit funds.\n\nstory below "
},
{
    "time": "2023-07-06T20:54:08.000Z",
    "tweet_text": "George Hotz is so based."
},
{
    "time": "2023-09-07T12:08:56.000Z",
    "tweet_text": "In 2009, Stanford business professor Tina Seelig split her class into groups and issued a challenge:\n\nEach group had $5 and 2 hours to make the highest return on the initial money.\n\nAt the end, they'd give a short presentation on their strategy.\n\nThe results were fascinating...…"
},
{
    "time": "2023-09-07T04:26:39.000Z",
    "tweet_text": "So glad we can finally talk about this!  Fury is a high-performance, multi-mission group 5 autonomous air vehicle.  It is capable of pulling 9Gs at Mach 0.95 for a tiny fraction of the cost of similarly performant fighter craft.\n\nhttps://anduril.com/fury/"
},
{
    "time": "2023-09-06T15:41:07.000Z",
    "tweet_text": "To invent an age reversing cocktail, start by looking at what makes young cells different from old cells and borrow that magic youth sauce. https://blog.newlimit.com/p/july-august-2023-progress-update…"
},
{
    "time": "2023-09-06T00:29:09.000Z",
    "tweet_text": "Well done @circle and @jerallaire ",
    "repost_text": "Native USDC is now live on Base.\n\nUsers can access native USDC from @coinbase and transfer to any EVM-compatible wallet."
},
{
    "time": "2023-08-30T16:32:17.000Z",
    "tweet_text": "1/ I'm sharing the 10 ideas I'm most excited about in crypto right now. If you're building something in crypto or thinking about doing so - check it out.\n\nWe’re building lots at Coinbase, but we don't have time to tackle everything. So I figured I'd share these. Bear markets are…"
},
{
    "time": "2023-08-30T16:35:48.000Z",
    "tweet_text": "4/ Video is also on YouTube here"
},
{
    "time": "2023-09-06T00:21:05.000Z",
    "tweet_text": "5/ I added a bonus idea: Web3 version of LinkedIn",
    "repost_text": "We've gotten more than 150 applications so far! Awesome to see.\n\nOne other idea (#11) I'll add into the mix: a Web3 version of LinkedIn\n- it would be great if companies could issue soulbound NFTs to verify employment or credentials\n- build a front end to explore employee and… x.com/brian_armstron…"
},
{
    "time": "2023-09-06T00:20:02.000Z",
    "tweet_text": "We've gotten more than 150 applications so far! Awesome to see.\n\nOne other idea (#11) I'll add into the mix: a Web3 version of LinkedIn\n- it would be great if companies could issue soulbound NFTs to verify employment or credentials\n- build a front end to explore employee and…",
    "repost_text": "1/ I'm sharing the 10 ideas I'm most excited about in crypto right now. If you're building something in crypto or thinking about doing so - check it out.\n\nWe’re building lots at Coinbase, but we don't have time to tackle everything. So I figured I'd share these. Bear markets are…"
},
{
    "time": "2023-09-01T01:23:19.000Z",
    "tweet_text": "#OnchainSummer has been a beautiful reprieve from the hostilities toward the industry.\n\nShows the culture and builders are still here. Shows how many bugs and rough edges we still have to work on to go mainstream. Gave us great motivation to keep improving L2s, UX, etc. Shows the…",
    "repost_text": "ᴏɴᴄʜᴀɪɴ  ꜱᴜᴍᴍᴇʀ\n\nClose out Onchain Summer with an adorable, dynamic @finidotworld character whose mood and actions are tied to your activity on Base.\n\nMint now: http://onchainsummer.xyz/fini"
},
{
    "time": "2023-09-01T00:03:13.000Z",
    "tweet_text": ".@jontester what is your position on crypto and the current crypto bills in the house? https://x.com/twobitidiot/st/twobitidiot/status/1697294241309786224…"
},
{
    "time": "2023-08-30T16:12:00.000Z",
    "tweet_text": "GM management \n\nDrop #3 by our newest creator @MLeeJr is live\n\nMint:"
},
{
    "time": "2023-08-31T03:54:58.000Z",
    "tweet_text": "After Grayscale, I was curious about other APA-review cases that were filed and adjudicated under the current SEC administration. I’m happy to be corrected, but there appears to be three others. The overall record?  1-3. "
},
{
    "time": "2023-08-31T00:52:48.000Z",
    "tweet_text": "One point of clarification: you don’t have to be working on one of these 10 ideas to apply. \n\nYou can apply with any idea in crypto, or even if you don’t have a specific idea (but you have to have built something awesome in the past/have a demonstrated track record of shipping).",
    "repost_text": "1/ I'm sharing the 10 ideas I'm most excited about in crypto right now. If you're building something in crypto or thinking about doing so - check it out.\n\nWe’re building lots at Coinbase, but we don't have time to tackle everything. So I figured I'd share these. Bear markets are…"
},
{
    "time": "2023-08-31T00:53:59.000Z",
    "tweet_text": "And at least someone on the team must be technical (can code)."
},
{
    "time": "2023-08-30T21:02:54.000Z",
    "tweet_text": "1/ \n\nHuge win, long live DeFi \n\nOne longtime fear of mine has been bad legal interpretation of our complex, technical industry\n\nIt’s highly motivating to see US courts hold up arguments I’ve felt deeply for years\n\nBelow are some of the most BASED  (smart) court comments"
},
{
    "time": "2023-08-30T17:45:34.000Z",
    "tweet_text": "The shadow government in D.C. is out of control & the federal courts are our *only* remaining line of defense against the unlawful rogue behaviors of 3-letter government agencies. This decision is strong and clears a path to keep Bitcoin & blockchain innovation in the U.S.…",
    "repost_text": "Nice win for crypto this morning out of the DC Circuit—a federal appeals court one step removed from SCOTUS—with a remarkably unanimous decision from an ideologically diverse panel.\n\nThe 3 judges ruled the SEC failed to adequately explain its disparate treatment of one BTC ETF…"
},
{
    "time": "2023-08-30T16:35:11.000Z",
    "tweet_text": "3/ Read more in our blog post:"
},
{
    "time": "2023-08-30T01:33:38.000Z",
    "tweet_text": "Excited to support @BuildOnBase!\n\n@brian_armstrong @jessepollak ",
    "repost_text": "You thought we weren’t coming to the party?\n\nWe wouldn’t miss it.\n\nAlchemy  @BuildOnBase. The future of building onchain is here.\n\nGet your API keys now "
},
{
    "time": "2023-08-30T01:41:55.000Z",
    "tweet_text": "Cynicism and pessimism sound smart. Often, you encounter them because someone wishes to sound smart, but likely isn't.",
    "repost_text": "A worldwide survey of 200k people finds cynical people are thought of as smarter... but that, in reality, cynics test lower on cognitive & competency tests.\n\nAs Stephen Colbert said: “Cynicism masquerades as wisdom, but it is the furthest thing from it.” https://journals.sagepub.com/doi/pdf/10.1177/0146167218783195…"
},
{
    "time": "2023-08-30T00:42:03.000Z",
    "tweet_text": "Exactly - this tech cannot be uninvented",
    "repost_text": "We’re going to pass sensible crypto legislation\n\nWe’re going to build fast crypto payment apps\n\nWe’re going to use DeFi in capital markets\n\nWe’re going to leverage NFTs for consumer brands\n\nWe’re going to create an open financial system to improve the world\n\nWe’re going onchain."
},
{
    "time": "2023-08-29T17:29:25.000Z",
    "tweet_text": "Congrats!\n\nStrange world we live in where winning against this SEC in court is seen as a rite of passage in our industry."
},
{
    "time": "2023-08-29T18:34:19.000Z",
    "tweet_text": "Join us for an engaging fireside chat with @brian_armstrong, the CEO and co-founder of @ResearchHub and @Coinbase, at #SciCon2023!\n\nDo you have burning questions for Brian about Research Hub, Decentralized Science, or Science in general? Share your questions below. \nSign Up…"
},
{
    "time": "2023-08-29T17:09:03.000Z",
    "tweet_text": "SEC Chair @GaryGensler's crusade against the digital asset ecosystem is falling apart under scrutiny from the courts.\n\nThis is yet another example of why a comprehensive regulatory framework, like the FIT for the 21st Century Act, must be made law."
},
{
    "time": "2023-08-29T20:13:29.000Z",
    "tweet_text": "Cool NFT that evolves based on your activity.\n\nI'm currently Mint Mastermind, with 2 more levels to become Fully Based.\n\nIt's the last few days of #OnchainSummer\n\nSend \"gm\" to onchainsummer.eth in @CoinbaseWallet (new messaging functionality based on @xmtp_ protocol)",
    "repost_text": "Join the Based Challenge \n\nMessage the Onchain Summer bot and you'll get airdropped some onchain art. Then watch it evolve as you mint more on Base over time.\n\nStart here: https://go.cb-w.com/onchain-summer-subscribe…"
},
{
    "time": "2023-08-29T14:41:23.000Z",
    "tweet_text": "The great thing about the American political system is that it’s designed to curtail administrative overreach \n\nIn the face of an intransigent @SECGov, the courts will ensure crypto has a future in the US"
},
{
    "time": "2023-08-29T14:28:34.000Z",
    "tweet_text": " JUST IN \n\nThe D.C. Circuit ruled in favor of @Grayscale in our lawsuit challenging the SEC's decision to deny $GBTC's conversion to an ETF!\n\nThank you to everyone who has been on this journey with us, especially our investors. We are grateful for your support and…"
},
{
    "time": "2023-08-29T14:02:28.000Z",
    "tweet_text": "Milestone: 100,000 ETH bridged to @BuildOnBase "
},
{
    "time": "2023-08-29T15:49:52.000Z",
    "tweet_text": "3-0. Judge Rao writing for the panel. I’ll say it again— they are not perfect but when it comes to protecting the rule of law, the courts remain our last, best hope .",
    "repost_text": "Yep.  Judge Rao has been extremely consistent in her jurisprudence. But all eyes should focus on Chief Judge Srinivasan -- he's the key vote. x.com/SGJohnsson/sta…"
},
{
    "time": "2023-08-21T20:39:17.000Z",
    "tweet_text": "Genesis mint officially closed \n\nThank you to everyone who minted and we welcome all 1,931 of you to management \n\nMore soon"
},
{
    "time": "2023-08-28T17:06:13.000Z",
    "tweet_text": "The SEC filed and settled its first NFT enforcement action today: https://sec.gov/news/press-release/2023-163… Here's Commissioner Uyeda's and my dissent: https://sec.gov/news/statement/peirce-uyeda-statement-nft-082823…"
},
{
    "time": "2023-08-27T22:54:04.000Z",
    "tweet_text": "Minted!",
    "repost_text": "RainbowWorld mint is live at \nhttp://onchainsummer.xyz/rainbow\n\nGenerative.\nInteractive.\nCustomizable.\n\n@adworldgame x Rainbow "
},
{
    "time": "2023-08-27T17:00:00.000Z",
    "tweet_text": "I just minted ClashMon Game NFT Mystery Box, celebrating the start of @BuildOnBase bringing people onchain.\n\nIt’s Onchain Summer."
},
{
    "time": "2023-08-25T21:36:28.000Z",
    "tweet_text": "100s of artists all over the world\nworking together in a positive sum way \nto create incredibly beautiful art \nthat earns them real money\n\nTHIS IS WHAT ONCHAIN IS ALL ABOUT",
    "repost_text": "Just claimed 1.608671359392884338 ETH from @basepaint_xyz for my contribution to the artwork! \n\n\n\nThanks for being part of it... "
},
{
    "time": "2023-08-25T18:46:35.000Z",
    "tweet_text": "",
    "repost_text": "The Base protocol launch is the best crypto has ever seen…"
},
{
    "time": "2023-08-25T16:04:29.000Z",
    "tweet_text": "ᴏɴᴄʜᴀɪɴ  ꜱᴜᴍᴍᴇʀ\n\nNow entering the pool: @AtariX\n\nAtari's throwing it back to 1982 Summer Camp with a unique onchain collectible and retro merch.\n\nMint now: http://onchainsummer.xyz/atari"
},
{
    "time": "2023-08-25T18:15:38.000Z",
    "tweet_text": "",
    "repost_text": "Proposed treasury regs for crypto asset 'brokers' just dropped and do indeed explicitly characterize various persons involved in DeFi (including operators of websites that communicate with wallets) as brokers . I'll need to dig in more but it looks pretty bad."
},
{
    "time": "2023-08-25T00:33:27.000Z",
    "tweet_text": "Biden's DOJ is suing SpaceX for not hiring more refugees. In other words, it demands SpaceX hire fewer Americans! But national security laws require that rocket companies hire American. This lawsuit is so nonsensical it suggests a political motivation."
},
{
    "time": "2023-08-25T17:23:47.000Z",
    "tweet_text": "I just minted Atari Summer Camp, celebrating the start of @BuildOnBase bringing people onchain.\n\nIt’s Onchain Summer."
},
{
    "time": "2023-08-24T16:05:24.000Z",
    "tweet_text": "In order to enable a global, open, onchain economy, we believe that Base must be decentralized\n\nTo prioritize this, we've built Base on the OP Stack in collaboration with @optimismFND\n\nToday, we're sharing an update on our commitment"
},
{
    "time": "2023-08-23T16:24:23.000Z",
    "tweet_text": "I have my guiding motto on a wall in my house. It’s a quote from George Bernard Shaw that says: “The reasonable man adapts himself to the world; the unreasonable one persists in trying to adapt the world to himself. Therefore, all progress depends on the unreasonable man.”\n\nI am…"
},
{
    "time": "2023-08-23T14:15:14.000Z",
    "tweet_text": "",
    "repost_text": "\"The Relentless Rise of Stablecoins\" is the result of hundreds of hours of onchain stablecoin analysis. \n\nDownload here: https://lnkd.in/gz7QBdjJ\n\nTop 10 takeaways below."
},
{
    "time": "2023-08-23T00:37:53.000Z",
    "tweet_text": "",
    "repost_text": "Noun 821 to us reads as the Noun for celebrating http://onchainsummer.xyz \n\nThe ETH L2 wave is definitely starting from a solid base! @BuildOnBase \n\nIf you want to catch the ETH wave you can find the auctions at http://Nouns.wtf @nounsdao"
},
{
    "time": "2023-08-22T23:32:53.000Z",
    "tweet_text": ".@BuildOnBase hit 16 transactions per second yesterday\n\nlots due to @friendtech but still - incredible growth",
    "repost_text": "proud to see @BuildOnBase exceed ethereum transactions yesterday and all L2s have 5x more \n\nwe're scaling y'all "
},
{
    "time": "2023-08-22T04:41:44.000Z",
    "tweet_text": "Shout out to the mobile Safari team at Apple for this brave act of civil disobedience.\n\nKnow that you have friends on the outside who will protect you.\n\n",
    "repost_text": "We’re likely going to be seeing many more progressive web apps (PWAs) like @friendtech \n\nRemember when @Apple blocked NFT transfers on @CoinbaseWallet because they demanded 30% of the *gas fees* but their In-App Purchase module didn’t support crypto\n\nThat’s the same thing as the…"
},
{
    "time": "2023-08-21T23:36:54.000Z",
    "tweet_text": "Excited to see $USDC launching on new chains and appreciative of all the work with @circle and @jerallaire over the years.\n\nThe world needs reliable infrastructure for stablecoins to help increase economic freedom globally!",
    "repost_text": "1/ Some major news from @circle and @coinbase on the future of $USDC in this joint blog post from @brian_armstrong and I (@jerallaire).   https://circle.com/blog/ushering-in-the-next-chapter-for-usdc…"
},
{
    "time": "2023-08-19T17:07:53.000Z",
    "tweet_text": "Just before he stepped down as CEO of Amazon, Jeff Bezos wrote his final shareholder letter. He closed it out with a section he titled, “Differentiation is Survival and the Universe Wants You to be Typical.” \n\nHe prefaced his own thoughts with a quote from The Blind Watchmaker,…"
},
{
    "time": "2023-08-20T16:30:55.000Z",
    "tweet_text": "This is what the Bay Area could be with less government intervention, and more economic freedom.",
    "repost_text": "It's time to build the bay area megacity.\n\n- rapid transportation (both intercity and intracity)\n- high density\n- high walkability\n- enough housing to have 100 million+\n- the home of 10+ trillion dollar companies\n- underground hyperlogistics + robotic network \n- capital of tech,…  x.com/tszzl/status/1…"
},
{
    "time": "2023-08-18T22:20:43.000Z",
    "tweet_text": "Last year we released a documentary about Coinbase's 10 year journey from idea to public company. Excited it's now available to watch on Youtube worldwide for free.\n\nHopefully now more people can watch it and be inspired to build something of their own."
},
{
    "time": "2023-08-18T20:50:15.000Z",
    "tweet_text": "Interesting that even the @SECGov is accepting that digital assets themselves are not inherently securities. \n\nHowever, not entirely surprising as both Judge Rakoff and Judge Torres came to this conclusion in their respective cases."
},
{
    "time": "2023-08-17T14:36:16.000Z",
    "tweet_text": "3 take-aways: 1) @CFTC continues to bring #crypto into regulatory envelope by existing reg process, not just by enforcement, 2) #SRO oversight still key to orderly @CFTC mkts incl. crypto & 3) fits w/intermediated structure of US futures mkts. @Coinbase @brian_armstrong https://x.com/coinbase/statu/coinbase/status/1691751814004175204…"
},
{
    "time": "2023-08-17T18:39:20.000Z",
    "tweet_text": "I just minted Summer Kevin, celebrating the start of @BuildOnBase bringing people onchain.\n\nIt’s Onchain Summer."
},
{
    "time": "2023-08-16T22:51:07.000Z",
    "tweet_text": "This is an incredible value if you've been curious to try Coinbase One (free trades, boosted rewards, etc)... #OnchainSummer mints on Base can cost pennies",
    "repost_text": "ᴏɴᴄʜᴀɪɴ  ꜱᴜᴍᴍᴇʀ\n\nICYMI: Any wallet that mints an Onchain Summer release and is new to Coinbase One is eligible for a 60-day free trial.\n\nUnlock zero trading fees, boosted staking rewards, priority support, and more. Cancel anytime.\n\nClaim here: http://cb1.onchainsummer.xyz"
},
{
    "time": "2023-08-15T22:15:20.000Z",
    "tweet_text": "Onchain Summer in Chicago starts in 45 mins "
},
{
    "time": "2023-08-16T15:53:40.000Z",
    "tweet_text": "Major moment for crypto regulatory clarity in the U.S.\n\nThis has been a multi-year process toward approval, and we're excited to finally be launching federally regulated crypto derivatives with margin to our U.S. customers.\n\nWhen there is a clear path to register, we do. https://x.com/coinbase/statu/coinbase/status/1691751814004175204…"
},
{
    "time": "2023-08-15T18:52:11.000Z",
    "tweet_text": "Well said. Blatantly political behavior from a regulator undermines trust in our institutions. Everyone deserves equal treatment under the law.",
    "repost_text": "#NEW: Chairman @PatrickMcHenry led Republicans on the Financial Services Committee in letters to @FINRA  and @SECGov regarding the shady approval of Prometheum as the only Special Purpose Broker-Dealer for digital assets.\n\n Read more \nhttps://financialservices.house.gov/news/documentsingle.aspx?DocumentID=408950…"
},
{
    "time": "2023-08-15T14:19:38.000Z",
    "tweet_text": "We're excited to announce that Fireblocks has launched support for Base mainnet, a new Ethereum L2 blockchain incubated by @coinbase. Fireblocks users can now access @BuildOnBase with the ease, efficiency, and security they’ve come to expect from our platform. Read on →…"
},
{
    "time": "2023-08-14T19:27:40.000Z",
    "tweet_text": "I get a lot of wonderful people asking:  I'm just a normal person, how can I help get to reasonable rules for crypto?  Well, here's how:  sign up below.",
    "repost_text": "Today marks the launch of the Stand with Crypto Alliance, an advocacy organization aimed at uniting global crypto advocates.\n\nPolicymakers are making decisions about the future of crypto. It’s critical that they get it right.\n\nYour voice matters. Sign up now:…"
},
{
    "time": "2023-08-15T04:08:39.000Z",
    "tweet_text": "",
    "repost_text": "Feels like Coinbase is back to a culture of shipping at the right moment during the bear market.\n\nBase, re-launching Canada, improvements to Wallet.\n\nKudos to everyone there sticking it out. "
},
{
    "time": "2023-08-14T20:45:06.000Z",
    "tweet_text": "O Canada.\nAmerica’s friendly hat.\n\nEffective today, you can all now easily buy, sell, and trade crypto on Coinbase.\n\nWelcome, neighbours.\n\nRead more: https://coinbase.com/blog/coinbase-officially-launches-in-canada…"
},
{
    "time": "2023-08-14T20:03:06.000Z",
    "tweet_text": "if you like onchain summer \n\nmint the stand with crypto shield \n\ntime for better crypto policy globally "
},
{
    "time": "2023-08-14T21:53:11.000Z",
    "tweet_text": "Over the weekend, @sheila_warren and I published an op-ed on how many of my fellow progressives are making an analytical mistake when it comes to crypto.\n\nThis is probably the most personal work I've done in a long time.\n\nhttps://fortune.com/crypto/2023/08/12/what-progressives-get-wrong-when-it-comes-to-crypto/amp/…"
},
{
    "time": "2023-08-14T18:36:27.000Z",
    "tweet_text": "Friends, I am incredibly happy to share that @Coinbase launched https://standwithcrypto.org.\n\nOpen it, sign up, and get involved. This will be one of the most impactful things you'll do all week and it only takes 30 seconds.\n\nStand with Coinbase as we stand with Crypto and with You."
},
{
    "time": "2023-08-14T19:53:13.000Z",
    "tweet_text": "I’ve been a @Coinbase customer for 9+ years. Today Coinbase officially launched in #Canada. A special moment for me - and the future of crypto in Canada. Now the hard work begins! ",
    "repost_text": "Coinbase is launching in Canada today! \n\nNew leadership, new payment rails, new regulatory milestones, and 200 local employees.\n\nSmart countries are embracing this technology (and creating regulatory clarity) to help update the financial system and drive economic growth.…"
},
{
    "time": "2023-08-14T21:58:31.000Z",
    "tweet_text": "\"With lawmakers casting a shadow over the future of onchain technologies, we recognize the urgent need to rally the community.\"\n\nLearn how the #StandWithCrypto Alliance is mobilizing the crypto community for a better onchain future\n\nhttps://onchainsummer.xyz/standwithcrypto"
},
{
    "time": "2023-08-15T00:19:26.000Z",
    "tweet_text": ".@tobi has been a great board member at Coinbase",
    "repost_text": "If you're in  and haven't tried @Coinbase yet, try it out: https://coinbase.com \n\nJust expanded services. I've enjoyed being on the board, helping @brian_armstrong and @lucmatheson make that happen https://coinbase.com/blog/coinbase-officially-launches-in-canada…"
},
{
    "time": "2023-08-14T16:04:30.000Z",
    "tweet_text": "Hi from Toronto with our country director @lucmatheson   Thrilled to announce that Coinbase is expanding into Canada - our next priority #GoDeep market. We have an amazing team of nearly 200 here to build from Canada for Canada  and the world!"
},
{
    "time": "2023-08-14T16:46:30.000Z",
    "tweet_text": "Coinbase is launching in Canada today! \n\nNew leadership, new payment rails, new regulatory milestones, and 200 local employees.\n\nSmart countries are embracing this technology (and creating regulatory clarity) to help update the financial system and drive economic growth.…"
},
{
    "time": "2023-08-14T16:38:12.000Z",
    "tweet_text": "Crypto market structure and stablecoin bills doing a bunch of this lately. Passed the house committees with bipartisan support! Next step full house vote.\n\nThese bills are pretty much common sense: protect investors, foster innovation."
},
{
    "time": "2023-08-12T16:03:45.000Z",
    "tweet_text": "ONCHAIN SUMMER  DAY FOUR\n\n@anotherblock_io has curated a selection of onchain music from renowned artists @boysnoize, @LaidbackLuke, and @kleerup\n\nThe mints include exclusives like unreleased songs and access to never-before-heard demos\n\nhttps://onchainsummer.xyz/anotherblock"
},
{
    "time": "2023-08-13T18:20:15.000Z",
    "tweet_text": "One thing #OnchainSummer is exposing is just how broken our UX is in the main Coinbase app for NFTs, Dapps, and L2s today. Sorry to say, but true.\nIf we face truth, we can get motivated to improve it. These need to be first class experiences, and #OnchainSummer is a great impetus…"
},
{
    "time": "2023-08-13T18:11:45.000Z",
    "tweet_text": "Spotted in the wild - LFG",
    "repost_text": " You’re everywherreee to meeee "
},
{
    "time": "2023-08-13T17:54:15.000Z",
    "tweet_text": "I just minted Munch, \"The Scream\", celebrating @BuildOnBase bringing people onchain.\n\nIt’s Onchain Summer."
},
{
    "time": "2023-08-12T12:51:09.000Z",
    "tweet_text": "onchain summer doesn't stop on the weekends. today and every day in august:\n\n we will be minting one cool thing\n I'll be doing a story livestream at 10a PT\n the builders will keep building \n\nhit me up if I can help you build "
},
{
    "time": "2023-08-12T13:31:50.000Z",
    "tweet_text": "SEC v. Coinbase, Big Update:\n\nSix Securities Law Scholars File Devastating Amicus Brief in Support of @Coinbase. \n\nLaw Professors from Yale, Univ. of Chicago, UCLA, Fordham, Boston University and Widener filed an amicus brief last night that Absolutely Shreds the SEC's…"
},
{
    "time": "2023-08-11T17:37:29.000Z",
    "tweet_text": "I'm very proud of the amicus brief we filed today in support of Coinbase's battle against the SEC.\n\nHow digital assets should be regulated is a major question that only Congress can answer.\n\nUntil then, the SEC's claim of authority must be rejected, and Coinbase should win.",
    "repost_text": "1/ @BlockchainAssn and @crypto_council filed a brief with @ProgressChamber and @CTATech supporting @coinbase against the SEC. \n\nWe explain why the major questions doctrine precludes @SECGov from enforcing their interpretation of \"investment contract.\" \nhttps://theblockchainassociation.org/wp-content/uploads/2023/08/Coinbase-Amicus-Brief.pdf…"
},
{
    "time": "2023-08-11T22:12:29.000Z",
    "tweet_text": "We're stepping in. We've filed an amicus curiae brief in the @SECgov v. @Coinbase case. Our goal? To end the SEC’s attempt to regulate the #digitalasset industry WITHOUT legislative authority: https://digitalchamber.org/wp-content/uploads/2023/08/Coinbase_Chamber-of-Digital-Commerce_Amicus.pdf…"
},
{
    "time": "2023-08-12T01:30:59.000Z",
    "tweet_text": "Whoa - a sitting Senator is filing an amicus brief in support of @coinbase and against the SEC!\n\nGreat work @SenLummis"
},
{
    "time": "2023-08-11T18:55:28.000Z",
    "tweet_text": "Today, @a16zcrypto and @Paradigm teamed up to file an amicus brief in SEC v. @Coinbase. We argue that the SEC’s approach is a significant and problematic expansion of its regulatory authority – even threatening purchases of Taylor Swift concert tickets and Teslas. Why? Well…  "
},
{
    "time": "2023-08-11T09:47:55.000Z",
    "tweet_text": "NEWS:@Coinbase’s L2 blockchain, Base, has exceeded 100,000 daily active users for the first time, just the day following the official launch of the network.\n\n http://gcko.io/news"
},
{
    "time": "2023-08-11T19:38:09.000Z",
    "tweet_text": "Today @Paradigm and @a16zcrypto filed a joint amicus brief in @SECGov's case against @coinbase that demonstrates why the SEC’s approach is unsupported by case law and represents a significant and problematic expansion of its regulatory authority"
},
{
    "time": "2023-08-12T01:36:18.000Z",
    "tweet_text": "TIL amici is the plural of amicus (friend of the court) - lawyers love their latin\n\nIn any event, thank you so much to the MANY firms who wrote in supporting our case against the SEC.",
    "repost_text": "I can't say enough how gratifying it is to get support from so many amici today. Thank you. I appreciate the effort behind these briefs, and can't wait to read every word. I know they will prove useful to the Court in understanding the legal errors of the SEC's ways. Links below."
},
{
    "time": "2023-08-11T18:36:42.000Z",
    "tweet_text": " Unveiling my latest build: 'Onchain Illusion'\nA 3D-printed illusion for the #OnChainSummer of @BuildOnBase \nExcited to join the @nounsprophouse  grant with my creation \nhttps://prop.house/proposal/6601"
},
{
    "time": "2023-08-12T00:28:31.000Z",
    "tweet_text": "Base is off to a great start with #OnchainSummer\n\nTrack the stats here https://dune.com/tk-research/base…\n\nJoin us!\nBridge: https://bridge.base.org\nMint: https://onchainsummer.xyz"
},
{
    "time": "2023-08-12T00:18:06.000Z",
    "tweet_text": "",
    "repost_text": "spent the past 48 hrs deep diving into @BuildOnBase. \n\nthis effort from @coinbase will do more to push crypto mainstream than anything we have seen to date.\n\nfeeling fortunate to be here at this time participating in something so impactful.\n\nsome of my early base highlights "
},
{
    "time": "2023-08-11T18:00:11.000Z",
    "tweet_text": "It's day 3 of #OnchainSummer and the community is growing at a rapid pace\n\nJust today:\n1. I minted a starter deck at https://parallel.life/starter-decks/\nReally cool new game //\n2. Another song dropped https://zora.co/collect/base:0x7c0407ac359d783f4383b03d4f68c34b56b38e34…\n3. Zora x Base drop by ENERGY https://zora.co/collect/base:0x360ab052e8997d07dbb391b96daa3399758cab69…\n4. Really…"
},
{
    "time": "2023-08-10T21:51:07.000Z",
    "tweet_text": "Just minted Day 1 on @basepaint_xyz! Dozens of pixel artists made this together on the blockchain. Minting is open only for 24h"
},
{
    "time": "2023-08-10T03:43:14.000Z",
    "tweet_text": "I just bid https://songaday.world/auction/5334\nLFG",
    "repost_text": "Yes! #OnChainSummer x.com/songadaymann/s…"
},
{
    "time": "2023-08-10T03:19:23.000Z",
    "tweet_text": "Yes! #OnChainSummer",
    "repost_text": "#Onchainsummer"
},
{
    "time": "2023-08-09T23:28:19.000Z",
    "tweet_text": "I just bridged some ETH to Base. Try it - it's quite simple https://bridge.base.org/deposit\n(You can also do it from @CoinbaseWallet)\n\nLayer 2 feels great - changes the usability of crypto.\n\nPlus you get this sweet NFT\nhttps://nft.coinbase.com/mint/bridgetobase…"
},
{
    "time": "2023-08-09T22:26:47.000Z",
    "tweet_text": "Today is an important day for accelerating a global, decentralized financial system and increasing economic freedom in the world:\n\n@BuildOnBase is now live and available for everyone",
    "repost_text": "Base is open and Onchain Summer is here \n\nBecome a part of Base history by minting “Base Day One” to join the story of bringing the world onchain\n\nOur story.\n\nhttp://onchainsummer.xyz/base"
},
{
    "time": "2023-08-09T22:28:11.000Z",
    "tweet_text": "Base is celebrating the launch of mainnet with Onchain Summer, a multi-week onchain festival, and it starts with Base Day One — mint to join our story.\n\nCome back every day for something new."
},
{
    "time": "2023-08-09T22:28:32.000Z",
    "tweet_text": "Since I tweeted this in February, a vibrant ecosystem has taken shape across @BuildOnBase\n\nI look forward to seeing what builders create on Base and make available to people all over the world.",
    "repost_text": "1/ Today, Coinbase is launching @BuildOnBase, an Ethereum layer 2 that will help improve scalability and usability of crypto, so we can bring economic freedom to 1B+ people."
},
{
    "time": "2023-08-09T22:27:26.000Z",
    "tweet_text": "Base mainnet is now live, with 100+ apps and service providers already available in the ecosystem. Anyone can explore these apps with low gas fees, fast speeds, and secure transactions settled on Ethereum."
},
{
    "time": "2023-08-09T18:53:23.000Z",
    "tweet_text": "Hi  @jessepollak @brian_armstrong \n\nWe love @BuildOnBase \n\nHave a look at our dune dashboard and don’t hesitate to let us know if you need data wizards  support",
    "repost_text": "Some Wizards have already been hard at work and have created dashboards \n\nCheck out this Blockchain Overview Dashboard from\n@SixdegreeLab to gain an overview of what's happening on Base. \n\nhttps://dune.com/sixdegree/base-blockchain-overview…"
},
{
    "time": "2023-08-09T18:26:41.000Z",
    "tweet_text": "Still a ton of work ahead before we could plausibly claim anything close to that, but that is the goal. Thank you!",
    "repost_text": "Let’s take a moment to appreciate the novelty of a centralized public company launching decentralized public infrastructure. @coinbase is a mission-driven company and will likely go down as the most impactful company to push crypto mainstream. @BuildOnBase is to Web3 as the…"
},
{
    "time": "2023-08-09T16:53:36.000Z",
    "tweet_text": "Going live in about 7 minutes https://x.com/base/status/16/base/status/1689315339006574592…"
},
{
    "time": "2023-08-08T04:52:06.000Z",
    "tweet_text": "",
    "repost_text": "I just published a blog post about Lightning for those who haven’t checked in on it in a while. Huge thanks to @starkness, @RyanTheGentry, @davidmarcus, @stonecoldpat0, @therealkingonly, and @udiWertheimer for their feedback on it!\n\nhttps://link.medium.com/HpK7xeOI4Bb"
},
{
    "time": "2023-08-07T16:29:48.000Z",
    "tweet_text": "Brian Armstrong got a lot of shit for this at the time, but it turned out to be prescient. Almost all the most successful founders I know have quietly done something similar."
},
{
    "time": "2023-08-07T19:32:16.000Z",
    "tweet_text": "In partnership with @nounsprophouse, we’re distributing 100+ ETH in grants for those building and creating on Base this summer\n\nThere are four rounds of Prop House grants:\n\n① Onchain Summer (August 9 - 21): Make art, a website, or whatever you’re inspired to for Onchain Summer…"
},
{
    "time": "2023-08-07T16:48:14.000Z",
    "tweet_text": "minted",
    "repost_text": "now curating a #mints channel in the @coinbase slack\n\nMINT #001: Based by @0xLGHT\nhttps://zora.co/collect/base:0xc85f505b43fcbffbf7808a55bc4e8cecac18d85b…"
},
{
    "time": "2023-08-05T20:08:32.000Z",
    "tweet_text": "Amazing evening with with our Stand with Crypto advocates and friends. We had NY govt leaders come to hear from our community, and to share their insights. Lots of great interaction.  Thanks to @TechNYC for co-hosting.  http://standwithcrypto.com #standwithcrypto"
},
{
    "time": "2023-08-04T20:26:01.000Z",
    "tweet_text": "pretty crazy:\n- container ships burn fuels that emit a lot of sulfur\n- the sulfur seeds clouds, increasing the reflectivity of earth, cooling it\n- new climate rules in 2020 limit sulfur emissions by cargo ships\n- a lack of ship-clouds may explain anomalous heating this year",
    "repost_text": "Massively under-reported science story because there's so much going on right now but...it turns out that we might have figured out what's causing this very scary spike.\n\nQuick thread, on how WE'VE BEEN ACCIDENTALLY GEOENGINEERING FOR DECADES...but then we stopped:"
},
{
    "time": "2023-08-05T19:53:55.000Z",
    "tweet_text": "great to see base starting to show up in @TheBlock__ data \nhttp://theblock.co/data/scaling-solutions/optimistic-rollups…"
},
{
    "time": "2023-08-04T22:47:19.000Z",
    "tweet_text": "If you're a talented computational biologist interested in a transformative role, consider applying to @newlimit \n\nKey points:\n- $150m in funding committed\n- company started in 2022\n- searching for novel transcription factors to create epigenetic reprogramming therapies, at a…"
},
{
    "time": "2023-08-03T15:40:15.000Z",
    "tweet_text": "Coinbase marketing last six months or so has been consistently great.",
    "repost_text": "ᴏɴᴄʜᴀɪɴ  ꜱᴜᴍᴍᴇʀ\n\nIntroducing a first-of-its-kind festival, bringing you onchain art, music, games, food, and more.\nhttps://coinbase.com/blog/celebrate-onchain-summer-with-coinbase…"
},
{
    "time": "2023-08-04T03:34:55.000Z",
    "tweet_text": "Our CFO went live on Bloomberg TV rocking  earrings, after beating earnings expectations. Boss move "
},
{
    "time": "2023-08-04T15:31:26.000Z",
    "tweet_text": "A great read\n\n\"While securities represent investments in an issuer’s business, commodities are a company’s product.\"\n\n\"Before the SEC’s recent campaign against crypto, never in the 100-plus-year history of the concept had an output from a business been designated an “investment…",
    "repost_text": "Today, @coinbase filed our brief asking the Court to dismiss the SEC’s case against us. Our core argument is simple — we do not offer \"investment contracts\" as that term has been construed by decades of Supreme Court and other binding precedent. 1/3 https://assets.ctfassets.net/c5bd0wqjc7v0/7eaTxSOvCLrGR2frvCqS3Q/b98f952657b7bc821b218d1f601b9161/CoinbasevSEC12_c_Motion.pdf…"
},
{
    "time": "2023-08-03T18:29:54.000Z",
    "tweet_text": "I just minted Bridge to Base, celebrating the start of @BuildOnBase bringing billions of people onchain.\n\nIt’s Onchain Summer."
},
{
    "time": "2023-08-03T13:06:19.000Z",
    "tweet_text": "ᴏɴᴄʜᴀɪɴ  ꜱᴜᴍᴍᴇʀ\n\nIntroducing a first-of-its-kind festival, bringing you onchain art, music, games, food, and more."
},
{
    "time": "2023-08-02T18:30:11.000Z",
    "tweet_text": "Going live now",
    "repost_text": "https://twitter.com/i/spaces/1RDGlalvRDNJL…"
},
{
    "time": "2023-08-01T14:54:45.000Z",
    "tweet_text": "8/ And Levine laid out the SEC’s catch-22 perfectly:"
},
{
    "time": "2023-08-02T04:35:19.000Z",
    "tweet_text": "We’re looking into how to best add Lightning. It’s non-trivial, but I think worth doing. I’m all for payments taking off in Bitcoin.\n\nNot sure why you think we’re ignoring Bitcoin - we’ve onboarded more people to Bitcoin than probably any company in the world.\n\nLet’s build it…",
    "repost_text": "Why do you continue to ignore bitcoin and lightning?\n\nwhat \"crypto\" is a better money transmission protocol and why?"
},
{
    "time": "2023-07-12T15:01:37.000Z",
    "tweet_text": "So @BankofAmerica just closed my personal bank account that I’ve used for 15 years. No reason given.\n\nReal reason? I do Coinbase transactions through this account for Bitcoin.\n\nThis is a war on Bitcoin & crypto. Please RT to warn others. We won’t stay silent."
},
{
    "time": "2023-07-31T14:55:31.000Z",
    "tweet_text": "Welcome to O̵f̵f̵i̵c̵e̵ After Hours with me! Let’s clear up this confusion about securities, investment contracts and digital assets."
},
{
    "time": "2023-04-09T23:53:27.000Z",
    "tweet_text": "The Dissident's Guide to Philanthropy\n\nSolutions vs Subsidies: how entrepreneurs and people who love America should approach philanthropy in a society where many of the institutions are fundamentally broken."
},
{
    "time": "2023-07-30T18:57:18.000Z",
    "tweet_text": ".@SenWarren & @LindseyGrahamSC want a licensing body for tech companies, inspired by the Nuclear Regulatory Commission.\n\nStopping tech like the NRC stopped nuclear innovation is bad enough. It would also be a censorship weapon!\n\nMy @WSJ op ed on the “DCPC”"
},
{
    "time": "2023-07-30T13:20:58.000Z",
    "tweet_text": "Ghost in The Machine\n\nJH Kim joins the Chem Dept in Korea University in 1996, fresh faced, 24 years old. \n\nHe’s a synthesist, an experimental chemist of the old school. He believes the truth is in the making, and that you follow the truth even when it destroys your reality. \n\nHe…"
},
{
    "time": "2023-07-29T17:06:18.000Z",
    "tweet_text": "\"Use the advantages of youth when you have them, and the advantages of age once you have those. The advantages of youth are energy, time, optimism, and freedom. The advantages of age are knowledge, efficiency, money, and power. With effort you can acquire some of the latter when…"
},
{
    "time": "2023-07-28T07:41:56.000Z",
    "tweet_text": "Great news out of the House Financial Services Committee: sensible stablecoin legislation has made its way out of committee with bipartisan support and will now advance to the full House.",
    "repost_text": "#BREAKING: Chairman @PatrickMcHenry's Clarity for Payment Stablecoins Act passes the Financial Services Committee with BIPARTISAN support.\n\nAfter fifteen months of bipartisan collaboration, this landmark legislation is one step closer to becoming law."
},
{
    "time": "2023-07-28T20:27:13.000Z",
    "tweet_text": "Today, I sent a bipartisan letter to @Apple regarding iOS App Store policies and their impact on emerging technologies like blockchains and NFTs. Congress must understand if Apple's policies are limiting innovation and American technological leadership. \n\nFull letter below:"
},
{
    "time": "2023-07-28T21:20:00.000Z",
    "tweet_text": "As an ex-federal prosecutor, I know the massive flaws in our AML/KYC system. We spend >$40B each year on rules that have a 99% failure rate – and keep millions of legitimate customers from accessing financial services. It’s broken. \n\nWe need something better. Senators that…"
},
{
    "time": "2023-07-28T03:43:37.000Z",
    "tweet_text": "Huge",
    "repost_text": "Yet more congratulations to @PatrickMcHenry for getting the Clarity for Payment Stablecoins Act across the line with bipartisan support.  It’s been a historic week, and a big step forward for consumer protection. x.com/FinancialCmte/…"
},
{
    "time": "2023-07-27T16:03:30.000Z",
    "tweet_text": "THE FACEBOOK FILES, PART 1: SMOKING-GUN DOCS PROVE FACEBOOK CENSORED AMERICANS BECAUSE OF BIDEN WHITE HOUSE PRESSURE\n\n Thread:"
},
{
    "time": "2023-07-27T15:13:36.000Z",
    "tweet_text": "Americans deserve clarity for payment stablecoins and there has been good faith, bipartisan work to deliver that clarity.\n\nToday, Democrats are obstructing this good work at the behest of the White House.\n\nThe American people deserve better.",
    "repost_text": "Republicans have worked in good faith with RM Waters for more than 14 months on stablecoin legislation.\n\nNothing is being rushed.\n\nUnfortunately, Democrats would rather obstruct the Committee than participate in a real debate."
},
{
    "time": "2023-07-26T19:21:48.000Z",
    "tweet_text": "The status quo of crypto regulation by enforcement has failed retail customers.  \n\nEinstein once said: “If we do the same thing over and over again and expect a different result, that’s the definition of insanity.”\n\nIt’s time for Congress to bring sanity to crypto regulation."
},
{
    "time": "2023-07-27T04:18:22.000Z",
    "tweet_text": "Important action you can take to protect the value of your crypto in America:\n\nToday, two House committees started voting to take an important step on legislation that will create regulatory clarity for crypto. They will continue tomorrow. The bill will evolve during the…"
},
{
    "time": "2023-07-26T19:14:49.000Z",
    "tweet_text": "The next step for crypto is to make payments instant and free globally.\n\nThis will take lots of work from all of us, Coinbase included, getting layer 2's integrated, better on-ramps, simpler UX/onboarding, etc.\n\nA magic threshold would be getting the average payment under 1 cent…",
    "repost_text": "Welcome to the coffee shop of the future, where USDC payments are instant and gas-free with Coinbase Wallet.\n\nAnd where customers order seamlessly via messaging, powered by @XMTP_."
},
{
    "time": "2023-07-24T18:17:32.000Z",
    "tweet_text": "Applicants so far:\n- Led a Crypto forward project: 65\n- Founded and Sold Companies: 56\n- Developed a large social media audience: 43\n- Won chess tournaments, coding or video game competitions: 37\n- Researched and Discovered Breakthroughs: 24\n- Elite Armed Forces Experience: 22\n-…",
    "repost_text": "We created a VIP page to hire people with extraordinary ability @coinbase.\n\nIf you've shipped a popular open source library, built a large online following, won a math/eng/gaming competition, were part of a special forces unit, or built something awesome, say hello.…"
},
{
    "time": "2023-07-24T18:14:45.000Z",
    "tweet_text": "Was cool to see our History of Money campaign in DC last week. It's right in the subway where staffers (and member of congress!) commute every day.\n\nLet's finally get some bipartisan crypto legislation passed in the U.S.! It's time build in America."
},
{
    "time": "2023-07-20T15:34:43.000Z",
    "tweet_text": "“Every company needs to have someone asking why we can't launch next Monday instead of next month. Willing to accept and underwrite the risks needed to make it happen. And with a stomach for occasionally being wrong, eating the loss, but keep playing.”"
},
{
    "time": "2023-07-20T21:37:53.000Z",
    "tweet_text": "If we want to be taken seriously as a nation, we have to act seriously as a nation. This legislation would finally put the US into the global conversation on digital asset regulation. Congress should enact this without delay.",
    "repost_text": "BREAKING: The Financial Innovation and Technology for the 21st Century Act  was introduced today by @CongressmanGT, @RepFrenchHill and @RepDustyJohnson. \n\nThe bill establishes a regulatory framework for digital assets. \n\nHere is the full text \nhttps://agriculture.house.gov/uploadedfiles/fit_for_the_21st_century_act_of_2023.pdf…"
},
{
    "time": "2023-07-12T17:19:06.000Z",
    "tweet_text": "Wallet-to-wallet messaging is here."
},
{
    "time": "2023-07-20T18:19:48.000Z",
    "tweet_text": "Coinbase is striving to set an industry standard for safety and compliance in crypto. Pick up a copy of today’s @washingtonpost to learn more about our commitment to customers."
},
{
    "time": "2023-07-18T14:54:13.000Z",
    "tweet_text": " Needless to say, regulating digital assets through enforcement only had a dreadful day in court last week.\n\nIn the wake of the resounding decision out of the SDNY Ripple case, @SECGov must reassess its continued assault on the crypto industry.\n\nMy letter to Chair Gensler:"
},
{
    "time": "2023-07-18T23:01:25.000Z",
    "tweet_text": "We created a VIP page to hire people with extraordinary ability @coinbase.\n\nIf you've shipped a popular open source library, built a large online following, won a math/eng/gaming competition, were part of a special forces unit, or built something awesome, say hello.…"
},
{
    "time": "2023-07-18T22:38:13.000Z",
    "tweet_text": "Great talk from @pumatheuma Important to keep improving usability in crypto wallets."
},
{
    "time": "2023-07-16T13:53:02.000Z",
    "tweet_text": "Want to shout out @garrytan. Long time friend and collaborator ( and sometime competitor!). \n\nNot many in his position would have thrown themselves into shifting SF politics when there was very unclear reward for doing so - and had the impact he has had in a short time. \n\nOne of…"
},
{
    "time": "2023-07-16T18:19:49.000Z",
    "tweet_text": "On it",
    "repost_text": "bring back the swag store @coinbase x.com/coinbase/statu…"
},
{
    "time": "2023-07-15T16:58:18.000Z",
    "tweet_text": "onchain messaging is going to be a huge\n\nusing @CoinbaseWallet x @xmtp_ integration today and it's pretty wild to experience - it just works!"
},
{
    "time": "2023-07-15T17:57:39.000Z",
    "tweet_text": ".@BankofAmerica do you have an explanation for this? We will be reaching out",
    "repost_text": "Has @BankofAmerica closed your account due to transactions with @coinbase? Curious if this is the issue."
},
{
    "time": "2023-07-13T16:54:59.000Z",
    "tweet_text": " @SECGov is acting like an overzealous traffic cop arbitrarily ticketing drivers while keeping the speed limit a secret. \n\nIt prefers to communicate by enforcement rather than by rules or guidance. But that's no way to regulate digital assets.\n\nI'm calling for an investigation."
},
{
    "time": "2023-07-14T20:33:19.000Z",
    "tweet_text": "We’ve safely and legally offered staking for almost 4 years. We’ve  always followed legal process, and will do so here. These proceedings are just getting started - we’ll continue to defend everyone’s right to stake if and how they choose.",
    "repost_text": "1/ As you might have heard, on June 6, 10 US states initiated proceedings related to Coinbase’s retail staking services. Let’s dig into what this means for our customers."
},
{
    "time": "2023-07-14T20:34:21.000Z",
    "tweet_text": "#StandWithCrypto\nhttps://coinbase.com/standwithcrypto/signup…",
    "repost_text": "1/ As you might have heard, on June 6, 10 US states initiated proceedings related to Coinbase’s retail staking services. Let’s dig into what this means for our customers."
},
{
    "time": "2023-07-13T19:40:19.000Z",
    "tweet_text": "We've read Judge Torres' thoughtful decision. We've carefully reviewed our analysis.  It's time to relist.",
    "repost_text": "Coinbase will re-enable trading for XRP (XRP) on the XRP network. Do not send this asset over other networks or your funds may be lost. Transfers for this asset remain available on @Coinbase & @CoinbaseExch in the regions where trading is supported."
},
{
    "time": "2023-07-12T22:05:27.000Z",
    "tweet_text": "We have responded to the SEC’s statement of intent to move to strike Coinbase’s defenses rooted in the major questions doctrine, abuse of discretion, equitable estoppel, unclean hands, and laches.  We look forward to addressing the Court tomorrow morning."
},
{
    "time": "2023-07-12T15:25:19.000Z",
    "tweet_text": "1/ Today, the @BlockchainAssn submitted a letter to the SEC’s Inspector General calling for an investigation into the circumstances surrounding Prometheum.\n\nAlthough there may not be anything nefarious, suspicious circumstances beg someone to look under the hood…\n\nKey Qs "
},
{
    "time": "2023-07-13T02:19:09.000Z",
    "tweet_text": "Any other @BankofAmerica customers seeing this? If so, not ok.\n\nSee poll below",
    "repost_text": "So @BankofAmerica just closed my personal bank account that I’ve used for 15 years. No reason given.\n\nReal reason? I do Coinbase transactions through this account for Bitcoin.\n\nThis is a war on Bitcoin & crypto. Please RT to warn others. We won’t stay silent."
},
{
    "time": "2023-07-13T02:20:41.000Z",
    "tweet_text": "Has @BankofAmerica closed your account due to transactions with @coinbase? Curious if this is the issue."
},
{
    "time": "2023-07-12T13:03:05.000Z",
    "tweet_text": "I've got something very exciting to announce: \n\nEntrepreneurs are heroes, and every hero needs a Sidekick "
},
{
    "time": "2023-07-10T21:17:02.000Z",
    "tweet_text": "Carstens:  “We don’t know who is using a $100 bill today…”\n\nYeah….and?\n\nWho on earth told you that politicians have the right to know a single thing about how people spend their money?"
},
{
    "time": "2023-07-11T15:07:38.000Z",
    "tweet_text": "Nicely done. We’ve got some efforts in the works to help organize more of this. Crypto will be a major issue in 2024 elections. #standwithcrypto",
    "repost_text": "(1/9) I recently attended a town hall hosted by my representative in the US House to ask a question about her position on crypto.\n\nThis was the first event of this kind I have ever participated in. I plan to do more things like this and I think we all should. "
},
{
    "time": "2023-07-10T20:33:03.000Z",
    "tweet_text": "Coolest thing I saw on chain this week was a lender giving a stranger a $35,000 loan at 12% APR using a Patek Phillipe as collateral\n\nBorrower sent the watch to an escrow company who then sent back an NFT that represents ownership of the watch\n\nBorrower then listed the NFT on…"
},
{
    "time": "2023-07-10T05:00:32.000Z",
    "tweet_text": "Many people don't realize - you can do advanced trading right inside the Coinbase app as well.\n\nhttps://advanced.coinbase.com",
    "repost_text": ":epic music plays:\nCoinbase Advanced got an upgrade:\n\n237 USDC trading pairs to access USD markets\nEarn up to 4% USDC rewards on your balance\nA dedicated UX that remembers your settings\nNavigate from spot trading to portfolio mgmt in 1 click\n\nhttp://advanced.coinbase.com"
},
{
    "time": "2023-07-10T04:15:58.000Z",
    "tweet_text": "See:\nhttps://docs.cloud.coinbase.com/intx/docs/welcome…",
    "repost_text": "WebSocket API is now available on Coinbase International Exchange offering low-latency messaging to clients.\n\nUsers now have flexibility to choose between REST, WebSocket, and FIX APIs: visit http://coinbase.com/international-exchange… to learn more."
},
{
    "time": "2023-07-07T21:15:02.000Z",
    "tweet_text": "After Coinbase gave notice of it intent to move to throw out their case, we consented to a few extra days for the SEC to explain why it intends to oppose. They’ve now filed and, sadly, it’s more of the same. 1/6"
},
{
    "time": "2023-07-03T12:56:52.000Z",
    "tweet_text": "Convinced another of my friend to sign up for #CoinbaseOne and daily buy $btc $eth without worrying about when to buy. He wants to invest $1000 in crypto a month, I told him to do $600 via daily buy and $400 at once on significant dip via #CoinbaseAdvanced, am I doing it right?"
},
{
    "time": "2023-07-01T14:41:08.000Z",
    "tweet_text": "How to Do Great Work: http://paulgraham.com/greatwork.html"
},
{
    "time": "2023-06-29T21:13:19.000Z",
    "tweet_text": "Kudos to the @coinbase events team for putting together such an incredible, high signal event! \n\n“Crypto is a technology that is needed to update the financial system” - @brian_armstrong ",
    "repost_text": "Institutional investors, policymakers, academics & media united at our #StateofCrypto Summit to discuss the developments that are propelling the crypto industry forward.\n\nWant the details? Insights from the event & recordings of the panels are here: https://coinbase.com/blog/insights-from-the-state-of-crypto-summit…"
},
{
    "time": "2023-06-28T15:40:46.000Z",
    "tweet_text": "The rest of the world is moving to adopt #crypto—from the EU and other parts of Europe to regional powers like Brazil, Japan, and Australia, to diversifying economies like the UAE. And, of course, China via Hong Kong. \n \nWhat's it going to take for the U.S. to step up?"
},
{
    "time": "2023-06-29T04:20:02.000Z",
    "tweet_text": "Today @coinbase filed our answer and notice of intent to file a motion to dismiss the @SECGov case against us. You can read our response for yourself – our arguments speak for themselves. 1/2 https://assets.ctfassets.net/c5bd0wqjc7v0/4oVJN5EioULD0QnSyg01b8/2b1f34594a800c727fb61a384f37e74a/SEC_v._Coinbase__Coinbase_Answer_to_Complaint__As-Filed_.pdf…"
},
{
    "time": "2023-06-28T13:21:26.000Z",
    "tweet_text": "You can hear the words «Green Needle» or «Brainstorm» only based on which one you think about.\n\nThis is an auditory illusion, or a false perception of a real sound\n\n[explanation: https://buff.ly/3ItCQfg]"
},
{
    "time": "2023-06-28T18:39:12.000Z",
    "tweet_text": "No, seriously— what’s it gonna take?",
    "repost_text": "The rest of the world is moving to adopt #crypto—from the EU and other parts of Europe to regional powers like Brazil, Japan, and Australia, to diversifying economies like the UAE. And, of course, China via Hong Kong. \n \nWhat's it going to take for the U.S. to step up?"
},
{
    "time": "2023-06-28T18:53:10.000Z",
    "tweet_text": "Big news from Canada.\n\nCanadian lawmakers have published a comprehensive report supporting blockchain technology.\n\nLearn more: http://coinbase.com/blog/canadian-lawmakers-back-blockchain-with-landmark-recommendations…"
},
{
    "time": "2023-06-27T22:56:58.000Z",
    "tweet_text": "It's really crazy that Apple will unilaterally block you from running the software you want on your own device.\n\nOne of the most disrespectful parts of their culture, and it's damaging to their brand.",
    "repost_text": "Removed from the App Store for enabling tipping to everyone in the world without the need for a bank, payment card, or government permission.\n\nhttps://appleinsider.com/articles/23/06/26/decentralized-twitter-rival-damus-will-be-removed-from-the-app-store-over-bitcoin-tipping…"
},
{
    "time": "2023-06-27T17:41:08.000Z",
    "tweet_text": "crypto winter\n\nBuilder Spring\n\nONCHAIN SUMMER"
},
{
    "time": "2023-06-26T22:59:27.000Z",
    "tweet_text": "The U.S. is squandering an early lead, in part because SBF embarrassed some politicians and regulators who now want to look tough on crypto. Pretty much everyone else has moved on though, and FTX is not really discussed in UK, UAE, etc.\n\nThe way to solve it is just get sensible…",
    "repost_text": "Greetings from #Tokyo where headline in ⁦@japantimes⁩ says exactly what I’m hearing across #APAC re: #US official policy on #Crypto"
},
{
    "time": "2023-06-22T19:09:13.000Z",
    "tweet_text": "Vibe check: Coinbase’s summit has a lot of attendees in suits, giving an institutional feel, compared to other crypto conferences which usually has people in hoodies and shorts.\n\nAnd lots of convos outside, but auditorium is actually filled with people listening to panels."
},
{
    "time": "2023-06-26T03:12:44.000Z",
    "tweet_text": "Economic freedom remains an important measure of every country's potential for growth and prosperity. And increasing economic freedom is Coinbase's mission.\n\nThe U.S. unfortunately has fallen in economic freedom rankings over the years https://reason.com/2023/06/21/economic-freedom-is-declining-in-the-u-s/…\n\nHT @FEhrsam"
},
{
    "time": "2023-06-26T03:16:50.000Z",
    "tweet_text": "Here are the 2023 rankings"
},
{
    "time": "2023-06-26T03:20:51.000Z",
    "tweet_text": "This is a post I wrote a while back on why I believe cryptocurrency is the most important technology we have to increase economic freedom in the world\n\nhttps://medium.com/the-coinbase-blog/how-digital-currency-will-change-the-world-310663fe4332…\n\nFurther reading/watching:\nhttps://youtube.com/watch?v=9aY94yJ3d3w…\nhttps://coinbase.com/blog/how-crypto-enables-economic-freedom…"
},
{
    "time": "2023-06-25T03:54:03.000Z",
    "tweet_text": "… and AI safety is the new woke",
    "repost_text": "Cancel culture is over"
},
{
    "time": "2023-06-23T19:21:32.000Z",
    "tweet_text": "Hong Kong decides to adopt crypto into its financial system late last year. In under 8 months they have rules in place and a regulator committed to working constructively with the industry. The race to lead on crypto is on even if the US government isn’t paying attention.",
    "repost_text": "Hong Kong  is ready to lead in crypto. Had a great meeting w/ the SFC — HK's regulator for crypto — during @gemini's world tour. Very encouraged w/ their thoughtful & clear approach. Many imp industry players making HK home and a vibrant ecosystem is developing here. Exciting!"
},
{
    "time": "2023-06-22T20:22:52.000Z",
    "tweet_text": "OH at @coinbase #StateofCrypto 2023 Summit in NYC:  “this is like one giant group hug” \n\nJust what the industry needed right now . Great day of programming & convo!"
},
{
    "time": "2023-06-21T21:46:51.000Z",
    "tweet_text": "App Chains are not new. The difference in 2023 is that they are coming to EVM, where the majority of users + integrations (wallet, validator, bridge, node) support. Optimism’s OP Stack @optimismFND  is open-source and allows any project/team to launch their own roll-up chain. In…"
},
{
    "time": "2023-06-22T15:07:44.000Z",
    "tweet_text": "Coinbase's CEO @brian_armstrong on the future of crypto at #StateofCrypto summit: \n \n\"America is going to get this right.\n\nThis is a land of technology innovation.\n\nIt’s going to be a legal and regulated business.\""
},
{
    "time": "2023-06-22T15:14:28.000Z",
    "tweet_text": "For the last 12 months I’ve been working on a book. I’m excited to talk about it for the first time today. \n\nRead Write Own: Building the Next Era of the Internet (March 2024, publisher: Random House)\n\nPre-order here: https://readwriteown.com"
},
{
    "time": "2023-06-22T13:11:42.000Z",
    "tweet_text": "NEW REPORT \n\n52% of Fortune 100 companies have pursued crypto and blockchain projects since the start of 2020, according to a report by Coinbase conducted in partnership with The Block Research."
},
{
    "time": "2023-06-20T16:01:57.000Z",
    "tweet_text": "We are excited to release Reth v0.1.0-alpha! \n\nReth is a modular, contributor-friendly, and blazing-fast Ethereum node, in Rust, using the Apache/MIT license.\n\nLet's unpack what is behind today's release."
},
{
    "time": "2023-06-20T15:11:48.000Z",
    "tweet_text": "Last week, our head of Cryptography @LindellYehuda released an illuminating whitepaper on how @coinbase Wallet-as-a-Service leverages Multiparty Computation to achieve best-in-class usability and security amongst non-custodial web3 wallet APIs...\n\n"
},
{
    "time": "2023-06-22T01:37:15.000Z",
    "tweet_text": "",
    "repost_text": "The Third Circuit just ruled that it will retain jurisdiction over our challenge to the SEC's inaction on our petition for basic rules for crypto. A further report is due in 120 days. We are grateful that the Court will continue to shine a bright light on an SEC process that…"
},
{
    "time": "2023-06-20T18:05:31.000Z",
    "tweet_text": "It’s almost like rating agencies are reprimanding the Gensler approach.\nA country that lauds capitalism can’t afford to not have a crypto policy that isn’t “let’s shut the whole thing down”"
},
{
    "time": "2023-06-17T14:43:23.000Z",
    "tweet_text": "One of the requirement of being the global reserve currency and having the most dominant capital markets is an expectation of predictability.\n\nFor decades, people have trusted the dollar and US debt/equity markets because they trust our monetary policy and legal system, and the…"
},
{
    "time": "2023-06-18T21:03:55.000Z",
    "tweet_text": ".@haydenzadams is a great builder",
    "repost_text": "Long thread, no TLDR:\n\nThroughout Uniswap's history, there have been many moments that upset people\n\nRaising VC funding, adding fee switch to v2, not having a token, having a token, criticizing Nomi days before he rugged, blocking certain tokens in the UI, geoblocking OFAC…"
},
{
    "time": "2023-06-17T01:30:14.000Z",
    "tweet_text": "We couldn't wait until our deadline next week to address the SEC's response to the June 6 order from the Third Circuit.  It is unusual for the government to defy a direct question from a federal court. But the SEC’s evasive response goes further, as we set out today. 1/5"
},
{
    "time": "2023-06-16T03:55:31.000Z",
    "tweet_text": "Actually a pretty good song too.",
    "repost_text": "NEW REMIX\n\nGary Gensler, Brad Sherman and Prometheum\n\nhttp://songaday.world/auction/5279\nbid on the NFT of this song"
},
{
    "time": "2023-06-15T20:52:22.000Z",
    "tweet_text": "We don't even have clarity from our government on whether ETH is a security.  One regulator says no, another regulator say yes, and yet another refuses to answer the question even testifying before Congress. It's way past time to fix that.",
    "repost_text": "“One way or the other. We're going to get clarity,” @coinbase CLO @iampaulgrewal says about the recent @SECGov allegations against the exchange.\n\n“For Coinbase and for the industry, that's a win in and of itself.”  \n\nWatch more, presented by @trondao: https://coindesk.com/video/coinbase-chief-legal-officer-on-sec-lawsuit/?term=organic&utm_campaign=CoinDesk&utm_content=coindesk+tv%2CStateofCrypto%2CFirst+Mover%2Ccdtv%2Ceditorial&utm_medium=social&utm_source=twitter…"
},
{
    "time": "2023-06-11T13:34:26.000Z",
    "tweet_text": "Something I learned about @coinbase that I didn’t know that increases my respect for them is that they acquired a broker-dealer license and it remains dormant.  Many companies in the blockchain space pretend like they are trying to be compliant."
},
{
    "time": "2023-06-15T20:00:34.000Z",
    "tweet_text": "We @BoostVC are excited to work with @brian_armstrong @joycesticks on the intersection of open source, science and crypto - @ResearchHub.\n\nCongrats on the raise! Now let's get scientists PAID! \n\nRead more from the team: https://researchhub.com/post/979/researchhub-raises-5m-to-help-scientists-monetize-their-research…"
},
{
    "time": "2023-06-15T14:59:56.000Z",
    "tweet_text": "Today, @BlockchainAssn sent a FOIA request to the SEC seeking documents related to its dealings with Prometheum.\n\nThis whole story—Prometheum's ATS, its CEO's testimony in Congress—makes no sense.\n\nSomething fishy is going on here. @MTCoppel and I will get to the bottom of it ",
    "repost_text": "1/ Today @BlockchainAssn FOIA'd the SEC seeking information (docs & comms) about Prometheum and the ATS.\n\nIn the midst of aggressive SEC enforcement, Prometheum gets approval for first-of-its-kind Special Purpose Broker-Dealer (SPBD) for digital asset securities. \n\nSuspicious…"
},
{
    "time": "2023-06-15T00:27:18.000Z",
    "tweet_text": " \n@PrometheumInc has FIL and FLOW in their trading system. The SEC says FIL and FLOW are unregistered securities."
},
{
    "time": "2023-06-15T21:32:49.000Z",
    "tweet_text": "",
    "repost_text": "The FT story on Hong Kong regulators pressuring banks to onboard crypto companies is revealing on two fronts. The first is the obvious one, China is pivoting hard into crypto."
},
{
    "time": "2023-06-14T19:17:58.000Z",
    "tweet_text": "This Prometheum storyline has got to be the strangest thing I have seen in awhile in this industry. Has anyone actually looked into this? Beyond bizarre…"
},
{
    "time": "2023-06-15T18:13:03.000Z",
    "tweet_text": "Congrats to @joycesticks and the whole @researchhub team!\n\nGreat progress on accelerating science",
    "repost_text": ".@ResearchHub, the startup co-founded by @coinbase CEO Brian Armstrong, has raised $5 million in funding led by @OSSCapital. @IanAllison123 reports.\nhttps://trib.al/kz30hYZ"
},
{
    "time": "2023-06-14T00:19:24.000Z",
    "tweet_text": "Coinbase: we gonna IPO\n\nSEC: you good\n\nSEC: jk we suing you \n\nCoinbase: for what?\n\nSEC: not telling you\n\nCoinbase: wtf\n\nSEC: unregistered securities \n\nCoinbase: which ones?\n\nSEC: not telling you\n\nCoinbase: THEN HOW CAN YOU SUE US? USA can you deal with this?\n\nSEC: ok like Ada and…"
},
{
    "time": "2023-06-15T17:28:12.000Z",
    "tweet_text": "",
    "repost_text": "What’s going on with the No10 door?\n\nWell..."
},
{
    "time": "2023-06-13T22:10:35.000Z",
    "tweet_text": "A few minutes ago, the SEC filed its response to the last week's Third Circuit. You can read it for yourself below together with my own initial read of it. 1/5"
},
{
    "time": "2023-06-13T12:50:09.000Z",
    "tweet_text": "For the SEC to sue @chrislarsensf and me personally for allegedly selling unregistered securities when their own Division Head deliberately created confusion about this…well, I don’t have a single polite word to describe this deplorable, politically-motivated overreach."
},
{
    "time": "2023-06-12T00:07:37.000Z",
    "tweet_text": "The contrast between Prime Minister Sunak’s and President Biden’s position on crypto is mind-boggling. The decision of this administration to alienate crypto in the US will be remembered as a generational policy blunder, costing billions of dollars in lost economic output.",
    "repost_text": "Statement from UK prime minister Rishi Sunak on a16z’s expansion to the UK:  x.com/cdixon/status/…"
},
{
    "time": "2023-06-10T14:10:29.000Z",
    "tweet_text": "In 2018, an Amazon employee shared the company’s “7 Tips for Business Writing.”\n\nThey’re a must-read for anyone who wants to write more clearly.\n\n1. Use fewer than 30 words per sentence\n\nConstraints drive clear thinking.\n\nAnd the best constraints force you to use less words, not…"
},
{
    "time": "2023-06-11T22:54:19.000Z",
    "tweet_text": "A 10 year-long registration process with no end in sight! https://x.com/twobitidiot/st/twobitidiot/status/1667702194877898752…"
},
{
    "time": "2023-06-11T23:58:33.000Z",
    "tweet_text": "Statement from UK prime minister Rishi Sunak on a16z’s expansion to the UK:"
},
{
    "time": "2023-06-11T23:05:10.000Z",
    "tweet_text": "The UK Prime Minister & policymakers across both parties see the promise of web3 and are committed to putting the right regulation and guardrails in place to protect consumers, foster innovation, and allow start-ups to flourish there. We’re excited to help them with this effort."
},
{
    "time": "2023-06-11T23:05:09.000Z",
    "tweet_text": "Big news to share: @a16z is expanding to the UK \n\nWe plan to open our first international office in London later this year, and will host the next Crypto Startup School there in 2024.\n\nWhy the UK? \nhttps://a16zcrypto.com/posts/announcement/expanding-uk-andreessen-horowitz…"
},
{
    "time": "2023-06-10T21:49:43.000Z",
    "tweet_text": "Full WSJ interview on YouTube"
},
{
    "time": "2023-06-10T21:51:01.000Z",
    "tweet_text": "Adds important detail that was edited out of the shorter version"
},
{
    "time": "2023-06-09T22:37:50.000Z",
    "tweet_text": "Justice Gorsuch from a case last week: \n\n\"Naturally, Congress remains free to revise the securities laws at any time, whether to address the rise of direct listings or any other development. Our only function lies in discerning and applying the law as WE find it.\" (emph. added)"
},
{
    "time": "2023-06-09T14:59:55.000Z",
    "tweet_text": "GM to everyone!\n\nJust minted my 'Stand With Crypto' NFT in support of @coinbase 's efforts to back sensible crypto regulations in the USA and fight against attacks by the SEC.\n\n#StandWithCrypto. "
},
{
    "time": "2023-06-09T20:02:11.000Z",
    "tweet_text": "",
    "repost_text": "America faces an enormous opportunity to be the home for the next chapter of financial and technological innovation. Setting clear ground rules will pave the way.\n\nhttp://coinbase.com/whycrypto"
},
{
    "time": "2023-06-08T23:48:30.000Z",
    "tweet_text": "If you're in NYC head over to Wall Street to see our History of Money exhibit across the street from the @NYSE, which couldn't be more timely.\n\nMoney is not static - it has continually been improved over time - and crypto is the most important technology we have to update the…"
},
{
    "time": "2023-06-08T14:45:16.000Z",
    "tweet_text": "Community Notes is quickly becoming my favorite feature on Twitter "
},
{
    "time": "2023-06-07T22:22:43.000Z",
    "tweet_text": "Smart take from @RitchieTorres"
},
{
    "time": "2023-06-07T19:15:33.000Z",
    "tweet_text": "Great to have @USTreasury engaged on the good work being done on the Hill on legislation. Final enactment will take time, but the Biden Admin's engagement is critical."
},
{
    "time": "2023-06-07T00:52:45.000Z",
    "tweet_text": "I will continue to build at @coinbase -\n\nIn a bear market, against bad faith regulatory pressure, with the press against us, and even when there are easier jobs out there - \n\nBecause I believe in increasing economic freedom in the world through secure, decentralized systems. ",
    "repost_text": "Crypto has come a long way. \nIn America, it still has far to go. \nWe're ready.  x.com/brian_armstron…"
},
{
    "time": "2023-06-07T19:15:38.000Z",
    "tweet_text": "Potential proxy for crypto utility as well",
    "repost_text": "Active addresses were at all time highs last month.\n\nCheck out all the updated data at https://a16zcrypto.com/stateofcrypto/"
},
{
    "time": "2023-06-06T17:00:40.000Z",
    "tweet_text": "The @SECGov is weaponizing their role to kill an industry. Allowing a company to list publicly and then stonewalling their attempts to register is indefensible. \n\n@GaryGensler, expect to hear from Congress."
},
{
    "time": "2023-06-06T20:32:18.000Z",
    "tweet_text": "My statement on the SEC suing Coinbase, inc."
},
{
    "time": "2023-06-06T17:31:52.000Z",
    "tweet_text": "The numbers don't lie."
},
{
    "time": "2023-06-06T16:13:09.000Z",
    "tweet_text": "Why AI Will Save The World -- my new megapost on why you should be excited, not scared, about AI. Enjoy!"
},
{
    "time": "2023-06-06T14:39:51.000Z",
    "tweet_text": "1/20\n\nBreakdown of the SEC Coinbase complaint:\n\nAdvocates that since 2019 it's been an unregistered broker (odd year to pick?)\n\nWhat changed in 2019 versus prior years?\n\nAlso claims its a clearing agency - which is a stretch here."
},
{
    "time": "2023-06-06T17:05:09.000Z",
    "tweet_text": "Regarding the SEC complaint against us today, we're proud to represent the industry in court to finally get some clarity around crypto rules.\n\nRemember:\n1. The SEC reviewed our business and allowed us to become a public company in 2021.\n2. There is no path to \"come in and…"
},
{
    "time": "2023-06-01T22:47:18.000Z",
    "tweet_text": "OH: The GPU shortage is basically irl version of „you must construct additional pylons“"
},
{
    "time": "2023-06-01T20:39:18.000Z",
    "tweet_text": "1/ On June 5, Coinbase Derivatives Exchange, our CFTC-regulated futures exchange, will launch BTC and ETH futures contracts for institutions.\n\nHere's what we've built :"
},
{
    "time": "2023-06-01T17:28:57.000Z",
    "tweet_text": "Shot: A 9-0 Supreme Court win today for a traceability requirement for Section 11 claims. \n\nChaser: a 9-0 Supreme Court warning to agencies and others that the federal securities laws are not just whatever they want them to be— limits imposed by Congress matter."
},
{
    "time": "2023-05-31T19:54:11.000Z",
    "tweet_text": "This is a monumentality important development in the AI copyright battle - first precedent is set\n\nhttps://technomancers.ai/japan-goes-all-in-copyright-doesnt-apply-to-ai-training/…"
},
{
    "time": "2023-05-31T03:59:04.000Z",
    "tweet_text": "From today, $USDC sends on @CoinbaseWallet are\n Free\n Instant\n Global\n Permissionless\n\nOn @0xPolygon, with more networks coming soon.\n\nThis is the best UX for the digital dollar",
    "repost_text": "Send USDC, Gas-Free\n\nIntroducing gas-free USDC sends on Coinbase Wallet! Send USDC on @0xPolygon without worrying about network fees.\n\nUSDC makes it easier than ever to move money. Experience instant payments, free from constraints on cross-border transfers."
},
{
    "time": "2023-05-29T18:02:41.000Z",
    "tweet_text": "Last night, Jensen Huang of NVIDIA gave his very first live keynote in 4-years.\n\nThe most show-stopping moment from the event was when he showed off the real-time AI in video games. A human speaks, the NPC responds, in real time and the dialogue was generated with AI on the fly."
},
{
    "time": "2023-05-30T20:00:27.000Z",
    "tweet_text": "In today's @MarketWatch I'm sharing an op-ed encouraging policymakers to see the big picture with crypto. It's important for American technology leadership and national security that this industry be built (at least in part) in America."
},
{
    "time": "2023-05-30T19:37:58.000Z",
    "tweet_text": "Pretty awesome trip down memory lane looking at our old @coinbase blog https://coinbase.tumblr.com (on Tumblr!)\n\nYou can see even back in 2015 we were busy getting licenses, exploring new use cases (tip button!), getting merchants signed up (too early on many of these), etc. Ten year…"
},
{
    "time": "2023-05-30T19:10:45.000Z",
    "tweet_text": "",
    "repost_text": "1/3 Take a look below at what the SEC told a federal court last week when it claimed that it \"continues to consider\" our petition for rules for crypto. Then look at what the Chair told the Fed in public remarks on the very same day. It's impossible to square these statements."
},
{
    "time": "2023-05-30T16:26:08.000Z",
    "tweet_text": "The @SECGov just entered a proposed settlement in their case against Ishan Wahi, the former Coinbase employee, which is a complete surrender and shows the weakness in the SEC's theories about secondary market trading of crypto \n\nThis is a meaningful development for the industry"
},
{
    "time": "2023-05-30T15:15:55.000Z",
    "tweet_text": "Great point\n\nSame for non-profits",
    "repost_text": "1/ On Governments & Public Blockchains\n\nWe spend so much timing talking about what stupid things governments should NOT do with blockchains, that we often forget to discuss what they SHOULD do\n\nGovernments should mandatorily use blockchains for their own spending"
},
{
    "time": "2023-05-27T06:35:06.000Z",
    "tweet_text": "Wow, nice trip down memory lane ",
    "repost_text": "In 2012, @brian_armstrong applied to YC with his company \"Bitbank\".\n\nHis OG bitcoin side project is now an essential part of the crypto ecosystem.\n\nI went through 5,000+ tweets from the @coinbase account.\n\nThe first tweet was on May 19th, 2012!\n\nHere are the most iconic ones:"
},
{
    "time": "2023-05-25T18:37:00.000Z",
    "tweet_text": "A 30% tax hike on any specific industry is a blatant attempt by the administration to pick winners and losers.\n\nI will not let President Biden tax the digital asset industry out of existence."
},
{
    "time": "2023-05-25T22:10:49.000Z",
    "tweet_text": "We are excited to share that we have received the FDA’s approval to launch our first-in-human clinical study!\n\nThis is the result of incredible work by the Neuralink team in close collaboration with the FDA and represents an important first step that will one day allow our…"
},
{
    "time": "2023-05-25T18:58:51.000Z",
    "tweet_text": "Well said",
    "repost_text": "The most common criticism we hear about crypto is simple: Where are the real-world use cases?\n\nIn our latest report, we take this head-on. Discover how millions of people are already using crypto services—and in a wider range of ways than most realize. https://bit.ly/3ZIDxcH"
},
{
    "time": "2023-05-24T23:43:21.000Z",
    "tweet_text": "BREAKING: Governor @RonDeSantis on how he would treat #crypto if he becomes president: \n\n“People in Washington don’t like it because they don’t control it. And they’re central planners and they want to have control over society, so Bitcoin represents a threat to them and so…"
},
{
    "time": "2023-05-24T19:10:31.000Z",
    "tweet_text": "Early days.\n\nOnce layer 2 really gets going, it will be like going from dial up to broadband.",
    "repost_text": "Good crypto usage data by @federalreserve .\nThis debunk the myth of crypto being useless even in the US.\nhttps://federalreserve.gov/publications/files/2022-report-economic-well-being-us-households-202305.pdf…"
},
{
    "time": "2023-05-24T19:10:58.000Z",
    "tweet_text": "Decentralized identity, better UX around bridging/swapping, smart contract based checkout, all the pieces coming together slowly but surely."
},
{
    "time": "2023-05-24T03:26:41.000Z",
    "tweet_text": "True",
    "repost_text": "The Freedom To Innovate https://avc.com/2023/05/the-freedom-to-innovate/…"
},
{
    "time": "2023-05-22T17:17:31.000Z",
    "tweet_text": "We’re running a TV campaign in DC this week to explain why crypto is the most important technology America has to update the financial system.\n\nLots of policy work to do to ensure America isn’t left behind."
},
{
    "time": "2023-05-20T15:56:07.000Z",
    "tweet_text": "8 years public today. Went OK I think.",
    "repost_text": "Today marks 8yrs since @Shopify IPO'd - forever one of the greatest highlights of my career.\n\n4 things I knew then that are still true today:\n1. Shopify isn't just taking a piece of the pie - we are growing the pie itself\n2. Life is short - build impactful sh*t\n3. Entrepreneurs…"
},
{
    "time": "2023-05-20T17:04:23.000Z",
    "tweet_text": "On friendship "
},
{
    "time": "2023-05-19T18:09:39.000Z",
    "tweet_text": "JUST IN:  Robert F. Kennedy Jr. becomes first presidential candidate to accept #Bitcoin campaign donations."
},
{
    "time": "2023-05-19T17:50:09.000Z",
    "tweet_text": "1/ Did Scientists Accidentally Invent an Anti-addiction Drug?\n\nPeople taking Ozempic for weight loss say they have also stopped drinking, smoking, shopping, and even nail biting."
},
{
    "time": "2023-05-18T23:12:50.000Z",
    "tweet_text": "Become a Coinbase One subscriber to get zero trading fees, better rates on staking, and priority support.\n\nIt also supports us in our efforts to get regulatory clarity for the industry in the U.S.\n\nhttps://coinbase.com/one",
    "repost_text": "1/"
},
{
    "time": "2023-05-18T19:39:44.000Z",
    "tweet_text": "Consumer-friendly apps drive onchain actions."
},
{
    "time": "2023-05-18T23:03:32.000Z",
    "tweet_text": "Yes - we have good custodial and self-custodial apps.",
    "repost_text": ""
},
{
    "time": "2023-05-18T14:30:56.000Z",
    "tweet_text": "#WATCH: Chairman @RepFrenchHill at today's stablecoin hearing:\n\n\"Without action from Congress ... stablecoin issuers will not feel confident to build their projects in the U.S.\"\n\nRead more  \nhttps://financialservices.house.gov/news/documentsingle.aspx?DocumentID=408801…\n  Watch his full remarks "
},
{
    "time": "2023-05-18T19:48:43.000Z",
    "tweet_text": "More USDC trading pairs means a faster and more rewarding Advanced Trade experience. \n\nSee what else is coming soon to the platform. "
},
{
    "time": "2023-05-18T15:30:31.000Z",
    "tweet_text": "EXCLUSIVE: @Coinbase launches subscription service with focus on European expansion, starting with US, UK, Germany and Ireland"
},
{
    "time": "2023-05-18T18:25:51.000Z",
    "tweet_text": "One of the strengths of @coinbase is that our strongest technical talent is genuinely curious and thoughtful about law and policy. @yugacohler’s summary of the Chair’s comments is yet another example.",
    "repost_text": "In the most recent episode of Odd Lots with @TheStalwart and @tracyalloway, CFTC Chair Rostin Behnam made clear just how stark the differences in approach to crypto regulation are between his agency and Gary Gensler's SEC.\n\nHere are the five takeaways:"
},
{
    "time": "2023-05-18T18:07:27.000Z",
    "tweet_text": "In the most recent episode of Odd Lots with @TheStalwart and @tracyalloway, CFTC Chair Rostin Behnam made clear just how stark the differences in approach to crypto regulation are between his agency and Gary Gensler's SEC.\n\nHere are the five takeaways:"
},
{
    "time": "2023-05-17T14:36:36.000Z",
    "tweet_text": "Improving trading for people around the world"
},
{
    "time": "2023-05-16T15:32:02.000Z",
    "tweet_text": "We're excited to announce that we've raised our Series A from @_DimensionCap, @foundersfund, & @kleinerperkins"
},
{
    "time": "2023-05-16T22:54:17.000Z",
    "tweet_text": "Coinbase is fighting a battle that will impact the industry for generations to come. The industry must unite to win. We stand with you \n@brian_armstrong @iampaulgrewal",
    "repost_text": ".@coinbase is right. The @DigitalChamber firmly believes in fair policies that foster innovation and growth within the #digitalasset space. We stand in solidarity with Coinbase & urge the SEC to set clear rules to the road for our industry. Our statement: http://ow.ly/rWS450OptZ0"
},
{
    "time": "2023-05-16T16:53:16.000Z",
    "tweet_text": "SEC: Come in and register.\nCB: We’d like to register.\nSEC: You’re not allowed.\nCB: Why not?\nSEC: The rules are clear.\nCB: The rules don’t make sense.\nSEC: The rules are the rules.\nCB: Can they be adapted?\nSEC: Yes, but we don’t like your industry.\nCB: But you've adapted rules…"
},
{
    "time": "2023-05-11T14:39:04.000Z",
    "tweet_text": "New Druckenmiller (with slides):\n\n…https://uscmarshallweb.s3-us-west-2.amazonaws.com/assets/uploads/s1/files/keynote_speech_of_stan_druckenmiller_at_the_37th_usc_marshall_center_for_investment_studies_annual_meeting_may_1_2023_hdmqn6eb4m.pdf…"
},
{
    "time": "2023-05-09T14:58:47.000Z",
    "tweet_text": "A pleasure meeting Her Excellency SCA CEO Dr Maryam Al Suwaidi and His Excellency Ahmed Jasim Al Zaabi, Chairman ADGM.\n\nA welcome message: “We regulate through engagement, not enforcement”."
},
{
    "time": "2023-05-08T20:15:22.000Z",
    "tweet_text": "”Confrontation isn’t really the purpose. It’s frankly not even something I particularly enjoy. But I do think that there are moments when it’s important to simply be public about the disagreements we may have from time to time, and also be very clear that the disagreements are…"
},
{
    "time": "2023-05-09T07:20:32.000Z",
    "tweet_text": "Great meeting with H.E. Dr. Thani bin Ahmed Al Zeoudi, UAE Minister of State for Foreign Trade \n\nVery impressive what they’ve done on free trade in the region, and establishing UAE as a financial hub."
},
{
    "time": "2023-05-08T13:25:49.000Z",
    "tweet_text": "Thank you for hosting me @DIFC and for the great interview @ManusCranny",
    "repost_text": "Happening now at the @DubaiFinTechSum Plenary stage, a fire side-chat on on \"The Global Economic Storm\" - Join us! @InnovHubDIFC"
},
{
    "time": "2023-05-08T12:32:45.000Z",
    "tweet_text": "Great meeting with Minister of Economy H.E. Abdulla Bin Touq Al Marri in UAE @Economyae"
},
{
    "time": "2023-05-08T08:48:45.000Z",
    "tweet_text": "The UAE  deserves a lot of credit for being forward thinking on crypto. First dedicated crypto regulator in the world, a clear rule book published (!), business friendly plus strong customer protections. Really enjoying my visit so far."
},
{
    "time": "2023-05-08T08:42:17.000Z",
    "tweet_text": "8/ In UAE for a few days with the @Coinbase team and @barmstrong. Crypto and web3 serve as enormous opportunities for economic and technological diversification for the UAE, and the region has the potential to be a strategic hub for Coinbase. https://coinbase.com/blog/the-uae-recognising-the-transformative-potential-of-the-cryptoeconomy…"
},
{
    "time": "2023-05-06T16:56:07.000Z",
    "tweet_text": "Oops haven't tweeted too much recently; I'm mostly watching with interest the open source LLM ecosystem experiencing early signs of a cambrian explosion. Roughly speaking the story as of now:\n\n1. Pretraining LLM base models remains very expensive. Think: supercomputer + months.…"
},
{
    "time": "2023-05-06T16:00:19.000Z",
    "tweet_text": "US debt to GDP ratio over time. very scary chart; no plan to fix it or even much of an acknowledgement we need a plan.\n\nwill get made worse as the rest of the world finds alternatives to the USD and rates stay non-zero.\n\nlong-term brewing crisis."
},
{
    "time": "2023-05-03T23:06:37.000Z",
    "tweet_text": "The Third Circuit just issued a text-only order directing the SEC to file a response to our mandamus petition within 10 days (and gave us 7 days for a reply). Here’s the text of the order:\n\nTEXT ONLY ORDER (Clerk) At the direction of the Court, Respondent is ordered to file an…"
},
{
    "time": "2023-05-03T17:57:58.000Z",
    "tweet_text": "1/  If the SEC follows through on its threat to sue @Coinbase, I believe the SEC will lose.\n\nThe SEC's case has a fatal flaw.\n\nAnd the problem is entirely of @GaryGensler's own making.\n\nLet me explain..."
},
{
    "time": "2023-05-03T19:11:48.000Z",
    "tweet_text": "Wow - well said",
    "repost_text": "Cryptocurrencies, led by bitcoin, along with other crypto technologies are a major innovation engine. It is a mistake for the U.S. government to hobble the industry and drive innovation elsewhere. Biden’s proposed 30% tax on cryptocurrency mining is a bad idea. "
},
{
    "time": "2023-05-02T13:10:14.000Z",
    "tweet_text": "My latest: Coinbase launches international perps exchange — starting with 5x leverage"
},
{
    "time": "2023-05-02T08:04:46.000Z",
    "tweet_text": "This three minute masterclass by @ErikVoorhees on why fiat money is bad money is both hilarious and revealing. \n\nShare it with anyone who has no clue about money."
},
{
    "time": "2023-05-02T18:14:23.000Z",
    "tweet_text": "Great progress - lots of small details add up",
    "repost_text": "Our team at Coinbase has been hard at work making our experiences better for traders. \n\nIf you've been on Coinbase in the past few months, you should have noticed a huge difference in performance and features on web, mobile, and API. "
},
{
    "time": "2023-05-02T14:31:14.000Z",
    "tweet_text": "Coinbase will continue to innovate, build, and ship new products, no matter the regulatory climate. We will do so here in the U.S., and we will also do so globally.",
    "repost_text": "Today Coinbase launched Coinbase International Exchange @CoinbaseIntExch and will begin by offering BTC & ETH perpetual futures settled in USDC with up to 5x leverage to institutional clients in eligible jurisdictions outside of the U.S.\n\nhttps://coinbase.com/blog/introducing-coinbase-international-exchange…"
},
{
    "time": "2023-05-01T17:50:35.000Z",
    "tweet_text": "April was a pivotal month for crypto and @coinbase, and I’m so proud of the work we’ve done together\n\nWe’re putting in the blood, sweat, and tears to advocate for sensible crypto policies while also launching exciting new products to advance the ecosystem\n\nA few highlights "
},
{
    "time": "2023-05-02T02:05:20.000Z",
    "tweet_text": "now a coinbase one member\n\njust a lil thing to support @coinbase in their legal battles"
},
{
    "time": "2023-05-02T13:06:39.000Z",
    "tweet_text": "Today Coinbase launched Coinbase International Exchange @CoinbaseIntExch and will begin by offering BTC & ETH perpetual futures settled in USDC with up to 5x leverage to institutional clients in eligible jurisdictions outside of the U.S."
},
{
    "time": "2023-04-28T13:04:00.000Z",
    "tweet_text": " Is there a silver lining for crypto regulation? Law professor @JWVerret says there’s a doctrine that might save the day.\n\n Listen: https://unchainedcrypto.com/podcast/coinbases-legal-action-against-the-sec-how-it-will-likely-unfold/…"
},
{
    "time": "2023-04-28T10:44:43.000Z",
    "tweet_text": "Strong message from the top dog regulator in Hong Kong. This is going to unleash waves of offshore capital flowing back into . \n\nStrategic move especially with the demise of US crypto banks.   \n\nThe tide is indeed riding high in the East. LFG!"
},
{
    "time": "2023-04-28T20:14:16.000Z",
    "tweet_text": "We stand united with the crypto community in our effort to advocate for sensible crypto policy. So far, we've seen:\n\n 80K shield NFTs minted\n 40K sign-ups for #Crypto435\n 70K votes for pro-crypto legislation\n\nJoin the cause. Stand with crypto.\n http://coinbase.com/standwithcrypto"
},
{
    "time": "2023-04-28T04:41:06.000Z",
    "tweet_text": "The most recent episode of @BanklessHQ with @iampaulgrewal is ",
    "repost_text": "LIVESTREAM\n@coinbase is suing the @SECGov \n\nWe're going live w/ @iampaulgrewal, Coinbase's Chief Legal Officer to break it all down\n\nThis is set to be a watershed moment for the space.\n\nDon't miss this one.\n\nGet in the chat"
},
{
    "time": "2023-04-27T19:22:51.000Z",
    "tweet_text": "1/  Today we’re sharing our “Wells response” to the SEC. As part of our response, @iampaulgrewal and I sat down to explain why we’re confident in the facts and on the law, and why a Wells notice is not in the best interest of the US."
},
{
    "time": "2023-04-27T19:23:40.000Z",
    "tweet_text": "3/ If you care about clear crypto regulation, sign up for #Crypto435 to join nearly 40,000 other people from across all 435 Congressional Districts to make your voice heard on crypto policy."
},
{
    "time": "2023-04-27T19:23:50.000Z",
    "tweet_text": "4/ And mint your Stand with Crypto shield NFT."
},
{
    "time": "2023-04-27T18:56:06.000Z",
    "tweet_text": "Now up to 56,300 minted "
},
{
    "time": "2023-04-26T01:03:08.000Z",
    "tweet_text": "Wow",
    "repost_text": "The below clip is from a Fall 2018 Graduate MIT course called \"Blockchain and Money\"\n\nGary Gensler - the current President of the SEC, was the professor.  \n\nThe Hypocrisy speaks for itself \n\n\"So we already know in the US and in many other jurisdictions that 3/4 of the market…"
},
{
    "time": "2023-04-25T14:17:06.000Z",
    "tweet_text": "brought my 95yo grandparents to our “demo day” at the Senate:\n\n1. 50x cheaper remittances with stablecoins\n2. more empowered creators with NFTs \n3. sovereign onchain identity with @ENS_DAO \n4. stronger local economies with @oakcurrency \n\nif they can learn, so can our politicians."
},
{
    "time": "2023-04-24T21:29:37.000Z",
    "tweet_text": "1/ The community is clearly fired up about sensible crypto policy. Here’s how to continue the support \n: Mint a Stand With Crypto commemorative NFT\n: Add a shield emoji next to your Twitter display name \n http://coinbase.com/standwithcrypto"
}
]