[
{
    "time": "2024-04-28T01:07:05.000Z",
    "tweet_text": "The problem with “Great Replacement Theory” is that it fails to address the foundational issue of low birth rates.\n\nRecord low birth rates are leading to population collapse in Europe and even faster population collapse in most of Asia. Immigration is low in Asia, so there is no…",
    "repost_text": "Here it is! The full speech I gave at #CPACHungary that the establishment is losing its absolute mind about. \n\nI spoke the forbidden truth: The Great Replacement is no longer a theory - it’s reality. White Europeans are being replaced in their own countries at an ever…"
},
{
    "time": "2024-04-28T23:16:42.000Z",
    "tweet_text": "Falcon 9 takes flight from Florida, delivering 23 @Starlink satellites to low-Earth orbit"
},
{
    "time": "2024-04-28T22:11:05.000Z",
    "tweet_text": "Liftoff and ascent of Falcon 9"
},
{
    "time": "2024-04-29T02:15:49.000Z",
    "tweet_text": "If birth rates continue to plummet, human civilization will end"
},
{
    "time": "2024-04-28T22:17:53.000Z",
    "tweet_text": "Landing burn and touchdown on the Just Read the Instructions droneship"
},
{
    "time": "2024-04-28T18:58:32.000Z",
    "tweet_text": "Make comedy legal again!"
},
{
    "time": "2024-04-28T13:58:08.000Z",
    "tweet_text": "This would be crazy!",
    "repost_text": "Today, on the front page of ABC News, the government is canvassing a major expansion to the powers of the eSafety commissioner.\n\nABC is owned and funded by the Australian government. \n\nControl information, control language, control thought."
},
{
    "time": "2024-04-28T13:27:13.000Z",
    "tweet_text": "Honored to meet with Premier Li Qiang.\n\nWe have known each other now for many years, since early Shanghai days."
},
{
    "time": "2024-04-28T13:03:07.000Z",
    "tweet_text": "Model 3 Performance is epic"
},
{
    "time": "2024-04-28T05:51:58.000Z",
    "tweet_text": "After 36 days docked to the @space_station, the Dragon spacecraft supporting SpaceX’s 30th commercial resupply mission for @NASA will undock from the orbiting lab on Sunday, April 28th. Watch live beginning at 12:45 p.m. ET → http://nasa.gov/nasalive"
},
{
    "time": "2024-04-28T02:00:54.000Z",
    "tweet_text": "Falcon 9 launches from LC-39A in Florida"
},
{
    "time": "2024-04-28T00:44:58.000Z",
    "tweet_text": "This Falcon 9 first stage has launched ~200 spacecraft as part of our Rideshare program, supported 13 @Starlink missions to help connect people all around the world with high-speed, low-latency internet, sent a lunar lander to the Moon, and more. In total, this Falcon delivered…"
},
{
    "time": "2024-04-28T04:41:59.000Z",
    "tweet_text": "Add your podcast to 𝕏 for vastly greater viewership!",
    "repost_text": "E176 is LIVE on @X\n\nlots to cover on this one!\n\n(0:00) bestie intros: reservation tips!\n\n(5:20) $META goes scorched earth in AI, why the stock was down despite beating on earnings\n\n(22:20) $TSLA's roadmap: ranking the company's highest-upside bets outside of cars for the next 10…"
},
{
    "time": "2024-04-28T03:42:43.000Z",
    "tweet_text": "If you teach that “weak makes right”, then the perceived stronger party – in this case, Israel – is wrong.\n\nMorals should be taught in the absolute, meaning that it is possible for either the strong or weak to be morally good, depending on their actions."
},
{
    "time": "2024-04-28T03:12:08.000Z",
    "tweet_text": "An incredible epoch of aerospace",
    "repost_text": "66 years apart"
},
{
    "time": "2024-04-28T01:55:06.000Z",
    "tweet_text": "The Guardian is down by 2/3 since 2020"
},
{
    "time": "2024-04-28T01:49:36.000Z",
    "tweet_text": "Surely demanding overthrow of the government in Germany is illegal?",
    "repost_text": "BREAKING:\n\nHundreds of Islamists are demonstrating in Hamburg, Germany.\n\nThey are demanding that a caliphate is established in the country.\n\nThe organization behind the protest is called Muslim Interaktiv, and is monitored by the authorities but not banned"
},
{
    "time": "2024-04-28T01:48:01.000Z",
    "tweet_text": "He knows what he’s talking about",
    "repost_text": "7 years ago, the UAE’s Foreign Minister issued a warning to the West. \n\nHis words now sound prophetic."
},
{
    "time": "2024-04-28T00:13:59.000Z",
    "tweet_text": "As Cathie Wood states, Tesla is the biggest AI project on Earth",
    "repost_text": "Cathie Wood 9 days ago: \"Who is going to take the lions share of this market and its a winner takes most market\" \n\n\"We believe that that the entire opportunity is going to generate revenues of 8 to 10 Trillion Dollars in 2030. Half of which will go to platforms like Tesla.…"
},
{
    "time": "2024-04-27T15:15:24.000Z",
    "tweet_text": "If you're a web user, I strongly recommend trying 𝕏-Pro; it's an incredible tool."
},
{
    "time": "2024-04-27T19:50:00.000Z",
    "tweet_text": "You might not know it…but sometimes my videos end up in your kids’ classrooms. \n\nI teach students about capitalism through @EducationSITC.\n\nI wish America’s politicians would learn from these kids."
},
{
    "time": "2024-04-27T19:35:01.000Z",
    "tweet_text": "",
    "repost_text": "What do you think about Harry Sisson?"
},
{
    "time": "2024-04-27T13:36:13.000Z",
    "tweet_text": "Can’t decide whether it is funny, ridiculous or sad that the CEOs of Occidental Petroleum and Delta Airlines are on the new AI safety board.  \n\nLess than half of the 22 members have any real AI knowledge.\n\nAlso odd that it’s not even vaguely bipartisan, has zero open source AI…"
},
{
    "time": "2024-04-26T22:56:30.000Z",
    "tweet_text": "Massive tornado hits Lincoln, NE, while Starlink connects the car to the best internet"
},
{
    "time": "2024-04-26T20:08:52.000Z",
    "tweet_text": "There’s been a 495% jump in Communities User Active Minutes Y/Y — and it’s only going to get better! Check out all the new improvements.",
    "repost_text": "alright everyone @hicommunities just got multiple improvements!\n\n- there’s now an explore page for the top posts of all Communities by topic\n\n- you can also discover new Communities by topic\n \n- looking for drama or just bangers? look no further. you can now sort by trending in…"
},
{
    "time": "2024-04-26T22:48:00.000Z",
    "tweet_text": "Incredible Starlink ad"
},
{
    "time": "2024-04-26T22:40:05.000Z",
    "tweet_text": "Dustin, wd u lik sum t?"
},
{
    "time": "2024-04-26T21:28:12.000Z",
    "tweet_text": "Try out Tesla supervised full self-driving and you’ll be amazed!",
    "repost_text": "When FSD Supervised is engaged, multiple cameras & a neural network are looking around your Tesla at all times, never getting distracted or tired x.com/teslavangelist…"
},
{
    "time": "2024-04-26T20:02:21.000Z",
    "tweet_text": "What more do we need to do to improve Communities?",
    "repost_text": "alright everyone @hicommunities just got multiple improvements!\n\n- there’s now an explore page for the top posts of all Communities by topic\n\n- you can also discover new Communities by topic\n \n- looking for drama or just bangers? look no further. you can now sort by trending in…"
},
{
    "time": "2024-04-26T18:45:09.000Z",
    "tweet_text": "Great interview with @johanknorberg!",
    "repost_text": ".@johanknorberg warns America, “Don’t get cocky.”\n\nLook at his country, Sweden - politicians passed socialist policies.\n“It almost killed the Swedish economy.”"
},
{
    "time": "2024-04-26T18:27:00.000Z",
    "tweet_text": "Conferences on 𝕏 are coming soon! You'll be able to host meetings just like on Zoom, Google Meet, or Microsoft Teams."
},
{
    "time": "2024-04-26T15:25:42.000Z",
    "tweet_text": "Full & rapid reusability of booster & ship and orbital refilling of ship are the 2 fundamental technologies we aim to solve by the end of next year.\n\nThose are the critical pieces necessary to make life multiplanetary."
},
{
    "time": "2024-04-26T07:33:06.000Z",
    "tweet_text": "Best illustration I’ve seen",
    "repost_text": "The algorithm"
},
{
    "time": "2024-04-26T06:01:07.000Z",
    "tweet_text": "Babe, tell me the truth …"
},
{
    "time": "2024-04-26T05:20:32.000Z",
    "tweet_text": "Most of history had and still most of the world has “might makes right” as the axiomatic error. \n\nIf any thought is given to it, you should obviously consider morality in the absolute! Deeds done determine good or bad, not whether one party is stronger or weaker than the other."
},
{
    "time": "2024-04-26T05:19:26.000Z",
    "tweet_text": "The axiomatic error undermining much of Western Civilization is “weak makes right”. \n\nIf someone accepts, explicitly or implicitly, that the oppressed are always the good guys, then the natural conclusion is that the strong are the bad guys."
},
{
    "time": "2024-04-25T23:43:24.000Z",
    "tweet_text": "Absolutely true!\n\n“The evidence is overwhelming that the majority of people on the street are there because of untreated mental illness or addiction, which leads people to use all their money to support their drug habit and be high, rather than work.”",
    "repost_text": "The Dirty Little Secret About Homelessness Is Also The Key To Ending It\n\nThe US Supreme Court recently heard oral arguments about what cities can and cannot do to end homelessness.\n\n\"What if there is a bed available in the Gospel Rescue Mission, but Ms. Johnson, a person, doesn't…"
},
{
    "time": "2024-04-25T23:14:43.000Z",
    "tweet_text": "Late last year, several 𝕏 employees were threatened by a guy with a machete outside the Walgreens on Market St in SF. \n\nThey didn’t report it, because that doesn’t constitute an arrestable crime in California. \n\nThat guy later killed 3 people.",
    "repost_text": "California politicians are finally facing the ramifications of their pro-crime policies:\n\nLA Mayor Karen Bass was robbed on the weekend. It was the 2nd time in 2 years.\n\nYesterday, San Jose Mayor Matt Mahan's security detail was attacked on a live TV interview.\n\nIn October,…"
},
{
    "time": "2024-04-25T22:06:44.000Z",
    "tweet_text": "People want the truth",
    "repost_text": "𝕏 is the #1 news app on the AppStore in Brazil, leading both the free and grossing categories. "
},
{
    "time": "2024-04-25T20:54:50.000Z",
    "tweet_text": "While many other countries are worse, America is trending towards extinction!",
    "repost_text": "BREAKING: The US birth rate has fallen to its lowest level in a century, with the fertility rate dropping to 1.62 births per woman in 2023—the lowest since the government began tracking in the 1930s."
},
{
    "time": "2024-04-25T11:24:03.000Z",
    "tweet_text": "Starlink now available in Micronesia!",
    "repost_text": "Starlink’s high-speed, low-latency internet is now available in the Federated States of Micronesia!  → http://starlink.com/map"
},
{
    "time": "2024-04-25T10:43:11.000Z",
    "tweet_text": "Concerning",
    "repost_text": "Ep. 98  There is systemic racism in the United States, against whites. Everyone knows it. Nobody says it. How come?"
},
{
    "time": "2024-04-24T19:19:06.000Z",
    "tweet_text": "We Exposed Censorship By Brazil’s Supreme Court, And Now President Lula Is Persecuting Me  \nPLUS: Brazil’s Attorney General Is Seeking To Entirely Shut Down X, Formerly Known As Twitter \n\nThirty years ago this year, I asked Brazil’s current president, who goes by the single name…"
},
{
    "time": "2024-04-24T17:49:07.000Z",
    "tweet_text": "Anti-Semitism on campuses in the United States is reminiscent of what happened in German universities in the 1930s. \n\nThe world cannot stand idly by."
},
{
    "time": "2024-04-24T17:35:47.000Z",
    "tweet_text": "People want the truth",
    "repost_text": "BREAKING: Just now, 𝕏 has taken the top spot as the #1 News App on the App Store in Australia in both the Free and Grossing categories. "
},
{
    "time": "2024-04-24T08:56:29.000Z",
    "tweet_text": "𝕏 will bring an end to the woke legacy media.\n\nPeople are already moving to 𝕏 to discover the truth in real-time."
},
{
    "time": "2024-04-24T08:42:08.000Z",
    "tweet_text": "This graph illustrates the woke mind virus taking over legacy media. \n\nSame happened with online media and the education system. Then it spread to other countries. \n\nInfection rate almost 100%.\n\nBut now it will die."
},
{
    "time": "2024-04-23T23:52:39.000Z",
    "tweet_text": "Preview of autonomous ride-hailing via Tesla app"
},
{
    "time": "2024-04-23T22:17:58.000Z",
    "tweet_text": "Engines full power and liftoff!"
},
{
    "time": "2024-04-23T23:53:23.000Z",
    "tweet_text": "Congrats @SpaceX team on 300 rocket landings!",
    "repost_text": "Falcon 9’s first stage has landed on the Just Read the Instructions droneship, completing Falcon’s 300th landing!"
},
{
    "time": "2024-04-23T21:20:40.000Z",
    "tweet_text": "Q1 Earnings Call starting in ~10 mins"
},
{
    "time": "2024-04-23T19:22:13.000Z",
    "tweet_text": "Wow",
    "repost_text": "Milei says Argentina just had its first budget surplus in 16 years after gutting government bloat\nhttps://notthebee.com/t804d\nhttps://notthebee.com/t804d"
},
{
    "time": "2024-04-23T19:08:10.000Z",
    "tweet_text": "You are right!",
    "repost_text": "For many years now, I have warned that the path that the West is taking will result in civil war.  It might take 5 years, 50 years, or 100 years but it is inevitable.  The West could have repeatedly resolved these issues peacefully but it refuses to auto-correct from its path of…"
},
{
    "time": "2024-04-23T18:23:15.000Z",
    "tweet_text": "the reason why progressive policies are bad is simple:\n\n- if you want more people to do something, make it easier\n\n- if you want less people to do something, make it more difficult\n\nthus, progressive policies incentivize illegal immigration, homelessness, and crime by design"
},
{
    "time": "2024-04-23T16:43:52.000Z",
    "tweet_text": "How to sleep on the international space station."
},
{
    "time": "2024-04-23T17:37:35.000Z",
    "tweet_text": "Tesla has now created over 30,000 manufacturing jobs in California!",
    "repost_text": "14 years ago Tesla opened its Fremont Factory with 1k workers"
},
{
    "time": "2024-04-23T17:18:28.000Z",
    "tweet_text": "Yikes"
},
{
    "time": "2024-04-23T16:52:25.000Z",
    "tweet_text": "Yeah",
    "repost_text": "Nobody ever gets canceled for saying anything too woke."
},
{
    "time": "2024-04-23T16:28:31.000Z",
    "tweet_text": "Model 3 is quicker than a Porsche 911",
    "repost_text": "New Model 3 Performance launching today \n\n→ http://tesla.com/model3-performance…\n\n0-60 mph in 2.9\n510 hp / 741 Nm\n163 mph top speed\n—\nPerformance-tuned chassis\nSame quiet & comfortable cabin plus bespoke chassis hardware for improved stiffness and higher performance baseline.\n\nMore power,…"
},
{
    "time": "2024-04-23T16:20:14.000Z",
    "tweet_text": "The Australian people want the truth.\n\n𝕏 is the only one standing up for their rights.",
    "repost_text": "X has risen to become the top downloaded news app in Australia."
},
{
    "time": "2024-04-23T14:03:54.000Z",
    "tweet_text": "In the last month, people on X have spent a lot of time watching video – to the tune of 385 million hours! That’s 1.4 trillion seconds, 23 billion minutes, or 16 million days worth of video.\n\nLet’s watch what happens when you can stream the world in real-time on X TV!",
    "repost_text": "Coming soon to a television near you: X TV "
},
{
    "time": "2024-04-23T15:30:01.000Z",
    "tweet_text": "Here is the FULL interview with Swedish author @johanknorberg on:\n\nWhy Sweden is NOT a “socialist paradise.”\n\nThe fake loneliness epidemic.\n\nThe crazy push for degrowth.\n\nWhy capitalism makes people LESS racist."
},
{
    "time": "2024-04-23T15:22:12.000Z",
    "tweet_text": "Morgan Freeman is awesome",
    "repost_text": "Morgan Freeman: \"I'm a huge fan of Elon Musk. I think he's got the most incredibly forward-thinking ideas about where we can go technologically. What he's done, nobody else has ever done.\" @morgan_freeman @elonmusk"
},
{
    "time": "2024-04-23T15:16:22.000Z",
    "tweet_text": "𝕏 is growing \n\n• 𝕏 has seen a 63% increase in brand likes, 20% increase in brand re-posts and a 14% increase in brand impressions within the last six months\n\n• Over the past month, users have watched 385 million hours of video, which is equivalent to 1.4 trillion seconds,…"
},
{
    "time": "2024-04-23T14:02:41.000Z",
    "tweet_text": "Coming soon to a television near you: X TV "
},
{
    "time": "2024-04-23T02:50:28.000Z",
    "tweet_text": "Starship = Hope"
},
{
    "time": "2024-04-20T20:01:46.000Z",
    "tweet_text": "One year since first flight test of Starship. \n\nEach successive launch has gone farther, and with more flights coming soon, we're rapidly building towards a fully reusable future"
},
{
    "time": "2024-04-23T03:11:00.000Z",
    "tweet_text": "The eSafety Commissioner of Australia demanded that 𝕏 globally withhold certain posts or face a daily fine of $500,000\n\n𝕏 is fighting back against these global censorship orders. It's time to support this platform by subscribing to 𝕏 Premium."
},
{
    "time": "2024-04-23T01:38:34.000Z",
    "tweet_text": "That is exactly the issue. \n\nShould the eSafety Commissar (an unelected official) in Australia have authority over all countries on Earth?",
    "repost_text": "The issue is that Australia appears to be demanding censorship of content on 𝕏 beyond its borders."
},
{
    "time": "2024-04-23T00:54:44.000Z",
    "tweet_text": "Major milestone",
    "repost_text": "Last Tuesday night, battery storage became the largest source of supply to the California grid for the first time, discharging over 6GW \nhttps://reneweconomy.com.au/battery-storage-becomes-biggest-source-of-supply-in-evening-peak-in-one-of-worlds-biggest-grids/…"
},
{
    "time": "2024-04-23T00:31:47.000Z",
    "tweet_text": "The notification tab is currently in chronological order only. \n\nWe’re working on a ranking option there, like For you vs Following."
},
{
    "time": "2024-04-22T23:07:52.000Z",
    "tweet_text": "A few stats:\n\n- In 2023, our owners avoided approximately 20 million tons of CO2e through use of our products\n\n- The more products we sell, the faster we achieve our mission—hence affordability is key. A Model 3 RWD lease in US now starts at $160/month after probable gas savings…",
    "repost_text": "Tesla exists to accelerate the world’s transition to sustainable energy.\n\nThank you to our owners, employees & advocates for supporting us in our mission!\n\nHappy Earth Day "
},
{
    "time": "2024-04-22T23:30:07.000Z",
    "tweet_text": "Tesla is the lowest cost car to maintain"
},
{
    "time": "2024-04-22T23:28:12.000Z",
    "tweet_text": "Cool",
    "repost_text": "NEWS: Consumer Reports has named @Tesla the cheapest car brand to maintain over a 10 year period:\n\n1: Tesla: $4,035\n2: Buick: $4,900\n3: Toyota: $4,900\n4: Lincoln: $5,040\n5: Ford: $5,400\n6: Chevrolet: $5,550\n7: Hyundai: $5,640\n8: Nissan: $5,700\n9: Mazda: $5,800\n10: Honda: $5,850…"
},
{
    "time": "2024-04-22T23:21:32.000Z",
    "tweet_text": "Our concern is that if ANY country is allowed to censor content for ALL countries, which is what the Australian “eSafety Commissar” is demanding, then what is to stop any country from controlling the entire Internet?\n\nWe have already censored the content in question for…",
    "repost_text": "Australia’s censorship industrial complex: \n\n“The problem that you’ve got here with this eSafety Commissioner, she’s an activist.\n\nShe will continue to expand her role to police the internet, to censor debate in a way that’s consistent with her own ideological views.\n\nYou have…"
},
{
    "time": "2024-04-22T22:31:01.000Z",
    "tweet_text": "Sign up for the 'Advertising on X 101' webinar\n\nLearn how to set up an ad campaign and grow your business with X Ads, directly from an X Ads Specialist.\n\nWednesday, April 24th at 1:15PM ET\n\nWhat it will cover:\n- The power of X’s audience for businesses\n- How to set up and…"
},
{
    "time": "2024-04-22T19:44:55.000Z",
    "tweet_text": "With 3,000 newly planted flowers and plants and a widely visible mural, the Giga Berlin team is making a statement for today's Earth Day."
},
{
    "time": "2024-04-22T16:07:09.000Z",
    "tweet_text": "Don’t take my word for it, just ask the Australian PM!"
},
{
    "time": "2024-04-22T15:55:42.000Z",
    "tweet_text": "Tesla exists to accelerate the world’s transition to sustainable energy.\n\nThank you to our owners, employees & advocates for supporting us in our mission!\n\nHappy Earth Day "
},
{
    "time": "2024-04-22T15:28:39.000Z",
    "tweet_text": "I’d like to take a moment to thank the PM for informing the public that this platform is the only truthful one",
    "repost_text": "Australia's Prime Minister taking time during his presser to advertise for Elon.\n\n\"By and large, [other social media] responded appropriately to the calls [for censorship] by the E-Safety Commissioner. X chose not to. \n...\nWe know, I think overwhelmingly, Australians want…"
},
{
    "time": "2024-04-22T06:15:57.000Z",
    "tweet_text": "Celebrating 10 years since the first-ever delivery of Tesla Model S in China—thanks to our 1.7 million Chinese owners, our partners, supporters and industry advocates. Together, let's accelerate the world's transition to sustainable energy! \n\n特斯拉中国首批车主交付十周年…",
    "repost_text": "Happy to celebrate Earth Day by delivering our first Model S's to China. #HappyEarthDay https://youtube.com/watch?v=QweNsLesMrM…"
},
{
    "time": "2024-04-22T05:24:36.000Z",
    "tweet_text": "Time to make crime illegal again"
},
{
    "time": "2024-04-22T04:40:18.000Z",
    "tweet_text": "Grok v1.5 can explain memes "
},
{
    "time": "2024-04-22T04:10:23.000Z",
    "tweet_text": "Subscribing to your favorite accounts on 𝕏 is the best way to show your love and support.\n\nPlease consider subscribing to as many creators as you find interesting on this platform."
},
{
    "time": "2024-04-22T04:05:48.000Z",
    "tweet_text": "Robbery in most of America is out of control",
    "repost_text": "Los Angeles Mayor Karen Bass just had her house burglarized today. Again.\n\nI feel zero sympathy for any politician who supported policies to \"CUT THE PRISON POPULATION IN HALF\" (bail reform)."
},
{
    "time": "2024-04-22T00:19:42.000Z",
    "tweet_text": "Wow",
    "repost_text": "I had lunch with the ceo of Marici on Friday, the non profit that busts child sex trafficking rings.\nI asked who is most to blame for this happening.\nWithout hesitation, he said \"Meta.\"\n\"We try to work with them, but they are not helping.\" https://marici.org"
},
{
    "time": "2024-04-21T21:54:15.000Z",
    "tweet_text": "And this is after Sheetz had to struggle for years with a challenging brand name!",
    "repost_text": "The Biden administration is suing Sheetz for discriminating against minorities.\n\nThe reason? The company requires all the applicants to first pass a criminal record background check. \n\nYou are now required to hire criminals."
},
{
    "time": "2024-04-21T17:26:55.000Z",
    "tweet_text": "Subscribe to 𝕏 premium and support free speech."
},
{
    "time": "2024-04-21T17:01:18.000Z",
    "tweet_text": "Because he is against the will of the people and, therefore, democracy",
    "repost_text": "Where are the massive crowds cheering for petty tyrant @Alexandre de Voldemort and censorship in Brazil?\n\nThere are none. x.com/nikolas_dm/sta…"
},
{
    "time": "2024-04-21T14:52:00.000Z",
    "tweet_text": "Remember California’s #AB5?\n \nIt was meant to help freelancers. \n\nInstead, it killed their jobs.\n \nI thought politicians would learn from their terrible policy. But no! \nNow Biden is forcing the rest of America to be more like California:"
},
{
    "time": "2024-04-21T14:34:33.000Z",
    "tweet_text": "“Without censorship, Hitler never would have achieved his terrible power, nor would he be able to hold it.”\n\n“A censor tells the newspapers what to publish, so that in this ignorance the citizen will support the government in power.\"\n\nSeptember 30, 1938 | The Daily Times"
},
{
    "time": "2024-04-21T14:30:33.000Z",
    "tweet_text": "\"To be clear, 𝕏 is only trying to follow the laws of Brazil without favor or disfavor to any political candidate.\" \n\n一 Elon Musk"
},
{
    "time": "2024-04-20T23:57:13.000Z",
    "tweet_text": "Forward links to make sure your friends know what’s really happening",
    "repost_text": "You can also support this platform by sharing 𝕏.com links with your friends."
},
{
    "time": "2024-04-20T21:53:59.000Z",
    "tweet_text": "𝕏 Developer Challenge Progress—\n\nLoading potential future features powered by our X platform and developers!"
},
{
    "time": "2024-04-20T20:36:56.000Z",
    "tweet_text": "A return to reasonableness and due process under Brazilian law is the right thing to do",
    "repost_text": "Opposition To Brazilian Supreme Court Justice Alexandre De Moraes Is Growing, Reports The New York Times Of Brazil\n\"Members of Congress\" and the Lula government \"who usually support Moraes' actions now admit repairs and recognize, behind the scenes, the need for adjustments,\"…"
},
{
    "time": "2024-04-20T16:00:03.000Z",
    "tweet_text": "Trust the experts."
},
{
    "time": "2024-04-20T17:42:33.000Z",
    "tweet_text": "Accurate",
    "repost_text": "y'know, this isn't wrong"
},
{
    "time": "2024-04-20T17:15:01.000Z",
    "tweet_text": "𝕏 is defending free speech. Consider subscribing to 𝕏 premium. \n𝕏 is indispensable"
},
{
    "time": "2024-04-20T17:26:17.000Z",
    "tweet_text": "Shellenberger eloquently describes the severity of the situation in Brazil and the appropriate remedy",
    "repost_text": "Brazilian Judge Pushes Nationalist Conspiracy Theory To Weaponize Federal Police Against Defenders Of Free Speech\nBrazil’s Federal Police discuss me in new report commissioned by Supreme Court Justice Alexandre de Moraes\n\nYesterday, a Brazilian Supreme Court Justice, who is also…"
},
{
    "time": "2024-04-20T17:21:36.000Z",
    "tweet_text": "The software must have exactly 420 lines of code on this auspicious day",
    "repost_text": "𝕏 Developer Challenge event is now in motion. Exciting day ahead!"
},
{
    "time": "2024-04-20T14:40:26.000Z",
    "tweet_text": "Absolutely disastrous",
    "repost_text": "In 1993, 60% of Americans in their early 30s (30-34) had at least one child. \n\nNow that number is down to just 27%.\n\nThis is by far the most catastrophic event in American history, and most people are too distracted to realize it's happening."
},
{
    "time": "2024-04-20T09:36:57.000Z",
    "tweet_text": "4/20\n\nFirst Starship Launch Anniversary Today"
},
{
    "time": "2024-04-20T09:32:10.000Z",
    "tweet_text": "Exactly",
    "repost_text": "Australia’s censorship industrial complex: \n\n“The problem that you’ve got here with this eSafety Commissioner, she’s an activist.\n\nShe will continue to expand her role to police the internet, to censor debate in a way that’s consistent with her own ideological views.\n\nYou have…"
},
{
    "time": "2024-04-20T09:07:51.000Z",
    "tweet_text": "Legacy media is ideologically aligned with NPR",
    "repost_text": "Asked a bunch of my friends who don't use Twitter if they are aware of the drama at NPR.\n\nNot a single person had heard about it.\n\nLegacy media is avoiding this topic it seems.\n\nOr - it is a nothing-burger to them."
},
{
    "time": "2024-04-20T09:01:07.000Z",
    "tweet_text": "This is crazy",
    "repost_text": "\"You can literally walk into a retail store every single day of the year and steaI $949 worth of merchandise\"\n\n\"And you will NEVER do a minute in jail\"\n\n\"Under California law, assauIt on a peace officer with anything other than a fully automatic weapon is not a vioIent crime\"…"
},
{
    "time": "2024-04-20T08:59:01.000Z",
    "tweet_text": "Yeah",
    "repost_text": "Bill Maher Issues Wake-Up Call to All Democrats Who Think the NPR Story Is Not a Big Deal\n\n\"NPR is to them [Republicans] what this country would be if it was a permanent democratic governorship.\"\n\n\"Of the 87 people working in editorial positions there, 87 are Democrats. Even if…"
},
{
    "time": "2024-04-20T05:55:47.000Z",
    "tweet_text": "Improvements to Notes",
    "repost_text": "We recently launched an update that improves note quality while simultaneously increasing the number of notes shown on X by about 6%. This update also identifies 6% more Not Helpful notes, which in turn limits writing ability of authors regularly proposing such notes.\n\nIt works…"
},
{
    "time": "2024-04-19T23:40:33.000Z",
    "tweet_text": "180MW / 315MWh of Tesla Megapacks at Enfinite’s 9 sites in Alberta provided historic levels of output this winter. At a time where generation was constrained due to extreme cold conditions and high energy demand, Megapacks provided a critical line of defense, preventing rolling…"
},
{
    "time": "2024-04-20T04:45:55.000Z",
    "tweet_text": "Great men are called upon by history when they see dangerous times ahead; this is one of those times.\n\nAnd despite our immense challenges, I am feeling optimistic, as I see friends heed the call.\n\nWe have nowhere to run; the United States of America is where we make our stand."
},
{
    "time": "2024-04-20T04:46:38.000Z",
    "tweet_text": "Your subscription is much appreciated. \n\nThe days ahead for defending freedom of speech will be tough.",
    "repost_text": "Consider subscribing to 𝕏 premium to help support free speech and this platform. It’s a game changer."
},
{
    "time": "2024-04-20T04:45:03.000Z",
    "tweet_text": "And the gas savings are very real. That’s why so many Uber drivers use Tesla!"
},
{
    "time": "2024-04-20T04:36:43.000Z",
    "tweet_text": "Turns out that free speech is actually very expensive",
    "repost_text": "Thank you 𝕏 for fighting against censorship. \n\n𝕏 is truly the last free speech platform on earth. We can support this platform by subscribing to 𝕏 Premium."
},
{
    "time": "2024-04-20T03:01:47.000Z",
    "tweet_text": "Our current referral program benefits will end after April 30 in all markets"
},
{
    "time": "2024-04-20T04:03:49.000Z",
    "tweet_text": "Almost everywhere on Earth had slavery for thousands of years and some places still do. \n\nThe drive to end slavery on a worldwide basis was spearheaded by Britain in the early 1800’s. \n\nhttps://en.m.wikipedia.org/wiki/West_Africa_Squadron#:~:text=Britain%20pressed%20other%20nations%20into,East%2C%20and%20the%20Indian%20Ocean….",
    "repost_text": "Most people don't even know their own cultural history.\n\nThis Korean guy thought Koreans had no history of slavery. It turns old, Korea has thousands of years of history of slavery, which continues in North Korea even today. x.com/mask_bastard/s…"
},
{
    "time": "2024-04-20T03:53:55.000Z",
    "tweet_text": "Wow, Bill Maher hits the bullseye ",
    "repost_text": "It turns out for pedophiles in Hollywood, \"It's A Small World After All.\""
},
{
    "time": "2024-04-19T21:25:37.000Z",
    "tweet_text": "Same",
    "repost_text": "Rumble has received censorship demands from Australia, New Zealand, and other countries that infringe on everyone’s human rights. \n\nWe are noticing a dramatic increase in global censorship, unlike anything we’ve seen before."
},
{
    "time": "2024-04-19T15:06:53.000Z",
    "tweet_text": "𝕏 is the #1 news app on the App Store in over 160 countries. "
},
{
    "time": "2024-04-19T14:17:04.000Z",
    "tweet_text": "Scotland becomes latest country to join Team Reality, halts puberty blockers for children\nhttps://notthebee.com/t8e00"
},
{
    "time": "2024-04-19T18:48:49.000Z",
    "tweet_text": "Insane",
    "repost_text": "The Biden Admin has just officially abolished Title IX as we knew it. Now, sex = gender identity.  \n\nIn a nutshell, the new rewrite means:\n- men can take academic AND athletic scholarships from women \n- men will have FULL access to bathrooms, locker rooms, etc\n- men could be…"
},
{
    "time": "2024-04-19T18:47:25.000Z",
    "tweet_text": "The Australian censorship commissar is demanding *global* content bans!",
    "repost_text": "The recent attacks in Australia are a horrific assault on free society. Our condolences go out to those who have been affected, and we stand with the Australian people in calling for those responsible to be brought to justice. \n\nFollowing these events, the Australian eSafety…"
},
{
    "time": "2024-04-19T18:43:42.000Z",
    "tweet_text": "Another major attack on the First Amendment by this administration",
    "repost_text": "You think “the tide is turning and woke will go away”? \n\nNot yet! This rule enshrines illiberal orthodoxy and continues their battle to transform society.\n\nBiden radicals bring back “guilty until proven innocent” frameworks that upended the lives of 10,000s of innocent young men. x.com/ishapiro/statu…"
},
{
    "time": "2024-04-19T18:32:34.000Z",
    "tweet_text": "Mad insurance regulation & extremely high litigation costs are the root causes",
    "repost_text": "I don’t think most people quite yet grasp the monumental significance of the sudden collapse of nearly the entire state insurance industry in California. There is one entity responsible: state government.  Without insurance you can’t purchase or own anything unless you’re very… x.com/KTLA/status/17…"
},
{
    "time": "2024-04-19T18:20:41.000Z",
    "tweet_text": "In my opinion, TikTok should not be banned in the USA, even though such a ban may benefit the 𝕏 platform. \n\nDoing so would be contrary to freedom of speech and expression. It is not what America stands for."
},
{
    "time": "2024-04-19T18:10:01.000Z",
    "tweet_text": "The opposition to free speech (under the guise of “hate speech”) in America by hard left activists is much greater than most people realize",
    "repost_text": "Let's review: NPR hired a CEO who opposes a \"free and open\" internet, believes that truth is a \"distraction,\" describes the First Amendment as a \"challenge\" to narrative control, and admits that she censored speech \"through conversations with government.\"\n\nThis is NPR, exposed."
},
{
    "time": "2024-04-19T16:13:36.000Z",
    "tweet_text": ".@elonmusk: \"History is written by the victors. Well, yes, but not if your enemies are still alive and have a lot of time on their hands to edit Wikipedia.\"\n\n"
},
{
    "time": "2024-04-19T04:49:14.000Z",
    "tweet_text": "Any accounts doing engagement farming will be suspended and traced to source"
},
{
    "time": "2024-04-19T03:51:07.000Z",
    "tweet_text": "We should send rockets not at each other, but rather to the stars"
},
{
    "time": "2024-04-19T03:16:01.000Z",
    "tweet_text": "Improved ad performance",
    "repost_text": "Now live: Create and launch Sales campaigns in minutes\n\nRead more → https://business.x.com/en/blog/create-and-launch-sales-campaigns-in-minutes.html…\n\nOver the past 18 months, X has made significant improvements to our performance solutions by building state-of-the-art machine learning systems and AI capabilities. These advancements…"
},
{
    "time": "2024-04-19T00:08:32.000Z",
    "tweet_text": "Falcon 9 launches 23 @Starlink satellites to low-Earth orbit from Florida"
},
{
    "time": "2024-04-18T22:41:15.000Z",
    "tweet_text": "Ignition of the nine first stage Merlin engines and liftoff of Falcon 9!"
},
{
    "time": "2024-04-18T23:22:19.000Z",
    "tweet_text": "It’s a real problem!"
},
{
    "time": "2024-04-18T23:13:47.000Z",
    "tweet_text": "Crime is out of control",
    "repost_text": "Received a warm welcome to California  x.com/bennyjohnson/s…"
},
{
    "time": "2024-04-18T22:58:08.000Z",
    "tweet_text": "Ironically, GDI pushes disinformation and should be shut down, with recriminations for the miscreants",
    "repost_text": "Here is the full length video report into the mysterious 'Global Disinformation Index' and how it censors political speech across Europe and the US. Please share widely, more people need to know."
},
{
    "time": "2024-04-18T22:43:32.000Z",
    "tweet_text": "De Moraes absolutely interfered with the Brazil elections",
    "repost_text": "Years Of US-UK Military And Intelligence Planning Behind Sweeping Brazil Censorship, Evidence Suggests\n\n_Secret evidence, specialized spy units, and permanent bans on populists were key tactics developed by government operatives_\n\nLate last night, the Judiciary Committee of the…"
},
{
    "time": "2024-04-18T22:37:22.000Z",
    "tweet_text": "Improved advertising",
    "repost_text": "Now live: Create and launch Sales campaigns in minutes\n\nRead more → https://business.x.com/en/blog/create-and-launch-sales-campaigns-in-minutes.html…\n\nOver the past 18 months, X has made significant improvements to our performance solutions by building state-of-the-art machine learning systems and AI capabilities. These advancements…"
},
{
    "time": "2024-04-18T22:03:44.000Z",
    "tweet_text": "𝕏 users are reporting that their pinned posts are getting greater reach compared to others.\n\nThis is because the 𝕏 algorithm gives them a slight boost and shows them to all your followers.\n\nI strongly recommend pinning your best content to your profile."
},
{
    "time": "2024-04-18T21:56:04.000Z",
    "tweet_text": "Wow",
    "repost_text": "NEW: Wikipedia co-founder Larry Sanger says that Wikipedia has been ideologically corrupted, raises the possibility that Katherine Maher collaborated with U.S. intelligence, and says that, if NPR were committed to truth, it would fire her \"right away.\"\nhttps://city-journal.org/article/wikipedia-co-founder-shocked-by-npr-chief-katherine-maher…"
},
{
    "time": "2024-04-18T19:04:42.000Z",
    "tweet_text": "The Olympics brings out the best of X, with 89% of conversation globally being positive/neutral. \n\nYour brand should be part of the conversation. Get started: http://ads.x.com"
},
{
    "time": "2024-04-18T18:57:20.000Z",
    "tweet_text": "If maximizing free speech within the bounds of the law, a traditionally liberal value, is somehow “far right”, then I guess I am "
},
{
    "time": "2024-04-18T18:43:02.000Z",
    "tweet_text": "Every time I hear about GPU FLOPS"
},
{
    "time": "2024-04-18T16:49:43.000Z",
    "tweet_text": "Given the relentless attacks on free speech, I am going to fund a national signature campaign in support of the First Amendment"
},
{
    "time": "2024-04-18T16:34:35.000Z",
    "tweet_text": "Highly recommend this book!",
    "repost_text": "Heading back to #1. 100% effective mind vaccine with zero side effects."
},
{
    "time": "2024-04-18T16:32:15.000Z",
    "tweet_text": "Wow, this is insane",
    "repost_text": "Here’s the truth. Mayorkas illegally paroled Laken Riley’s killer into the US. He had a criminal record. He then committed a crime against a child in New York. No prosecution. In fact, HE GOT A WORK PERMIT. And then he killed Laken. Mayorkas knew *all* this. He lied about it"
},
{
    "time": "2024-04-18T16:28:45.000Z",
    "tweet_text": "Starlink streams live during a tornado!",
    "repost_text": "Starlink is designed to endure the elements - it can melt snow and withstand sleet, heavy rain, and even harsh winds   x.com/aaronjayjack/s…"
},
{
    "time": "2024-04-18T16:28:04.000Z",
    "tweet_text": "Concerning that less than 1/3 of F-35s, the most advanced US fighter are fully mission capable",
    "repost_text": "I'm no fan of Gaetz, but he gets right to the heart of the matter in this fascinating exchange: Only 29 percent of our punishingly-expensive F-35s are fully mission capable because of Lockheed Martin control.\n\n\"The tail is wagging the dog.\" x.com/RepMattGaetz/s…"
},
{
    "time": "2024-04-18T15:04:56.000Z",
    "tweet_text": "This will increasingly be the case",
    "repost_text": "NEWS: A landmark event occurred in the US on Tuesday night when battery storage become for the first time the largest source of supply in the California grid, which delivers electricity to the world’s fifth biggest economy. https://reneweconomy.com.au/battery-storage-becomes-biggest-source-of-supply-in-evening-peak-in-one-of-worlds-biggest-grids/…"
},
{
    "time": "2024-04-18T13:07:05.000Z",
    "tweet_text": "Imagine a massive celestial bubble made of ice and dust surrounding our Solar System. That’s the Oort cloud and this is its scale.\n\nThe Oort Cloud lies at the very edges of the Solar system.  Even the farthest ones which are still working, like Voyager 1, Voyager 2 and New…"
},
{
    "time": "2024-04-18T14:53:21.000Z",
    "tweet_text": "Advertising on X 101\nLearn how to set up an ad campaign and grow your business with X Ads, directly from an X Ads Specialist.\n\nWednesday, April 24th at 10:15 AM PT / 1:15PM ET\n\nWhat it will cover:\n- The power of X’s audience for businesses\n- How to set up and optimize your…"
},
{
    "time": "2024-04-18T14:45:30.000Z",
    "tweet_text": "NEWS: X will host an ‘Advertising on X 101’\nWednesday, April 24th at 10:15 AM PT / 1:15PM ET\n \nSign up: https://business.x.com/en/campaign/webinars/amer/advertising-on-x-101.html…"
},
{
    "time": "2024-04-17T21:05:58.000Z",
    "tweet_text": "It’s not even summer, but this year’s Summer Olympics are already lighting up the conversation on X!  There have been over 6.9 BILLION impressions on posts about the Olympics so far this year. "
},
{
    "time": "2024-04-18T09:37:22.000Z",
    "tweet_text": " THE BRAZIL X FILES: EVEN MEMES WERE CONSIDERED ILLEGAL CONTENT\n\nBrazil's Supreme Court issued a confidential order to suspend social media profiles of influencers accused of spreading election misinformation. \n\nIt appears they targeted profiles that, even through memes,…"
},
{
    "time": "2024-04-18T14:25:58.000Z",
    "tweet_text": "Now you know part of why it turned into"
},
{
    "time": "2024-04-18T14:18:41.000Z",
    "tweet_text": "Wow",
    "repost_text": "Wow\n\nSigns in eight different languages advertising the free plane tickets for illegals in NYC! x.com/sav_says_/stat…"
},
{
    "time": "2024-04-18T14:11:57.000Z",
    "tweet_text": "That’s literally the point of Wikipedia",
    "repost_text": "EXCLUSIVE: Katherine Maher says that she abandoned a \"free and open\" internet as the mission of Wikipedia, because those principles recapitulated a \"white male Westernized construct\" and \"did not end up living into the intentionality of what openness can be.\""
},
{
    "time": "2024-04-18T08:25:38.000Z",
    "tweet_text": "The law broke the law",
    "repost_text": " THE BRAZIL X FILES: BRAZIL'S SUPREME COURT GRANTED ITSELF UNPRECEDENTED POWERS\n\nIn 2019, Brazil’s Supreme Court assumed extraordinary powers to initiate investigations independently, acting as investigator, prosecutor, and judge. \n\nThis decision was so controversial that…"
},
{
    "time": "2024-04-17T20:26:23.000Z",
    "tweet_text": "Leftism destroys everything it touches."
},
{
    "time": "2024-04-18T01:51:39.000Z",
    "tweet_text": "This is incredibly messed up",
    "repost_text": "ICE Boston arrested 4 alleged child rapists in a single morning, but that's not the worst of it. Local courts keep letting them go.\nhttps://notthebee.com/article/ice-boston-arrested-4-alleged-child-rapists-in-a-single-morning-check-it-out…\nhttps://notthebee.com/article/ice-boston-arrested-4-alleged-child-rapists-in-a-single-morning-check-it-out…"
},
{
    "time": "2024-04-18T01:45:41.000Z",
    "tweet_text": "The censorship actions against elected representatives demanded by @alexandre violate Brazilian law",
    "repost_text": " THE BRAZIL X FILES:  PEOPLE BRAZIL TRIED TO CENSOR\n\nHere is a detailed list of some of the individuals and entities targeted for censorship:\n\nPolitical Opposition:\n- Jair Messias Bolsonaro: 38th President of Brazil.\nMarcos do Val: Current Member of the Federal Senate in…  x.com/MarioNawfal/st…"
},
{
    "time": "2024-04-18T01:38:51.000Z",
    "tweet_text": "Surely this is illegal?",
    "repost_text": "American elections should be for Americans — not for foreign billionaires influencing our politics.\n \nThat’s why we’ve released our new report detailing how foreign nationals use dark money to influence our elections and what can be done to STOP them.https://americansforpublictrust.org/document/sixteen-thirty-fund-ballot-spending-report/…"
},
{
    "time": "2024-04-17T22:53:16.000Z",
    "tweet_text": "Falcon 9 launches from Florida, carrying 23 @Starlink satellites to low-Earth orbit"
},
{
    "time": "2024-04-18T01:20:33.000Z",
    "tweet_text": "𝕏 is the best place to advertise your brand or business."
},
{
    "time": "2024-04-18T01:17:19.000Z",
    "tweet_text": "Super-powerful AI programmed in this way has severe civilization-level risk https://x.com/pmarca/status//pmarca/status/1780758152562311415…"
},
{
    "time": "2024-04-17T20:19:10.000Z",
    "tweet_text": "Poder ao povo!",
    "repost_text": "Moraes aparece no Senado em meio a embate entre Poderes e diz que 'éramos felizes' antes de redes\nhttps://www1.folha.uol.com.br/poder/2024/04/moraes-aparece-no-senado-em-meio-a-embate-entre-poderes-e-diz-que-eramos-felizes-antes-de-redes.shtml?utm_source=twitter&utm_medium=social&utm_campaign=twfolha…"
},
{
    "time": "2024-04-17T18:37:10.000Z",
    "tweet_text": "Bring back Vine?"
},
{
    "time": "2024-04-17T18:12:52.000Z",
    "tweet_text": "This keeps getting crazier! The head of NPR hates the Constitution of the USA.",
    "repost_text": "EXCLUSIVE: Katherine Maher says the \"the number one challenge\" in her fight against disinformation is \"the First Amendment in the United States,\" which makes it \"a little bit tricky\" to censor \"bad information\" and \"the influence peddlers\" who spread it.\n\nNPR's censor-in-chief."
},
{
    "time": "2024-04-17T18:08:16.000Z",
    "tweet_text": "Now imagine if this is programmed, explicitly or implicitly, into super powerful AI – it could end civilization. \n\nNow, no need to imagine. It is already programmed into Google Gemini and OpenAI ChatGPT.",
    "repost_text": "\"Truth is subjective\" is precisely the key tenet of postmodernism.  This is why I refer to it as the granddaddy of all parasitic idea pathogens. x.com/libbyemmons/st…"
},
{
    "time": "2024-04-17T17:54:45.000Z",
    "tweet_text": "The software running in her head is the anti-Grok – hates truth & humor ",
    "repost_text": "NPR's CEO believes that truth is subjective and the pursuit of truth can get in the way of getting things done.\n\nAces."
},
{
    "time": "2024-04-16T22:57:56.000Z",
    "tweet_text": "Legacy media simply can’t compete with hundreds of millions of humans providing real-time, AI-assisted, interactive information",
    "repost_text": "BREAKING: The legacy media is dying  "
},
{
    "time": "2024-04-16T22:52:19.000Z",
    "tweet_text": "Whoa, I just realized that raising a kid is basically 18 years of prompt engineering "
},
{
    "time": "2024-04-16T18:54:01.000Z",
    "tweet_text": "More than the population of 36 states in just over 3 years!\n\nI am very much in favor of legal immigration, being an immigrant myself, but allowing a flood of millions of unvetted people to enter the United States illegally is insane.",
    "repost_text": "7.2 MILLION\n\nThat’s how many illegals have entered the United States under the Biden Administration— more than the population of 36 states.\n\nOver 1,000 of them took over NYC City Hall Park here to protest being sent to shelters and they are demanding permanent housing."
},
{
    "time": "2024-04-16T18:45:43.000Z",
    "tweet_text": "When will this madness stop?",
    "repost_text": "The moment of this alleged child rapist’s arrest while we were with ICE Boston. He was their fourth alleged child rapist arrest of the morning. \nAll had been released by local jurisdictions who refused to cooperate with ICE."
},
{
    "time": "2024-04-16T15:39:26.000Z",
    "tweet_text": "NPR has become a hard left propaganda machine that tolerates no dissent",
    "repost_text": "Senior @NPR editor @uberliner has been suspended from the public radio network he's served for 25 years after sharing concerns about bias in The Free Press: https://thefp.pub/4aJXNk4"
},
{
    "time": "2024-04-16T01:11:16.000Z",
    "tweet_text": "FSD Supervised continues to improve with every over-the-air software update\n\nLatest version 12.3.4 rolling out now",
    "repost_text": "Zero disengagement drive tonight in the rain with FSD 12.3.3 it seems to be getting better and better everyday! Also, the auto wipers are perfect now!   @elonmusk @Tesla"
},
{
    "time": "2024-04-15T20:34:02.000Z",
    "tweet_text": "Interesting series about a potentially good future",
    "repost_text": "Reimagine tomorrow with the new 6 part docuseries ‘A Brief History Of The Future,’ on @PBS. Full Episode 2 | Chaos and Complexity\n\nHosted by Futurist Ari Wallach (@AriW), Directed by @Andrew_Morgan, and Executive Produced by @KathrynAMurdoch, @wenschmidt, @KMbappe, and @Drake"
},
{
    "time": "2024-04-15T19:34:09.000Z",
    "tweet_text": "United States laws prevent 𝕏 from participating in corruption that violates the laws of other countries, which is what @Alexandre is demanding that we do",
    "repost_text": "X Corp. has been formally subpoenaed by the U.S. House of Representatives Judiciary Committee to provide information on orders from the Brazilian Supreme Court regarding content moderation. \n\nTo comply with its obligations under U.S. law, X Corp. has responded to the Committee.…"
},
{
    "time": "2024-04-15T18:34:59.000Z",
    "tweet_text": "Interesting",
    "repost_text": "The new NPR CEO's work history is almost a perfect list of the institutions that have been most corrupted..."
},
{
    "time": "2024-04-15T18:34:21.000Z",
    "tweet_text": "If you’re experiencing severe neck/back pain, I recommend looking into a disc replacement. \n\nIf you do, err on the side of a disc with limited movement. A simple hinge is more likely to be effective than a high mobility artificial disc that can translate, as well as rotate."
},
{
    "time": "2024-04-15T17:23:47.000Z",
    "tweet_text": "bon appétit  "
},
{
    "time": "2024-04-15T16:10:37.000Z",
    "tweet_text": "Worth noting that the actual brand safety score is almost perfect",
    "repost_text": "X platform’s brand safety score for advertisers hurt by error for almost 5 months https://trib.al/2aVMniC"
},
{
    "time": "2024-04-15T16:02:25.000Z",
    "tweet_text": "Thanks to the 𝕏 team for discovering this and @DoubleVerify for responding quickly to correct the error",
    "repost_text": "Today @MoniquePintarel, Head of the America's at X, addressed the @MMApress's Board of Global Advertisers regarding the recent situation with @doubleverify and @X. In the spirit of transparency, please find her remarks below.\n\nRemarks:\nHi everyone, I am not sure if you are all… x.com/XBusiness/stat…"
},
{
    "time": "2024-04-15T12:08:39.000Z",
    "tweet_text": "Greece is one of dozens of countries experiencing population collapse due to low birth rates",
    "repost_text": "Greece is predicted to become the first nation to suffer “population collapse” as sudden and unexpected deaths continue soaring across the nation while fertility rates have plunged to levels lower than experts previously thought possible.\n\nHeart failure, strokes, blood clots, and…"
},
{
    "time": "2024-04-14T20:37:00.000Z",
    "tweet_text": "Create or join 𝕏 Communities!",
    "repost_text": "𝕏 communities are growing. \n\n• Members are spending 495% more time in 𝕏 Communities.\n\n• Time spent on 𝕏 Communities has grown +600% in the past year – with more than double the number of active Communities.\n\n• The communities also have 3 times more posts and unique users…"
},
{
    "time": "2024-04-14T12:04:39.000Z",
    "tweet_text": ""
},
{
    "time": "2024-04-14T09:04:20.000Z",
    "tweet_text": "The refreshing breeze of the Overton window opening"
},
{
    "time": "2024-04-13T23:09:22.000Z",
    "tweet_text": "Always wondered what that chair was for"
},
{
    "time": "2024-04-13T13:06:00.000Z",
    "tweet_text": "We can't stop AI anymore. Our only path forward is to guide it."
},
{
    "time": "2024-04-13T13:45:46.000Z",
    "tweet_text": "",
    "repost_text": "They say in politics, liberals are the gas pedal, and conservatives are the brakes, and I'm generally with the gas pedal, but not if we're driving off a cliff."
},
{
    "time": "2024-04-13T08:14:42.000Z",
    "tweet_text": "Join @xAI!",
    "repost_text": "we're hiring designers, engineers, product, data, infra, and ai tutors - join us!\n\nhttps://x.ai/careers"
},
{
    "time": "2024-04-13T02:09:00.000Z",
    "tweet_text": "Good deal",
    "repost_text": "𝕏 is offering the best deal for Verified Organizations for a limited time.\n\n• Basic - Spend $2,000, Get $2,000\n• Full Access - Spend $10,000, Get $10,000\n\nFor any business or brand on this platform, signing up for Verified Organizations is highly recommended."
},
{
    "time": "2024-04-13T01:50:45.000Z",
    "tweet_text": "Falcon 9 lands on the A Shortfall of Gravitas droneship – completing the first 20th launch and landing of a booster!"
},
{
    "time": "2024-04-13T01:51:58.000Z",
    "tweet_text": "Since its first mission in November 2020, this single first stage has launched eight astronauts and more than 500 satellites, totaling 261+ metric tons to orbit in under four years"
},
{
    "time": "2024-04-13T01:58:08.000Z",
    "tweet_text": "20th time the same booster has landed",
    "repost_text": "Falcon 9 lands on the A Shortfall of Gravitas droneship – completing the first 20th launch and landing of a booster!"
},
{
    "time": "2024-04-13T01:55:14.000Z",
    "tweet_text": "Grok-1.5 Vision",
    "repost_text": "\nhttps://x.ai/blog/grok-1.5v"
},
{
    "time": "2024-04-12T22:48:24.000Z",
    "tweet_text": "We identified an issue that caused Spaces hosts to get kicked out of the Space they were hosting on iOS. Unable to rejoin, the Space then ended.\n\nWe pushed a fix this morning addressing this issue, and it's now available to all iOS users. \n\nMake sure to update your app to 10.36.2…"
},
{
    "time": "2024-04-12T22:53:40.000Z",
    "tweet_text": "Thank you DoubleVerify for correcting your mistake regarding brand safety on this platform. \n\nWhen measured accurately, brand safety on 𝕏 is extremely good.",
    "repost_text": "X’s Brand Safety Rate exceeds 99% according to third-party analysis from DoubleVerify and Integral Ad Science.\n\nDoubleVerify, a company responsible for providing Brand Safety measurements to major advertisers, has been displaying an erroneous graphical error of X's Brand Safety…"
},
{
    "time": "2024-03-28T21:57:20.000Z",
    "tweet_text": "Boost your business with ad credit, 2x reach, affiliate badges, and hiring on X Verified Organizations.\n\nhttps://x.com/i/verified-orgs-signup…"
},
{
    "time": "2024-04-12T17:45:32.000Z",
    "tweet_text": "Over 100 million people watch vertical video on X every day. Reach a new audience with Vertical Video Ads, a full-screen, sound-on advertising experience that delivers a 7x higher engagement rate than Home Timeline. Learn more: https://business.x.com/en/products/vertical-video-ads.html…"
},
{
    "time": "2024-04-12T20:22:21.000Z",
    "tweet_text": "Supervised full self-driving now $99/month",
    "repost_text": "You can now subscribe to FSD (Supervised) for $99/month in the US\n\nhttp://ts.la/app \n\nUpgrades > Software Upgrades > Subscribe"
},
{
    "time": "2024-04-12T17:31:45.000Z",
    "tweet_text": "Wow",
    "repost_text": "Five years ago, I was the first and only active judge in Brazil to denounce the abuses of the Brazilian Supreme Court. \n\nIt was clear what would happen if Alexandre de Moraes continued in his position, so I decided to put my job and my livelihood at risk to warn the rest of the…"
},
{
    "time": "2024-04-12T17:10:40.000Z",
    "tweet_text": "To an exciting & inspiring future!"
},
{
    "time": "2024-04-12T17:08:27.000Z",
    "tweet_text": "Libertad!",
    "repost_text": "VIVA LA LIBERTAD CARAJO...!!!\n\nCC: @elonmusk"
},
{
    "time": "2024-04-12T14:24:44.000Z",
    "tweet_text": "And the appeal process is a sham",
    "repost_text": "𝕏 Brasil has filed many appeals, some of which have been pending for more than a year. There are 42 cases where they have filed appeals and received no response. Additionally, they have three motions for clarification awaiting a response. "
},
{
    "time": "2024-04-12T07:05:38.000Z",
    "tweet_text": "Tune in to our podcast with @elonmusk! It for sure has created some buzz!\nhttps://youtu.be/_rQBZ3vKRA0?si=20QQQpSFsuoBtFIN… via @YouTube"
},
{
    "time": "2024-04-12T03:30:21.000Z",
    "tweet_text": "Facts …",
    "repost_text": "If you're still advertising your brand on Meta platforms, you might want to see this"
},
{
    "time": "2024-04-12T03:26:59.000Z",
    "tweet_text": "Our advertising relevance has greatly improved",
    "repost_text": "I heard two anecdotes this week from advertisers getting their first strong ROI advertising on @X over the last month x.com/elonmusk/statu…"
},
{
    "time": "2024-04-12T02:51:18.000Z",
    "tweet_text": "I strongly recommend all the brands to advertise on 𝕏\n\n• On average, brands see +59% sales contributions (MMM) on 𝕏, compared to only +16% on total social media.\n\n• Users are engaging with the brands more than ever – +63% more likes, +20% reposts, +14% views, and +6% more…"
},
{
    "time": "2024-04-12T02:48:45.000Z",
    "tweet_text": "Advertise on 𝕏",
    "repost_text": "This trend of increasing ad costs and decreasing ROAS on Meta has been noticeable for a while and seems to only be worsening. Meta's decision to automate ad targeting with their pixel, is part of this problem. Pixels are getting weaker as we are moving away from cookies. Leaving… x.com/xDaily/status/…"
},
{
    "time": "2024-04-11T13:17:39.000Z",
    "tweet_text": "One of the few companies I don't mind getting invoices from.\n\nAdvertise on X.\nSubscribe to X premium.\nSupport defenders of freedom."
},
{
    "time": "2024-04-12T01:55:11.000Z",
    "tweet_text": "New Model S Plaid Sport Seats\n\nIf you know what high-G cornering means, these seats are for you\n\n- Increased lateral support\n- Modular seat architecture for comfort & support, plus same 12-way power adjust, heating & ventilation\n- High performance suede for increased grip &…"
},
{
    "time": "2024-04-12T01:47:56.000Z",
    "tweet_text": "Let’s see what the public thinks",
    "repost_text": "NEW POLL: Should Joe Biden and the FBI be able to spy on you without a warrant?"
},
{
    "time": "2024-04-12T01:40:00.000Z",
    "tweet_text": "The Model S & X Plaid (meaning, beyond ludicrous speed) are sublime",
    "repost_text": "BREAKING: Tesla has launched all-new Model S Plaid Sport Seats in North America.\n\nInfo:\n• Track-inspired bolstering with increased lateral support.\n• Seats have performance suede on the bolsters for increased grip & have exclusive Plaid composite décor in the center of…"
},
{
    "time": "2024-04-11T22:55:43.000Z",
    "tweet_text": "Community Notes will now show faster",
    "repost_text": "Community Notes got faster, yet again. We just rolled out an optimization to the scorer that shaves 30mins of the time it takes notes to go live.\n\nUnder the hood details: we moved some of the computation (e.g. the initial matrix factorization) into a prescoring step, which…"
},
{
    "time": "2024-04-11T19:07:08.000Z",
    "tweet_text": "Glad Tesla FSD was there to help and that you’re feeling well!",
    "repost_text": "My Crazy True Story\n\nOn April 1st, Tesla unlocked Full Self-Driving capability for all Tesla vehicles in America. In a moment of dire need, at 2:00 am the following morning, I found myself grappling with severe dehydration and a blood glucose level of 670 due to a malfunction in…"
},
{
    "time": "2024-04-11T15:35:36.000Z",
    "tweet_text": "Congrats SpaceX Team & @SpaceForceDoD on completing 3 orbital Vandenberg launches in 11 days!\n\nMight be a record.",
    "repost_text": "Liftoff of USSF-62 – SpaceX’s 12th National Security Space Launch on a Falcon rocket"
},
{
    "time": "2024-04-11T15:28:52.000Z",
    "tweet_text": "Tyranny",
    "repost_text": ".@ggreenwald highlights @elonmusk's opposition to Brazil's authoritarian censorship regime.\n\nThe censorship framework in Brazil mirrors tactics employed by the US government to suppress dissenting voices under the guise of combating disinformation.\n\n\"Any criticism of this judge…"
},
{
    "time": "2024-04-11T14:56:40.000Z",
    "tweet_text": "",
    "repost_text": "You’re just not going to see this level of entertainment anywhere else:"
},
{
    "time": "2024-04-11T12:18:35.000Z",
    "tweet_text": "\"My banking accounts were frozen, all my social media was under censorship and my passport has been cancelled. Just for a bunch of tweets. That's what we have been facing in Brazil.\" \n\nvia @MarioNawfal"
},
{
    "time": "2024-04-11T14:47:37.000Z",
    "tweet_text": "The severity of the censorship and the degree to which Brazil’s own laws are being broken, to the detriment of their own people, is the worst of any country in the world in which this platform operates.",
    "repost_text": "BRAZILIAN LAWMAKERS TAKE FIGHT FOR FREEDOM OF SPEECH TO EU  \n\nCongressmen Eduardo Bolsonaro, who was in our Space with Elon last night, has joined forces with Bia Kicis and Gustavo Gayer to bring their challenge against Lula's authoritarian grip on Freedom of Speech to the…  x.com/MarioNawfal/st…"
},
{
    "time": "2024-04-11T14:44:28.000Z",
    "tweet_text": "Accurate",
    "repost_text": "President Lula says he supports free speech, but he doesn't. He is, at this moment, demanding a censorship regime as severe as the one that has been in place in Cuba since the early 1960s."
},
{
    "time": "2024-04-11T10:56:00.000Z",
    "tweet_text": "True",
    "repost_text": " SENIOR BRAZILIAN OFFICIAL TO EU PARLIAMENT: BRAZIL IS AN EXPERIMENT OF FALSE DEMOCRACY\n\"Tyranny is like a virus. They always find a way to adapt.\nThey are learning how to do that with the Supreme Court, judiciary, executive, everything.\nThey adapted. Brazil is today the new…  x.com/MarioNawfal/st…"
},
{
    "time": "2024-04-11T06:19:16.000Z",
    "tweet_text": ""
},
{
    "time": "2024-04-11T06:13:53.000Z",
    "tweet_text": "Your support is much appreciated. Makes a difference.",
    "repost_text": "𝕏 has been fined $20,000 a day for fighting for free speech in Brazil.\n\nYou can support this platform by subscribing to 𝕏 Premium or 𝕏 Premium+\n\nSubscribing is the only way to ensure that such governments cannot demand censorship of this platform."
},
{
    "time": "2024-04-11T05:39:17.000Z",
    "tweet_text": "Interesting",
    "repost_text": "NPR, a taxpayer-funded news organization, used to be trusted but now, they’ve gone rogue. One senior editor, a classic liberal, says NPR corrupted itself in 2016. He admits NPR coped with Hillary’s loss by getting into bed with Adam Schiff. He says NPR pretended like the…"
},
{
    "time": "2024-04-10T23:47:35.000Z",
    "tweet_text": "Shutdown of a Raptor vacuum engine in slow motion. The engine’s nozzle is sized for use by Starship in the Earth’s upper atmosphere and outer space, so operation at sea level and low chamber pressures results in flow separation creating visible rings in the exhaust"
},
{
    "time": "2024-04-11T04:22:48.000Z",
    "tweet_text": "Sounds balanced … ",
    "repost_text": "BREAKING: NPR whistleblower reveals NPR's DC newsroom includes 87 registered Democrats and Zero (0) Republicans\n\n\"During a meeting, one of NPR’s best journalists said it was good we weren’t following the [Hunter] laptop story because it could help Trump.\"\n\nhttps://thefp.com/p/npr-editor-how-npr-lost-americas-trust…"
},
{
    "time": "2024-04-11T04:17:16.000Z",
    "tweet_text": "Exactly",
    "repost_text": " BREAKING: U.S. CONGRESS TO LOOK INTO BRAZILIAN LAW VIOLATIONS REGARDING 𝕏\n\nThe Brazilian government is attempting to ban 𝕏 in Brazil, jail 𝕏 employees in Brazil, and impose a $20,000 daily fine BECUASE @elonmusk and 𝕏 REFUSE to censor journalists in Brazil ILLEGALLY. x.com/elonmusk/statu…"
},
{
    "time": "2024-04-11T04:02:28.000Z",
    "tweet_text": "We were asked to suspend sitting members of the Brazilian parliament and many journalists",
    "repost_text": " LIVE WITH @ELONMUSK COVERING TWITTER FILES IN BRAZIL\n\nELON: \"Our concern here at X is that we are being asked to do things that are illegal. We are being asked to do things that directly violate the law by a judge.\n\nWe are being asked to suspend the account and filter…"
},
{
    "time": "2024-04-11T03:58:53.000Z",
    "tweet_text": "Exactly. Dictator @Alexandre.",
    "repost_text": " SENIOR BRAZILIAN OFFICIAL TO EU PARLIAMENT: BRAZIL IS A DICTATORSHIP\n\n\"There are hundreds and hundreds of political Prisoners.\n\nMany of you may think I'm talking about Nicaragua, maybe Cuba, or Venezuela.\n\nI'm talking about Brazil.\n\nAlexandre De Moraes ordered Twitter to…"
},
{
    "time": "2024-04-11T03:57:29.000Z",
    "tweet_text": "𝕏 just received an inquiry from the US House of Representatives regarding actions taken in Brazil that were in violation of Brazilian law.\n\nThere were hundreds, if not thousands.\n\nThis is getting spicy "
},
{
    "time": "2024-04-11T02:19:26.000Z",
    "tweet_text": "True"
},
{
    "time": "2024-04-10T21:43:27.000Z",
    "tweet_text": "𝕏 algorithm update coming soon with more bangers and less clickbait!"
},
{
    "time": "2024-04-10T17:48:49.000Z",
    "tweet_text": "Exactly",
    "repost_text": "Banning X accounts, with no due process, violates sections 8, 9, 17, 27, & 36 under Title II of the Fundamental Rights and Guarantees of the individual and collective under Brazil’s Constitution."
},
{
    "time": "2024-04-10T17:44:59.000Z",
    "tweet_text": "Looking forward to meeting with Prime Minister @NarendraModi in India!"
},
{
    "time": "2024-04-10T17:35:15.000Z",
    "tweet_text": "𝕏 respects the laws of Brazil and all countries in which we operate.\n\nWhen given an order to break the law, we must refuse.",
    "repost_text": "At the heart of this debate is our belief that some of the court orders we have received are not in line with the Marco Civil law or the Brazilian Federal Constitution.\n\nPeople should know why their account is blocked, or why they are being investigated, and given due process to…"
},
{
    "time": "2024-04-10T14:38:21.000Z",
    "tweet_text": "BREAKING: 𝕏 recorded a 43.4 million increase in unique visitors in March as compared to the previous month with a total of 1.6 billion unique visitors."
},
{
    "time": "2024-04-10T15:08:32.000Z",
    "tweet_text": "With Starlink, it feels like you’re on the ground, rather than in the air!",
    "repost_text": "When you walk aboard an @airBaltic flight with Starlink, the internet will just work  x.com/airBaltic/stat…"
},
{
    "time": "2024-04-10T07:01:37.000Z",
    "tweet_text": "Falcon 9 launches 23 @Starlink satellites to low-Earth orbit from Florida"
},
{
    "time": "2024-04-10T05:41:53.000Z",
    "tweet_text": "Engines full power and liftoff!"
},
{
    "time": "2024-04-10T13:35:52.000Z",
    "tweet_text": "You are most welcome ",
    "repost_text": "Dear @elonmusk ,heartfelt thanks for championing free speech in Brazil. Exciting news: as senators,we've greenlit a public hearing via our Security Committee (@senadofederal). We'd be honored to have you and Mr. @shellenberger to speak about the Twitter files scandals exposing…"
},
{
    "time": "2024-04-10T04:12:02.000Z",
    "tweet_text": "Brave man",
    "repost_text": "This was my speech at United Nations Headquarters, where I had the oportunity to tell to the world what is actually happening in Brazil. Since then, the “justice” has ordered an investigation against me, the most voted deputy of the country, only for saying that Lula is a corrupt…"
},
{
    "time": "2024-04-09T13:13:33.000Z",
    "tweet_text": "Reliable high-speed internet for space stations in orbit!",
    "repost_text": "Announcement: Haven-1 to be the world’s first commercial space station connected by SpaceX Starlink: https://vastspace.com/updates/vasts-haven-1-to-be-worlds-first-commercial-space-station-connected-by-spacex-starlink… @SpaceX @Starlink"
},
{
    "time": "2024-04-10T03:44:50.000Z",
    "tweet_text": "Precisely"
},
{
    "time": "2024-04-09T16:12:19.000Z",
    "tweet_text": "Quicksilver\n公路映画"
},
{
    "time": "2024-04-09T22:27:39.000Z",
    "tweet_text": "Accurate",
    "repost_text": "This article -- by a liberal long employed at NPR -- describes what happened in most media outlets since Trump's election: they explicitly renounced any journalistic function in favor of becoming political activists in defense of what they see as a greater cause than journalism: x.com/eyeslasho/stat…"
},
{
    "time": "2024-04-09T20:21:24.000Z",
    "tweet_text": "O governo brasileiro quer censurar as teorias da conspiração e ainda assim aqui está, espalhando teorias da conspiração: \" O governo brasileiro suspeita que os ataques de Elon Musk ao ministro Alexandre de Moraes e agora também diretamente ao presidente Lula estão sendo feitos em…"
},
{
    "time": "2024-04-09T22:17:23.000Z",
    "tweet_text": "Much appreciated",
    "repost_text": " BREAKING: BRAZILIAN GOV. COMMITTEE OFFICIALLY PRAISES ELON FOR “EXPOSING CENSORSHIP”\n\nThe Public Security Committee of the Chamber of Deputies APPROVED a motion of applause and praise for Musk for “exposing and facing political and unfounded censorship imposed by a Brazilian…"
},
{
    "time": "2024-04-09T18:20:06.000Z",
    "tweet_text": "And fast",
    "repost_text": "BREAKING: NPR is dying. "
},
{
    "time": "2024-04-09T13:50:27.000Z",
    "tweet_text": "Read this.\n\nNPR veteran describes the transformation of NPR from a news to an activist organization after Trump's election:\n\n\"During most of my tenure [at NPR], an open-minded, curious culture prevailed. We were nerdy, but not knee-jerk, activist, or scolding.\n\nIn recent years,…"
},
{
    "time": "2024-04-09T11:55:40.000Z",
    "tweet_text": "What are the odds? "
},
{
    "time": "2024-04-09T11:31:05.000Z",
    "tweet_text": "Tune in to our podcast with @elonmusk and hear his plans for moving mankind to Mars!"
},
{
    "time": "2024-04-09T11:26:40.000Z",
    "tweet_text": "Starlink now available in Albania!",
    "repost_text": "Starlink’s high-speed, low-latency internet is now available in Albania!  → http://starlink.com/map?country=AL"
},
{
    "time": "2024-04-09T03:45:35.000Z",
    "tweet_text": "The previous Brazilian government recognized @elonmusk's exceptional contributions to Brazil, regarding him as a true and cherished friend of the nation.",
    "repost_text": "Today, Brazil awarded @elonmusk with the Grand Cross of the Order of Merit — Congratulations! "
},
{
    "time": "2024-04-08T23:45:35.000Z",
    "tweet_text": "During today’s solar eclipse, >10 Megapack sites operating in ERCOT helped fill the >1GW energy void, ensuring the grid remained stable during the 4+ minute disruption of solar irradiance to solar sites across Texas"
},
{
    "time": "2024-04-09T01:19:02.000Z",
    "tweet_text": "How did @Alexandre de Moraes become the dictator of Brazil? He has Lula on a leash "
},
{
    "time": "2024-04-09T01:05:32.000Z",
    "tweet_text": "Great idea ",
    "repost_text": "Biden To Solve Poverty With One Trillion Dollar Per Hour Minimum Wage https://buff.ly/3dHTOsq"
},
{
    "time": "2024-04-09T00:45:01.000Z",
    "tweet_text": "The law applies to all, including @Alexandre. He should be on trial for his crimes.",
    "repost_text": "As a member of the Brazilian Congress who has been exposing and combatting the abuses of our Supreme Court for years, I want to express my deepest gratitude to @elonmusk.\n\nElon, you are currently aiding Brazil more than many members of the Brazilian House and Senate. You are…"
},
{
    "time": "2024-04-09T00:27:50.000Z",
    "tweet_text": "View of the eclipse from orbit"
},
{
    "time": "2024-04-08T20:05:29.000Z",
    "tweet_text": "The AI compute growth chart says it all",
    "repost_text": "ELON: AI MAY BE SMARTER THAN ANY ONE HUMAN BY END OF NEXT YEAR\n\n\"AI is the fastest advancing technology I've seen of any kind, and I've seen a lot of technology.\n\nAI hardware and computers that are coming online dedicated to AI are increasing by a factor of 10 every year, if not…"
},
{
    "time": "2024-04-08T18:00:22.000Z",
    "tweet_text": "“Continuávamos recebendo essas exigências do juiz Alexandre para suspender as contas dos parlamentares e dos principais jornalistas. Não podíamos dizer a eles que isso era a mando do Alexandre, tínhamos que fingir que era devido às nossas regras” \n\n一 Elon Musk"
},
{
    "time": "2024-04-08T19:44:34.000Z",
    "tweet_text": "Was cool to see the eclipse from Austin. ~27 years before it happens here again."
},
{
    "time": "2024-04-08T18:03:38.000Z",
    "tweet_text": "𝕏 supports the people of Brazil, without regard to political affiliation. \n\nDoes Judge @Alexandre?",
    "repost_text": "Glenn Greenwald Rants About Brazil's Alexandre De Moraes' Authoritarian Censorship Regime Citing The New York Times\n\n\"The Brazilian left hated him until he took on the role of chief censor and began censoring, apparently, almost everybody who the Brazilian left regarded as their…"
},
{
    "time": "2024-04-08T17:14:41.000Z",
    "tweet_text": "[Scene: @Alexandre & @ElonMusk in psychoanalysis]\n\nI say, “Tell me, Alexandre, is the disinformation in the room with us now?”",
    "repost_text": "Elon Musk Is All That Stands In The Way Of Totalitarianism\n\nLast night, around 8 p.m. local time in São Paulo, Brazil, Federal Supreme Court Justice Alexandre de Moraes announced a criminal investigation into Elon Musk, the owner of X, formerly known as Twitter, for allegedly…"
},
{
    "time": "2024-04-08T17:09:42.000Z",
    "tweet_text": "This is the heart of the problem. What say you @Alexandre?\n\nLet us debate this in the open.",
    "repost_text": "\"We kept getting these demands from Judge Alexandre to suspend accounts of sitting members of the parliament and major journalists. We could not tell them that this was at the behest of Alexandre, we had to pretend that it was due to our rules\" \n\n一 Elon Musk"
},
{
    "time": "2024-04-08T17:07:37.000Z",
    "tweet_text": "Yes",
    "repost_text": "JPMorgan Chase CEO Jamie Dimon says he worries geopolitical events and U.S. political polarization \"may very well be creating risks that could eclipse anything since World War II.\"\n https://cbsn.ws/3xzV5PE"
},
{
    "time": "2024-04-08T15:40:20.000Z",
    "tweet_text": "Accurate",
    "repost_text": "Let's talk about the report that exposed Brazil's \"aggressive censorship,\" Elon Musk's refusal to comply, and what it means for the world\nhttps://notthebee.com/t99a1\nhttps://notthebee.com/t99a1"
},
{
    "time": "2024-04-08T03:13:03.000Z",
    "tweet_text": "\"I am sticking to my principles!\n\nAs for any fake advocacy groups who seek to suppress free speech, they should remember that karma is real.\"\n\n— Elon Musk"
},
{
    "time": "2024-04-08T02:44:50.000Z",
    "tweet_text": "They want to stack the deck",
    "repost_text": "Brazil’s present is our future if Democrats achieve their dream of packing the Supreme Court."
},
{
    "time": "2024-04-07T23:27:30.000Z",
    "tweet_text": "Falcon 9’s first stage has landed on Landing Zone 1 – completing the 14th launch and landing for this first stage booster"
},
{
    "time": "2024-04-07T22:25:13.000Z",
    "tweet_text": "Using a VPN is very easy",
    "repost_text": "Using VPN is very easy.\n\nSimply download a VPN app of your choice, launch it, and connect to your preferred location.\n\nOnce it's activated and connected, you'll be able to access any app that is otherwise restricted in your region."
},
{
    "time": "2024-04-07T22:16:45.000Z",
    "tweet_text": "T-1 hour until Falcon 9’s launch of the Bandwagon-1 mission from Launch Complex 39A in Florida"
},
{
    "time": "2024-04-07T21:43:38.000Z",
    "tweet_text": "To ensure that you can still access the 𝕏 platform, download a virtual private network (VPN) app",
    "repost_text": "Friends in Brazil, get a VPN. x.com/goddeketal/sta…"
},
{
    "time": "2024-04-07T21:04:47.000Z",
    "tweet_text": "These are the most draconian demands of any country on Earth!",
    "repost_text": "Elon Musk Says X Will Defy Order From Brazil's Supreme Court After Twitter Files https://zerohedge.com/political/elon-musk-says-x-will-defy-order-brazils-supreme-court-after-twitter-files…"
},
{
    "time": "2024-04-07T16:33:09.000Z",
    "tweet_text": "Well said",
    "repost_text": "Too many people don’t get it\n\nNo free speech means retards in our government can do whatever they want\n\nYou can’t even complain, you just bend over and smile"
},
{
    "time": "2024-04-07T15:30:22.000Z",
    "tweet_text": "More Starlink DTC satellites rolling out",
    "repost_text": "View of last night's deployment of 21 @Starlink satellites, six of which have Direct to Cell capabilities that help eliminate mobile network dead zones around the world → http://starlink.com/business/direct-to-cell…"
},
{
    "time": "2024-04-07T15:29:03.000Z",
    "tweet_text": "This is crazy, as it makes fraud impossible to detect",
    "repost_text": "42 out of 50 states in the United States do not require a photo ID to vote. \n\nCountries that require a photo ID to vote:\n\nUK\nItaly\nChile\nSpain\nMalta\nBrazil\nIsrael\nLatvia\nRussia\nFrance\nMexico\nAustria\nIreland\nPoland\nGreece\nCroatia\nFinland\nEstonia\nBelgium\nSweden\nBulgaria\nPortugal…"
},
{
    "time": "2024-04-07T15:15:37.000Z",
    "tweet_text": "Grok 一 $8 per month (𝕏 Premium )\n\nChatGPT-4 一 $20 per month\n\nGrok is real-time while ChatGPT-4 is outdated."
},
{
    "time": "2024-04-07T14:31:51.000Z",
    "tweet_text": "Discussion with head of Norway’s sovereign fund, @NicolaiTang1"
},
{
    "time": "2024-04-07T13:39:39.000Z",
    "tweet_text": "This is all accurate.",
    "repost_text": "BRAZIL IS ON THE BRINK\n\nI’m reporting to you from Brazil, where a dramatic series of events are underway.\n\nAt 5:52 pm Eastern Time, today, April 6, 2024, X corporation, formerly known as Twitter, announced that a Brazilian court had forced it to “block certain popular accounts in…"
},
{
    "time": "2024-04-07T04:19:02.000Z",
    "tweet_text": "Falcon 9 launches 21 @Starlink satellites – including six with Direct to Cell capabilities – to orbit from California following the first successful demo of Direct to Cell texting in early 2024"
},
{
    "time": "2024-04-07T01:21:18.000Z",
    "tweet_text": "Edited version",
    "repost_text": "Here's an edit of @elonmusk's recent talk at @SpaceX.\n\nThis version boosts audio quality and removes pauses & dead space, saving time by 40%.\n\nThank you @DavidCarbutt_ for the work!"
},
{
    "time": "2024-04-06T22:20:14.000Z",
    "tweet_text": "For the people of Earth"
},
{
    "time": "2024-04-06T22:03:47.000Z",
    "tweet_text": "This aggressive censorship appears to violate the law & will of the people of Brazil",
    "repost_text": "TWITTER FILES - BRAZIL\n\nBrazil is engaged in a sweeping crackdown on free speech led by a Supreme Court justice named Alexandre de Moraes.\n\nDe Moraes has thrown people in jail without trial for things they posted on social media. He has demanded the removal of users from social…"
},
{
    "time": "2024-04-06T22:01:48.000Z",
    "tweet_text": "Why are you doing this @alexandre?",
    "repost_text": "X Corp. has been forced by court decisions to block certain popular accounts in Brazil. We have informed those accounts that we have taken this action. \n\nWe do not know the reasons these blocking orders have been issued. \n\nWe do not know which posts are alleged to violate the…"
},
{
    "time": "2024-04-06T19:00:16.000Z",
    "tweet_text": "Soon"
},
{
    "time": "2024-04-06T17:59:08.000Z",
    "tweet_text": "Update on making life multiplanetary",
    "repost_text": "At Starbase, @ElonMusk provided an update on the company’s plans to send humanity to Mars, the best destination to begin making life multiplanetary"
},
{
    "time": "2024-04-06T17:47:03.000Z",
    "tweet_text": "Best deal in town!",
    "repost_text": "On 𝕏, the average cost per ad click is only $0.38, lowest as compared to other platforms."
},
{
    "time": "2024-04-06T17:34:41.000Z",
    "tweet_text": "I wrote this 8 years ago"
},
{
    "time": "2024-04-06T12:24:58.000Z",
    "tweet_text": "Rise & fall of the first civilization"
},
{
    "time": "2024-04-05T09:21:45.000Z",
    "tweet_text": "275th landing of a Falcon 9 rocket complete as the first stage safely lands on the A Shortfall of Gravitas droneship"
},
{
    "time": "2024-04-06T05:54:18.000Z",
    "tweet_text": "This needs to stop",
    "repost_text": "Illegal migrant deported 8 times with 11 arrests now charged with murder in Ohio: 'Our border is broken' https://trib.al/NEldE11"
},
{
    "time": "2024-04-06T02:51:34.000Z",
    "tweet_text": "Hell on Earth",
    "repost_text": "Additional views from today’s Super Heavy static fire"
},
{
    "time": "2024-04-06T00:54:36.000Z",
    "tweet_text": "Getting ready for Flight 4",
    "repost_text": "Static fire of the Flight 4 Super Heavy booster"
},
{
    "time": "2024-04-05T23:21:47.000Z",
    "tweet_text": "We should always judge people as individuals, even if a stereotype is statistically correct, but it is particularly absurd to have a statistically wrong stereotype!",
    "repost_text": "But wait, the denial gets even more bizarre: White liberals now also believe that white people are more violent than blacks.\n\nFact check: In the year in which white liberals expressed this opinion, blacks committed murder at a rate 11 times higher than non-Hispanic whites.  x.com/eyeslasho/stat…"
},
{
    "time": "2024-04-05T23:07:08.000Z",
    "tweet_text": "Congrats Tesla AI team!",
    "repost_text": "Hit >1 billion miles driven on FSD"
},
{
    "time": "2024-04-05T21:37:23.000Z",
    "tweet_text": "Too much of the environmentalist movement has morphed into a human extinctionist movement"
},
{
    "time": "2024-04-05T21:14:45.000Z",
    "tweet_text": "Without freedom of speech, we are just a slaves in the matrix",
    "repost_text": "Babylon Bee CEO Seth Dillon says a lot of things. This time, it's an important message about the battle against censorship."
},
{
    "time": "2024-04-05T20:54:29.000Z",
    "tweet_text": "This psy op is doing real numbers!",
    "repost_text": " New: Biden Admin Sets World Record For Illegals Entering The Country:                           \n\nThis graph should be alarming to anyone who prioritizes the safety and security of The United States and its citizens.\n\n•  Orange indicates single adults.\n\n•  Blue indicates…"
},
{
    "time": "2024-04-05T20:49:23.000Z",
    "tweet_text": "Tesla Robotaxi unveil on 8/8"
},
{
    "time": "2024-04-05T17:17:52.000Z",
    "tweet_text": "The highest form of kindness and empathy is to defend Truth.  It's Epistemological Kindness, Epistemological Empathy.  If you see the TRUTH being raped and murdered and you walk away pretending that you saw nothing, you are an existential coward.  Professors are tasked with…"
},
{
    "time": "2024-04-05T16:31:57.000Z",
    "tweet_text": "Use the  Explore Page to get all the real-time customized news summarized by Grok."
},
{
    "time": "2024-04-05T15:56:30.000Z",
    "tweet_text": "Press the search button  to see real-time customized news for you created by Grok AI"
},
{
    "time": "2024-04-05T15:46:09.000Z",
    "tweet_text": "Reuters is dying",
    "repost_text": "Reuters is lying because Reuters is dying. "
},
{
    "time": "2024-04-05T08:43:36.000Z",
    "tweet_text": "Yeah",
    "repost_text": "Our minds are constantly under attack, it is critical humanity develop some sort of evolved information immune system.\n\nI used to think:\n\nThere is nothing a teacher or anyone else for that matter could have said to change my sexual orientation or feelings about my gender. I…"
},
{
    "time": "2024-04-05T08:40:34.000Z",
    "tweet_text": "Important improvement",
    "repost_text": "Contributors’ time is valuable and best spent reviewing high quality notes. We just rolled out an update to boost the quality of proposed notes by making it easier for accounts to lose writing ability if their notes are found Not Helpful by people from wide-ranging points of…"
},
{
    "time": "2024-04-05T07:07:59.000Z",
    "tweet_text": "Flight 4 next month",
    "repost_text": "Starship's third flight test was a step towards a rapidly reusable future"
},
{
    "time": "2024-04-05T05:23:08.000Z",
    "tweet_text": "Coming soon, Grok will offer “Unhinged Mode” news ",
    "repost_text": "Grok now summarizes all the trending news and topics.\n\nYou can access it from the explore page and Grok's home screen."
},
{
    "time": "2024-04-05T05:02:27.000Z",
    "tweet_text": "Bet you didn’t know that this administration is flying hundreds of thousands of illegals into America using your tax dollars …",
    "repost_text": "/2 On January 5, 2023, President Biden and DHS Secretary Antonio Mayorkas announced the creation of the unprecedented new program to allow 30,000 aliens from Cuba, Haiti, Nicaragua, and Venezuela to fly into the country EVERY MONTH."
},
{
    "time": "2024-04-04T17:38:30.000Z",
    "tweet_text": "Daily Show ",
    "repost_text": "\"The truth about DEI is that although it's well-intentioned, it's mostly garbage.\" @cthagod"
},
{
    "time": "2024-04-04T16:47:35.000Z",
    "tweet_text": "This is crazy!",
    "repost_text": "Foreign-born population growth:\n\nBarack Obama: 68,000 per month\nDonald Trump: 42,000 per month\nJoe Biden: 172,000 per month"
},
{
    "time": "2024-04-04T16:32:49.000Z",
    "tweet_text": "Yes",
    "repost_text": "a blue checkmark is a stamp of authenticity\n\nthis is obvious when comparing \"Verified followers\" and regular \"Followers\" tabs (on all profiles)\n\nit became even more obvious when I enabled verified-only DMs, the spam stopped overnight and only get message requests from real users"
},
{
    "time": "2024-04-04T16:02:26.000Z",
    "tweet_text": "NEWS: EV sales hit record high in Australia in March, as Tesla Model Y overtakes Toyota Hilux."
},
{
    "time": "2024-04-04T15:03:57.000Z",
    "tweet_text": "This momentum will increase dramatically as we integrate AI-generated news trends & search into 𝕏",
    "repost_text": "𝕏 is replacing the mainstream news media. "
},
{
    "time": "2024-04-04T14:58:40.000Z",
    "tweet_text": "System purge of bots & trolls underway. \n\nPlease reply to me or @XEng if legitimate accounts are suspended. \n\nX Corp will be tracing the people responsible and bringing the full force of the law to bear upon them."
},
{
    "time": "2024-04-04T07:47:30.000Z",
    "tweet_text": "Did you know that it costs as little as 3 cents per ad click on this platform?\n\nMake sure your ad is interesting and clear, just like a viral post would be and the results will amaze you."
},
{
    "time": "2024-04-03T20:36:14.000Z",
    "tweet_text": "X is redefining video, one pixel at a time.\n\nWe’ve upgraded our infrastructure and are shipping new updates to improve video.\n\n80% of users consume video on X every day. And almost 70% of all users who watch videos are also scrolling through conversations."
},
{
    "time": "2024-04-04T03:36:32.000Z",
    "tweet_text": "I’m cool with adults doing whatever they want, so long as it doesn’t harm others, but kids need to be protected at all costs",
    "repost_text": "The vast majority of gender-confused or \"gender-questioning\" children grow out of it, according to a 15-year longitudinal study conducted in the Netherlands, which tracked more than 2,700 children from the age of 11 to their mid-20s. \n\nBeing transgender is a trend -- it's a phase…"
},
{
    "time": "2024-04-03T23:25:48.000Z",
    "tweet_text": "𝕏 has just released the latest data and numbers:\n\n• ~3 million calls were made on 𝕏 in the last month\n\n• Over 2 million 𝕏 Spaces were created last month with over 2.4 million hrs of content\n\n• 6.4 million Spaces created this year\n\n• Members are spending 495% more time in…"
},
{
    "time": "2024-04-04T00:06:05.000Z",
    "tweet_text": "Community Notes now active on India!",
    "repost_text": "Welcome new contributors in India \n\nOur first contributors are joining today, and we’ll be expanding over time. As always, we’ll monitor quality to ensure that notes are found helpful by people from different points of view.\n\nCommunity Notes now has contributors in 69…"
},
{
    "time": "2024-04-03T22:04:24.000Z",
    "tweet_text": "This will be the first commercial space walk!",
    "repost_text": "The Polaris Dawn Dragon is headed to vacuum chamber testing! SpaceX teams celebrate Dragon's departure with @rookisaacman, @KiddPoteet, @Gillis_SarahE, and @annawmenon ahead of launching to orbit this summer"
},
{
    "time": "2024-04-01T19:23:21.000Z",
    "tweet_text": "𝕏 > Instagram, TikTok, Facebook"
},
{
    "time": "2024-04-03T04:26:38.000Z",
    "tweet_text": "𝕮𝖔𝖘𝖒𝖎𝖈 𝕮𝖍𝖗𝖔𝖓𝖎𝖈𝖑𝖊𝖘\nSpaceX Achieves Ambitious Goal: 12 Falcon 9 Missions in a Single Month\n\nIn pursuit of its ambitious objective to conduct 150 missions in 2024, SpaceX has reached a significant milestone by completing 12 Falcon 9 missions in a single month. SpaceX…"
},
{
    "time": "2024-04-03T14:16:50.000Z",
    "tweet_text": "That is indeed what I’ve said many times",
    "repost_text": "\"I think we should significantly increase legal immigration. If someone has a track record of working hard & hasn’t committed crimes, they should be welcomed.\n\nI’m just against a massive number of unvetted people flooding into America, which any rational person should be.\""
},
{
    "time": "2024-04-03T14:11:52.000Z",
    "tweet_text": "Traffic on 𝕏 reaches all-time high"
},
{
    "time": "2024-04-03T07:20:50.000Z",
    "tweet_text": "Nelson Peltz should definitely be on the Disney board!\n\nHe would help reform the company, improve the quality of product and generally serve in the best interests of shareholders, as he has done at many other companies. \n\nThis would significantly improve Disney’s share price.",
    "repost_text": "There have been a few recent articles in the press about @Disney 'winning' its proxy contest with Nelson Peltz based on early election returns that have been leaked to the media.  We don't have an investment in Disney, but I thought it useful to point out the inappropriateness of…"
},
{
    "time": "2024-04-03T07:22:52.000Z",
    "tweet_text": "While I don’t own any Disney shares today, I would definitely buy their shares if Nelson were elected to the board. \n\nHis track record is excellent."
},
{
    "time": "2024-04-03T06:31:07.000Z",
    "tweet_text": "The legacy media is dying",
    "repost_text": "BREAKING: Bloomberg is dying. \n\nMedia sites are continuously experiencing a decline in traffic."
},
{
    "time": "2024-04-03T06:17:23.000Z",
    "tweet_text": "Time spent on 𝕏 Communities has grown +600% in the past year – with more than double the number of active Communities."
},
{
    "time": "2024-04-03T05:46:43.000Z",
    "tweet_text": "Seriously ",
    "repost_text": "California building 5 feet of high speed rail"
},
{
    "time": "2024-04-03T03:57:18.000Z",
    "tweet_text": "Accurate \n\nGrok is a lot better, but still work to do",
    "repost_text": "AI query pipeline:\n\n- User submits query\n- Preprocessor #1 removes misinformation\n- Preprocessor #2 removes hate speech\n- Preprocessor #3 removes climate denial\n- Preprocessor #4 removes non-far-left political leaning\n- Preprocessor #5 removes non-expert statements\n- Preprocessor…"
},
{
    "time": "2024-04-02T19:28:24.000Z",
    "tweet_text": "Extremely concerning",
    "repost_text": "H O L Y   S H I T\n\nThe number of voters registering without a photo ID is SKYROCKETING in 3 key swing states:\n\nArizona, Texas, and Pennsylvania. \n\nSince the start of 2024:\n\nTX: 1,250,710\nPA: 580,513\nAZ: 220,731\n\nHAVV allows voters to register with a Social Security Number (4…"
},
{
    "time": "2024-04-02T19:26:48.000Z",
    "tweet_text": "In case you thought government trying to force home sales for “asylum seekers” was a myth, this is already happening in Britain!"
},
{
    "time": "2024-04-02T06:38:13.000Z",
    "tweet_text": "We live on stolen land. \n\nBy “we”, I mean us mammals. \n\nWe stole it from the dinosaurs  "
},
{
    "time": "2024-04-01T07:37:58.000Z",
    "tweet_text": "Excited to join @Disney as their Chief DEI Officer. \n\nCan’t wait to work with Bob Iger & Kathleen Kennedy to make their content MORE woke!\n\nEven the linguini."
},
{
    "time": "2024-04-02T06:23:51.000Z",
    "tweet_text": "Can’t wait for Toy Story 5 & two more Moana movies. Yay …"
},
{
    "time": "2024-04-02T04:10:05.000Z",
    "tweet_text": "Falcon 9 launches from pad 4E in California, adding 22 new @Starlink satellites to the constellation"
},
{
    "time": "2024-04-02T02:25:01.000Z",
    "tweet_text": "Watch Falcon 9 launch 22 @Starlink satellites to orbit"
},
{
    "time": "2024-04-01T19:15:45.000Z",
    "tweet_text": "",
    "repost_text": "CNN Publishes Real News Story For April Fools' Day https://buff.ly/2wThtVd"
},
{
    "time": "2024-04-01T18:59:19.000Z",
    "tweet_text": "Whoa, this documentary of New York is intense!"
},
{
    "time": "2024-04-01T17:12:11.000Z",
    "tweet_text": "Congratulations to @swissloop_t for winning the 2024 Not-a-Boring Competition!   Dug to victory with a novel extruded tunnel liner.  \n\nThanks and congrats to all teams who participated. Hope to see you again next year!"
},
{
    "time": "2024-04-01T18:49:56.000Z",
    "tweet_text": "So many April Fool’s jokes that are actually plausible given the increasingly insane real things happening in the world!"
},
{
    "time": "2024-04-01T15:58:59.000Z",
    "tweet_text": "Starlink helps fund humanity getting to Mars",
    "repost_text": "Reliable high-speed internet, even where you least expect it. \n\nStarlink app updated with Mars mode  "
},
{
    "time": "2024-04-01T07:25:19.000Z",
    "tweet_text": "",
    "repost_text": "They want a state monopoly on fake news"
},
{
    "time": "2024-03-30T02:54:22.000Z",
    "tweet_text": "When you look out the window of the SpaceX Crew Dragon Capsule and see the International Space Station  \n\nVideo by NASA SpaceX Crew 6 member Sultan Al Neyadi."
},
{
    "time": "2024-03-31T05:45:58.000Z",
    "tweet_text": "~3.5 hours later, Falcon 9 launched 23 @Starlink satellites to low-Earth orbit from pad 40, completing our 260th reflight of an orbital class rocket on the seven-year anniversary of first achieving this feat"
},
{
    "time": "2024-03-31T01:31:18.000Z",
    "tweet_text": "Liftoff of Falcon 9, marking 260 reflights of Falcon boosters since our first one seven years ago today!"
},
{
    "time": "2024-03-31T00:35:50.000Z",
    "tweet_text": "At 5000 tons, Starship is the largest flying object ever made. Thrust is more than double the Saturn V moon rocket.\n\nIt is the first spaceship design capable of making life multiplanetary.\n\nGoal of the next mission is to make it through the meteorically extreme heat of reentry.",
    "repost_text": "Watch Starship’s third flight test → http://spacex.com/launches https://twitter.com/i/broadcasts/1LyxBnOvzvOxN…"
},
{
    "time": "2024-03-30T23:46:40.000Z",
    "tweet_text": "SpaceX aiming for 3 launches today! One Eutelsat, which just reached orbit, and 2 @Starlink missions."
},
{
    "time": "2024-03-30T19:27:03.000Z",
    "tweet_text": "History is complicated"
},
{
    "time": "2024-03-30T23:31:29.000Z",
    "tweet_text": "It gets particularly interesting when you trace to source documents"
},
{
    "time": "2024-03-30T22:48:19.000Z",
    "tweet_text": "Everyone can make calls on 𝕏 without having to share their phone number.\n\nGo to Settings ➤ Privacy & Safety ➤ Direct Messages  ➤ Enable Audio & Video Calling."
},
{
    "time": "2024-03-30T17:21:06.000Z",
    "tweet_text": "The 2024 Not-a-Boring Competition is heating up...24 hours till the race begins!"
},
{
    "time": "2024-03-30T01:14:07.000Z",
    "tweet_text": "Oh hi youtube "
},
{
    "time": "2024-03-30T01:05:26.000Z",
    "tweet_text": "Yup",
    "repost_text": "“What’s going on with white males between 18-25?!”"
},
{
    "time": "2024-03-29T14:22:02.000Z",
    "tweet_text": "Your subscription go 𝕏 Premium and Premium+ supports the following:\n\nFree speech. \n\nWhat you get (based on your subscription tier):\n- monetization\n- heightened engagement \n- ad-free timeline\n- a cool checkmark\n- long video uploads\n- access to Grok, Articles, other upcoming…",
    "repost_text": "Support this platform by Subscribing to X Premium +"
},
{
    "time": "2024-03-29T14:29:38.000Z",
    "tweet_text": "I see a lot of people complaining about spam in their replies etc. \n\nI’ve had my settings for notifications set up like this for over a year now and it is SO GOOD.\n\nHere’s how you do it: \n\nSettings >>Notifications >> Filters >> Quality Filter  >> Muted Notifications \n…"
},
{
    "time": "2024-03-30T00:10:27.000Z",
    "tweet_text": "As always, suggestions for improving Community Notes are much appreciated. \n\nThe aspiration of this platform is to be by far the best source of truth on Earth. Nothing will ever be perfect, but we shall strive to be less wrong every day.",
    "repost_text": "We’ve updated Topic Models to utilize a larger set of early rating data. This allows them to produce higher confidence scores earlier in the process of ratings arriving. Update in GitHub: https://github.com/twitter/communitynotes/commit/cd73aa933858c1ce03e325a217b1827da27ddd05…"
},
{
    "time": "2024-03-30T00:07:39.000Z",
    "tweet_text": "Supporting your right to freedom of speech",
    "repost_text": "X is funding a lawsuit filed today by Chloe Happe against her former employer, Block.\n\nBlock fired Chloe because of the political opinions she expressed on X. Chloe had two pseudonymous accounts on X, @bronzeageshawty and the now-deprecated @samsarashawty.  She did not reference…"
},
{
    "time": "2024-03-29T21:48:51.000Z",
    "tweet_text": "Today, 𝕏 started paying for ads appearing on profiles as well.\n\nHere's a comparison of payouts for some 𝕏 creators compared to their last payouts. There is a significant boost in their earnings."
},
{
    "time": "2024-03-29T20:28:57.000Z",
    "tweet_text": "Congrats Tesla Team!",
    "repost_text": "Produced our 6 millionth car!\n \nThank you to our owners & teams around the world for your support & hard work—it truly matters.\n \n"
},
{
    "time": "2024-03-29T20:00:49.000Z",
    "tweet_text": "Meta was also falsely claiming credit for sales that actually originated from 𝕏",
    "repost_text": "Facebook & Instagram advertisers have filed a $7 billion lawsuit against Meta, accusing the company of exaggerating ad viewership metrics by up to 400%."
},
{
    "time": "2024-03-29T10:15:38.000Z",
    "tweet_text": "Should be available on 𝕏 next week. \n\nGrok 2 should exceed current AI on all metrics. In training now.",
    "repost_text": "https://x.ai/blog/grok-1.5"
},
{
    "time": "2024-03-29T09:43:49.000Z",
    "tweet_text": "The first condition of progress is the removal of censorship.\n- Durant"
},
{
    "time": "2024-03-28T22:27:48.000Z",
    "tweet_text": "Modern Western civilization has extraordinary empathy compared to its power. This is also arguably its greatest weakness.\n\nWith the nuclear bomb, America could have subjugated every nation on Earth with ease. Hitler and Stalin would certainly have done so.\n\nInstead, America…",
    "repost_text": "And there are many parasitical strategies that use a person's empathy against them. Sometimes these develop into entire political/ideological movements, where the population's empathy becomes an attack vector that the unscrupulous can exploit for gain. x.com/elonmusk/statu…"
},
{
    "time": "2024-03-28T21:59:35.000Z",
    "tweet_text": "Many upgrades to 𝕏 Communities!",
    "repost_text": "Hello, friends! Check out the latest updates and improvements for X Communities.\n\nUpdates (With the latest version of the app):\n- [All] Admins can now add topics to their Communities, and you can see topics linked to Communities on all devices.\n- [All] Soon, NSFW content will…"
},
{
    "time": "2024-03-28T21:17:51.000Z",
    "tweet_text": "Amen",
    "repost_text": "It blows my mind that there are actual movements of people whose stated ambitions would literally end humanity.\n\nThese groups are able to recruit using fear and anger. You know, like the dark side of the force? \n\nRather than lift up the damaged, they reinforce a victim mentality,…"
},
{
    "time": "2024-03-28T20:55:58.000Z",
    "tweet_text": "Something is deeply wrong with the justice system",
    "repost_text": "A thug with 7 prior arrests punched a lady directly in the face last week in Brooklyn.\n\nThe man fractured her face, permanently damaged her lip, and knocked out teeth.\n\nFranz Jeudy is already out on the streets. \n\nHe was released without bail."
},
{
    "time": "2024-03-28T20:48:56.000Z",
    "tweet_text": "I favor empathy, but the assumption that empathy will always be reciprocated is false",
    "repost_text": "I wrote an article recently about Cultural Theory of Mind, specifically that the West lacks it.  The West thinks that some of the values it views as laudable will be perceived by others similarly whereas in many instances these are viewed as signs of weakness ripe for…"
},
{
    "time": "2024-03-28T20:45:23.000Z",
    "tweet_text": "Many movies exist about a lone inventor in a garage having a eureka moment, but almost none about manufacturing, so it’s underappreciated by the public.\n\nCompared to the insane pain of reaching high-volume, positive-margin production, prototypes are a piece of cake.",
    "repost_text": "A million movies about cars. But hardly any movie about Manufacturing.\n\nSomeone should make a movie and tell the world that how hard it is to do high volume manufacturing."
},
{
    "time": "2024-03-28T19:23:14.000Z",
    "tweet_text": "Why Political Advertisers should choose X?\n\n• This year, 𝕏 had 1,000 likes per second, 5 million impressions per minute, and more than 9 billion total engagements on posts covering News & Politics.\n\n• 84% of US policy and opinion leaders actively engage with voters across 𝕏's…"
},
{
    "time": "2024-03-28T19:18:33.000Z",
    "tweet_text": "Yup",
    "repost_text": " BORDER CRISIS COVER-UP? \n\n“The Biden administration is flying migrants into the US ‘so that the border doesn’t look as out of control.’”\n\nhttps://nypost.com/2024/03/27/us-news/border-patrol-union-prez-warns-biden-deflating-border-numbers-by-flying-migrants-into-us-predicts-mass-amnesty-bait-and-switch/…"
},
{
    "time": "2024-03-28T12:10:34.000Z",
    "tweet_text": "The Dem Party goal is to import voters",
    "repost_text": "BIDEN CONSIDERING GRANTING AMNESTY, HANDING OUT GREEN CARDS TO ILLEGAL IMMIGRANTS (Daily Caller)\n\nPresident Joe Biden is currently considering granting amnesty to illegal migrants in a bid to act on the worsening immigration crisis, according to Politico.\n\nBiden and his…"
},
{
    "time": "2024-03-28T12:04:09.000Z",
    "tweet_text": "If you support free speech, get a premium subscription.",
    "repost_text": "Thank you. Subscribing is the only way to ensure that major brand advertisers cannot demand censorship of this platform. x.com/TaraBull808/st…"
},
{
    "time": "2024-03-28T12:01:46.000Z",
    "tweet_text": "Interesting",
    "repost_text": "I wrote an article recently about Cultural Theory of Mind, specifically that the West lacks it.  The West thinks that some of the values it views as laudable will be perceived by others similarly whereas in many instances these are viewed as signs of weakness ripe for…"
},
{
    "time": "2024-03-28T12:00:42.000Z",
    "tweet_text": "Thank you. Subscribing is the only way to ensure that major brand advertisers cannot demand censorship of this platform.",
    "repost_text": "Everyone should have a blue check, it pays for itself in the long run and is a small donation to free speech. Thank you, @elonmusk, for all you do.  x.com/elonmusk/statu…"
},
{
    "time": "2024-03-28T11:45:57.000Z",
    "tweet_text": "",
    "repost_text": "How to share a post from X to the Instagram modeling agency:"
},
{
    "time": "2024-03-28T11:42:24.000Z",
    "tweet_text": "New York taxes citizens and gives the money to illegals",
    "repost_text": "New York City begins giving illegal immigrants prepaid debit cards as part of $53 million pilot program https://trib.al/k6johET"
},
{
    "time": "2024-03-28T11:34:36.000Z",
    "tweet_text": "This video speaks for itself",
    "repost_text": "Freeloading migrant influencer mocks US taxpayers who 'work like slaves' while waving cash in latest videos https://trib.al/xruPLof"
},
{
    "time": "2024-03-28T11:33:54.000Z",
    "tweet_text": "Failure to prosecute crime in New York (and many other US cities) allows violent criminals to assault women at will!\n\nThe governor had to call out the national guard just so people could ride the subway.",
    "repost_text": "There has been a recent trend of women in NYC getting randomly approached by men in broad daylight and punched in the face resulting in them getting bumps, bruising, and hematomas.\n\nCriminals know that they'll get away with whatever they do in NYC, so they're not afraid.\nYet if…"
},
{
    "time": "2024-03-28T11:29:07.000Z",
    "tweet_text": "It should not be acceptable for any company in the gaming industry to be racist & sexist against “white guys”",
    "repost_text": "This is a massive problem + it’s widespread throughout the entire gaming industry x.com/TheQuartering/…"
},
{
    "time": "2024-03-28T07:24:59.000Z",
    "tweet_text": "Send http://X.com links to friends so that they know what’s actually going on!",
    "repost_text": "Still a large number of my people in my IRL circle get their news from traditional mainstream media\n\nFrankly speaking, that terrifies me \n\nThey are consuming an extremely selective and biased version of reality! \n\nNo wonder we are so polarized!  With the election coming, this is…"
},
{
    "time": "2024-03-27T20:15:29.000Z",
    "tweet_text": "Static fire of a single Raptor engine using the header tanks on Flight 4 Starship"
},
{
    "time": "2024-03-28T00:43:07.000Z",
    "tweet_text": "Ideally, there would be no deaths, but, when they do happen, public perception of frequency should match reality as closely as possible",
    "repost_text": "How bad is legacy media disinformation? It’s so bad that a sizable chunk of liberals think the true number of unarmed Black men killed by cops is in the thousands.\n\nThe true number? About 11"
},
{
    "time": "2024-03-28T00:39:50.000Z",
    "tweet_text": "Going forward, all 𝕏 accounts with over 2500 verified subscriber followers will get Premium features for free and accounts with over 5000 will get Premium+ for free"
},
{
    "time": "2024-03-27T23:47:37.000Z",
    "tweet_text": "In reality, legacy media views went down and this platform went up",
    "repost_text": "Every media outlet is reporting a decline in the use of 𝕏. Here is the Key Metrics Data that 𝕏 released earlier this year:\n\nTotal Seconds\nJuly 2023: 339 billion\nJan 2024: 384 billion  (up by 13.27%)"
},
{
    "time": "2024-03-27T23:03:07.000Z",
    "tweet_text": "Wow …"
},
{
    "time": "2024-03-27T22:59:32.000Z",
    "tweet_text": "Starlink now in Argentina!",
    "repost_text": "Starlink is now available in Argentina, making it the seventh country in South America and 72nd in the world where people can access high-speed, low-latency internet from space  → http://starlink.com/map?country=AR"
},
{
    "time": "2024-03-27T20:30:31.000Z",
    "tweet_text": "Getting ready for Flight 4 of Starship!\n\nGoal of this mission is for Starship to get through max reentry heating with all systems functioning.",
    "repost_text": "Static fire of a single Raptor engine using the header tanks on Flight 4 Starship"
},
{
    "time": "2024-03-27T20:27:33.000Z",
    "tweet_text": "Not cool that she undermined math education in California",
    "repost_text": "She's a Stanford professor of math education who's arguably most responsible for the new California Math Framework — a set of curriculum recommendations that advocate against teaching algebra to most of the state's gifted middle-schoolers in the name of equity.\n\nBut she's sent…"
},
{
    "time": "2024-03-27T17:26:16.000Z",
    "tweet_text": "Population of Earth: 8 Billion \n\nGlobal Impressions Last Year on 𝕏: 5 Trillion+"
},
{
    "time": "2024-03-27T17:21:57.000Z",
    "tweet_text": "This is an especially important mission. Some chance it may find signs of life in Europa, a moon of Jupiter!",
    "repost_text": "How does a spacecraft survive a wild rocket ride and harsh space conditions? By passing a series of tests here on Earth first.\n\nPreparing to launch in less than six months, @EuropaClipper recently endured shaking, chilling, airlessness, and more: https://go.nasa.gov/4cvGOnl"
},
{
    "time": "2024-03-27T14:37:37.000Z",
    "tweet_text": "Community Notes corrects all accounts: Presidents of countries, media, government agencies, advertisers. \n\nNo exceptions.\n\nNothing is perfect, but Notes is the best source of truth on the Internet by far.",
    "repost_text": "Prince Harry named in $30 million sex trafficking lawsuit against Sean ‘Diddy’ Combs https://trib.al/YnBUXFI"
},
{
    "time": "2024-03-27T13:39:21.000Z",
    "tweet_text": "NBC just hired & immediately fired Ronna McDaniel, because the team refused to let even one Republican join them – that’s how biased they are!",
    "repost_text": "Elon Musk"
},
{
    "time": "2024-03-27T13:18:05.000Z",
    "tweet_text": "Financial operating systems matter",
    "repost_text": "There are two modern examples (Germany and Korea) where people were in essentially the same starting position, but the country got split along an arbitrary line. \n\nOne side went full government (communism), the other side went  about half government. A few decades later, the…"
},
{
    "time": "2024-03-27T06:25:25.000Z",
    "tweet_text": "Grok has normal mode and fun mode. Tonight, we decided to add an unhinged fun mode. It is next-level "
},
{
    "time": "2024-03-26T21:45:49.000Z",
    "tweet_text": "Nothing more precious than old friends"
},
{
    "time": "2024-03-26T20:11:42.000Z",
    "tweet_text": "Under your supervision, FSD V12.3 can drive your Tesla almost anywhere",
    "repost_text": "FSD V12 handles a chaotic construction section like an expert, achieving smoothness I couldn't have managed even on my first attempt."
},
{
    "time": "2024-03-26T21:16:00.000Z",
    "tweet_text": "Politicians are quick to approve policies that favor tenants over landlords.\n \nBut these rules don’t just protect tenants, they protect squatters too.\n \nSo what do you do when a squatter moves into YOUR home?"
},
{
    "time": "2024-03-26T21:19:16.000Z",
    "tweet_text": "This will be a spicy year"
},
{
    "time": "2024-03-26T20:39:00.000Z",
    "tweet_text": "Later this week, Grok will be enabled for all premium subscribers (not just premium+)",
    "repost_text": "How to share a Grok conversation directly as a post on 𝕏 (iOS)"
},
{
    "time": "2024-03-26T18:54:00.000Z",
    "tweet_text": "On the other hand, legacy media did actually decline by 20% last year",
    "repost_text": "Please share this post with your friends who still believe the legacy media.\n\nX has over 8 billion daily active user minutes on average so far in 2024, up 10% from last year."
},
{
    "time": "2024-03-26T18:13:11.000Z",
    "tweet_text": "True",
    "repost_text": "It's All Much Worse Than I Thought\nThe corporate media are all-in on government censorship\n\nOver the last three years, we have come to learn of the role that our own government officials have played in demanding censorship by social media platforms. Some of this censorship was…"
},
{
    "time": "2024-03-26T10:12:17.000Z",
    "tweet_text": "Yes!",
    "repost_text": "There should be one billion Americans."
},
{
    "time": "2024-03-25T18:00:25.000Z",
    "tweet_text": "The Media Panics As More And More Women Choose To Dump Their Birth Control"
},
{
    "time": "2024-03-25T19:10:00.000Z",
    "tweet_text": "French bill would outlaw gender procedures on kids, calling them \"one of the greatest ethical scandals in the history of medicine\"\nhttps://notthebee.com/t1d67"
},
{
    "time": "2024-03-26T03:59:58.000Z",
    "tweet_text": "Fake news that’s truer than the “real” news ",
    "repost_text": "Taking down Fake News media for 16 minutes straight.\nSit back and enjoy!"
},
{
    "time": "2024-03-26T03:27:22.000Z",
    "tweet_text": "Found this in my fortune cookie tonight"
},
{
    "time": "2024-03-25T23:51:10.000Z",
    "tweet_text": "Falcon 9’s first stage has landed on the A Shortfall of Gravitas droneship"
},
{
    "time": "2024-03-25T21:18:23.000Z",
    "tweet_text": "Full-duration static fire of all six Raptor engines on Flight 4 Starship"
},
{
    "time": "2024-03-25T19:10:21.000Z",
    "tweet_text": "Just when you think reality can’t get more surreal ",
    "repost_text": "LEGO is demanding California cops stop using their brick heads to replace criminals' faces on social media\nhttps://notthebee.com/t195e\nhttps://notthebee.com/t195e"
},
{
    "time": "2024-03-25T19:02:29.000Z",
    "tweet_text": "This platform will always fight for free speech."
},
{
    "time": "2024-03-25T08:45:20.000Z",
    "tweet_text": "The circle will be complete"
},
{
    "time": "2024-03-24T23:04:50.000Z",
    "tweet_text": "If in doubt, always listen to @JohnCleese!"
},
{
    "time": "2024-03-24T19:55:47.000Z",
    "tweet_text": "Bye bye ",
    "repost_text": "BREAKING: The Wall Street Journal is dying. "
},
{
    "time": "2024-03-24T16:18:35.000Z",
    "tweet_text": "Everyone, yes everyone, is far right! "
},
{
    "time": "2024-03-24T15:54:46.000Z",
    "tweet_text": "In support of your right to speak",
    "repost_text": "X is proud to help defend Dr. Kulvinder Kaur Gill against the government-supported efforts to cancel her speech.\n\n@dockaurG is a practicing physician in Canada, specializing in immunology and pediatrics.  Because she spoke out publicly on Twitter (now X) in opposition to the… x.com/dockaurG/statu…"
},
{
    "time": "2024-03-24T05:17:29.000Z",
    "tweet_text": "fyi",
    "repost_text": "Just a reminder:\n\n𝕏 produced the highest 'Return on Ad Spend' as compared to the other social networks when an ad agency, NP Digital ran ads for their clients on all major social platforms. "
},
{
    "time": "2024-03-23T21:33:26.000Z",
    "tweet_text": "We aim to build the future of brain-computer interfaces. Want to create the future with us?\n\nApply to openings on our career page: http://neuralink.com/careers\n\nApply to join our Patient Registry:"
},
{
    "time": "2024-03-24T03:18:42.000Z",
    "tweet_text": "Falcon 9 has landed on Just Read the Instructions, completing this booster's 19th mission and the 75th landing on this droneship"
},
{
    "time": "2024-03-24T03:57:32.000Z",
    "tweet_text": "Yup",
    "repost_text": "NEW: Joe Rogan calls out insane progressive policies that allow for squatters to “steal people's houses.”\n\n\n\n“This guy was explaining how he did it in this YouTube video. He was saying that you get a fake lease.”\n\n“So you draft up a fake lease, you use that lease to get the…"
},
{
    "time": "2024-03-23T20:27:11.000Z",
    "tweet_text": "Yeah, US immigration is completely backwards: trivial to enter illegally and nightmarishly difficult to enter legally!\n\nI strongly support increasing and expediting legal immigration.",
    "repost_text": "AMERICA, LOOK AT SWEDEN AND BEWARE THE CHAOS OF UNCONTROLLED IMMIGRATION (NYP)\n\nI don’t think many Americans realize how difficult it is to come to America legally.\n\nAmong my own friends, I know an academic who has spent the past year in legal limbo, not allowed to work between…"
},
{
    "time": "2024-03-23T19:36:43.000Z",
    "tweet_text": "Please forward links to 𝕏 posts to your friends so they know what’s actually happening. \n\nSome people still believe the legacy media!"
},
{
    "time": "2024-03-23T19:33:29.000Z",
    "tweet_text": "Also insane!",
    "repost_text": "Last night, Senate Democrats voted AGAINST my measure — the CLEAR Act — to deport criminal illegal aliens.\n\nThey are blatantly disregarding Americans’ safety."
},
{
    "time": "2024-03-23T19:29:25.000Z",
    "tweet_text": "This is insane!",
    "repost_text": "Tonight every single Senate Democrat voted against my amendment that would stop Biden Admin from using taxpayer dollars to charter flights for hundreds of thousands of illegal aliens from their countries directly to American towns to be resettled.\n\nIndefensible."
},
{
    "time": "2024-03-23T19:24:52.000Z",
    "tweet_text": "Werner Herzog makes a great point"
},
{
    "time": "2024-03-23T18:43:06.000Z",
    "tweet_text": "Pin your best content and it will receive far more views",
    "repost_text": "I strongly recommend everyone to pin your best content to your profile. \n\n𝕏 algorithm will give it a slight boost and show it to all your followers (once every ~48 hours)"
},
{
    "time": "2024-03-23T17:41:13.000Z",
    "tweet_text": "Your home is no longer your home in many states",
    "repost_text": "Thriving how-to squatter internet forums reveal home takeover secrets: ‘You can’t stop it!’ https://trib.al/jjjXVZF"
},
{
    "time": "2024-03-23T17:33:44.000Z",
    "tweet_text": "Ironic",
    "repost_text": "Nope, because, as the data make clear, \"minorities and people affected by discrimination\" are less woke than the wealthiest and most educated and whitest and least discriminated-against group in America — progressives.  x.com/greenteabaggie…"
},
{
    "time": "2024-03-23T17:31:08.000Z",
    "tweet_text": "Reality vs perception is very different",
    "repost_text": "Alternative way to think about the distribution across groups."
},
{
    "time": "2024-03-23T17:28:58.000Z",
    "tweet_text": "",
    "repost_text": "Media Reports Trump Threatened Nuclear War After He Says, 'This Guacamole Is The Bomb!' https://buff.ly/3ThW52l"
},
{
    "time": "2024-03-23T17:27:05.000Z",
    "tweet_text": "Correct",
    "repost_text": "The world does not abide to feel-good platitudes.  History is replete with very bad people who wish to take everything away from you including your life.  The only thing that stops them from doing so is if your response to such objectives is equally fierce and unforgiving.…"
},
{
    "time": "2024-03-23T17:25:15.000Z",
    "tweet_text": "Old Twitter gave special preference to “real” journalists, even when they lied",
    "repost_text": "Why mainstream media hates 𝕏?\n\nBut never hated Twitter 1.0?"
},
{
    "time": "2024-03-23T10:23:08.000Z",
    "tweet_text": "The @SpaceX Dragon cargo spacecraft soars 262 miles over China as it approaches the station for docking around 7:16am ET."
},
{
    "time": "2024-03-23T13:00:00.000Z",
    "tweet_text": "$34.5 trillion in debt and increasing at the rate of $3 trillion per year.\n\nAnd Congress just passed another $1.2 trillion spending bill stuff with pork and earmarks."
},
{
    "time": "2024-03-23T12:54:06.000Z",
    "tweet_text": "Starbase, Texas, rocket factory"
},
{
    "time": "2024-03-23T12:50:32.000Z",
    "tweet_text": "Wow",
    "repost_text": "TikTokker tells illegal immigrants how to ‘invade’ American homes and invoke squatter’s rights https://trib.al/txoqNfP"
},
{
    "time": "2024-03-22T21:56:35.000Z",
    "tweet_text": "A federal judge has upheld a Washington, D.C. law allowing noncitizens, including illegals, to vote in municipal elections.\n\nWe went from “what is a woman?” to “what is an American?” in about two years. \n\nIllegals get all the benefits of citizenship with hardly any of the…"
},
{
    "time": "2024-03-23T11:20:47.000Z",
    "tweet_text": "Docking confirmed – Dragon has arrived at the @Space_Station!"
},
{
    "time": "2024-03-23T01:58:57.000Z",
    "tweet_text": "Under the hood update: Introducing Topic Models, which improve Community Notes’ ability to identify notes that are helpful to people from different points of view.\n\nCommunity Notes shows notes that are found helpful by people who’ve disagreed in their past ratings. Now, it will…"
},
{
    "time": "2024-03-22T20:14:51.000Z",
    "tweet_text": "Flight 4 Starship moved to the pad at Starbase for upcoming static fires"
},
{
    "time": "2024-03-22T10:40:13.000Z",
    "tweet_text": "Today's cover: Over 100 migrants break through razor wire, knock down guards as they illegally cross El Paso border in wild scene https://trib.al/CgoyDoh"
},
{
    "time": "2024-03-22T22:53:43.000Z",
    "tweet_text": "BIDEN ADMIN TARGETS ELON IN SEC DISPUTE\n\nThe Biden administration urged the Supreme Court to deny Elon's appeal in his clash with the SEC over a 2018 Tesla tweet. \n\nElon is fighting for free speech; but the government says the move aims to curb misinformation. \n\nSource: Reuters"
},
{
    "time": "2024-03-23T03:35:47.000Z",
    "tweet_text": "Pin your best content to your profile. It will get a boost and appear in the \"For You\" feed of all your followers."
},
{
    "time": "2024-03-23T03:32:56.000Z",
    "tweet_text": "Hear about Neuralink from someone who has our Telepathy cybertech implant!",
    "repost_text": "Our pleasure  @ModdedQuad x.com/ModdedQuad/sta…"
},
{
    "time": "2024-03-22T21:28:58.000Z",
    "tweet_text": "First ever post made just by thinking, using the @Neuralnk Telepathy device!",
    "repost_text": "Twitter banned me because they thought I was a bot, @X and @elonmusk reinstated me because I am."
},
{
    "time": "2024-03-22T16:49:04.000Z",
    "tweet_text": "We all have our demons to fight"
},
{
    "time": "2024-03-22T08:39:05.000Z",
    "tweet_text": "True",
    "repost_text": "The average price for a new car is about $47,000.\n\nYou can get a Tesla Model Y RWD for $36,490 after Federal Tax Credit.\n\nOr a Tesla Model Y AWD Long Range for $41,490 after Federal Tax Credit.\n\nOr a Tesla Model Y Performance for $44,990 after Federal Tax Credit.\n\nThe Tesla Model…"
},
{
    "time": "2024-03-21T23:51:40.000Z",
    "tweet_text": "Falcon 9 launches Dragon to the @Space_Station from pad 40 in Florida"
},
{
    "time": "2024-03-22T06:19:51.000Z",
    "tweet_text": "This feature is great",
    "repost_text": " Pinned posts in For You will now show up for all users! Pin (and highlight) your best content! x.com/enriquebrgn/st…"
},
{
    "time": "2024-03-21T21:49:52.000Z",
    "tweet_text": "𝕏 Traffic Update \n\nThe organic traffic for March is already up by 5.09% and is at 642 million "
},
{
    "time": "2024-03-22T05:20:32.000Z",
    "tweet_text": "Some Falcon landing shots"
},
{
    "time": "2024-03-21T20:00:26.000Z",
    "tweet_text": "𝕏 is adding new filters to the job search!\n\nvia @nima_owji"
},
{
    "time": "2024-03-21T16:47:29.000Z",
    "tweet_text": "Wow",
    "repost_text": "Stephen Miller (@StephenM) on the Democrat scheme to allow illegal aliens into the country so they will be counted in the U.S. Census, giving them more electoral power:\n\n“California would have HALF of the Electoral College votes it has right now but for illegal immigration..”"
},
{
    "time": "2024-03-21T15:46:13.000Z",
    "tweet_text": "They are",
    "repost_text": "Washington State Gov signed a bill mandating LGBTQ history be taught in public schools.   \n\nWake UP America.  \nThey are coming for your children."
},
{
    "time": "2024-03-20T18:33:27.000Z",
    "tweet_text": "Squatters Can Now Come In And Steal Your Home With No Consequences"
},
{
    "time": "2024-03-21T15:09:45.000Z",
    "tweet_text": "When sending medical advice, ask your doctor, but also ask an experienced nurse. \n\nNurses are underrated."
},
{
    "time": "2024-03-21T14:57:58.000Z",
    "tweet_text": "Reality has become more bizarre than parody!\n\nAlso, employment discrimination is illegal, so they are breaking the law.",
    "repost_text": "UNBELIEVABLE: Top healthcare company Mayo Clinic is discriminating against straight white people in their \"inclusive\" hiring practices. \n\nEven criminals are being prioritized to be hired as nurses.\n\nHow does this ensure patients will receive the best medical care possible?…"
},
{
    "time": "2024-03-21T13:34:22.000Z",
    "tweet_text": "This is a battle to the death with the anti-civilizational woke mind virus. \n\nMy positions are centrist:\n- Secure borders \n- Safe & clean cities\n- Don’t bankrupt America with spending\n- Racism against any race is wrong\n- No sterilization below age of consent \n\nIs this right-wing?",
    "repost_text": "going back in time to try to explain how crazy it is that we have a guy who makes electric cars and rocket ships and brain computer interfaces yet a bunch of people hate him because they dont like his politics or whatever & having them show me a cave drawing of the astronaut meme"
},
{
    "time": "2024-03-21T13:58:49.000Z",
    "tweet_text": "And, although it shouldn’t need to said, I believe in the Constitution and freedom of speech"
},
{
    "time": "2024-03-21T13:25:32.000Z",
    "tweet_text": "",
    "repost_text": "Do you know what is the most dangerous force in nature?  Is it tsunamis?  Earthquakes?  Biological pathogens?  Great white sharks?  No!\n\nThe most dangerous force in nature is a parasitized human mind.  Human misery (and possibly human extinction) is largely driven by ideological…"
},
{
    "time": "2024-03-21T13:20:55.000Z",
    "tweet_text": "Google is deeply infected with the woke mind virus",
    "repost_text": "HOLY SHlT. Google just quietly changed its search results for \"bloodbath definition\""
},
{
    "time": "2024-03-21T13:13:06.000Z",
    "tweet_text": "The New York Times is pure propaganda"
},
{
    "time": "2024-03-21T00:02:08.000Z",
    "tweet_text": "How committed is the Biden administration to an open border? It took the Supreme Court overruling White House objections to allow Texas to enforce immigration law."
},
{
    "time": "2024-03-20T22:09:52.000Z",
    "tweet_text": "𝕏 in numbers!  "
},
{
    "time": "2024-03-20T21:39:50.000Z",
    "tweet_text": "Livestream of @Neuralink demonstrating “Telepathy” – controlling a computer and playing video games just by thinking",
    "repost_text": "https://twitter.com/i/broadcasts/1ypJdkXjaLNGW…"
},
{
    "time": "2024-03-18T15:08:49.000Z",
    "tweet_text": "Right now, the Supreme Court is hearing a big free speech case:\nhttps://supremecourt.gov/oral_arguments/live.aspx…\n\nA lower court ruled that the Biden admin violated the 1st Amendment, as it pressured companies to censor news about Hunter's laptop, Covid, and more.\n\nTRUE things were censored, like:"
},
{
    "time": "2024-03-19T22:23:50.000Z",
    "tweet_text": "Teams test the new emergency chutes from the pad 40 crew tower in Florida"
},
{
    "time": "2024-03-19T23:03:05.000Z",
    "tweet_text": "Dragon is now operational on 2 launchpads!",
    "repost_text": "Dragon 2 vertical on pad 40 for the first time"
},
{
    "time": "2024-03-19T22:53:51.000Z",
    "tweet_text": " is the new "
},
{
    "time": "2024-03-19T21:33:24.000Z",
    "tweet_text": ".@steveaoki just received his Cybertruck"
},
{
    "time": "2024-03-19T17:20:12.000Z",
    "tweet_text": "BREAKING: 𝕏 has paid more than $45 million to over 150,000 creators on the platform."
},
{
    "time": "2024-03-19T19:42:37.000Z",
    "tweet_text": "Crazy that Texas has to do the job of the Biden administration, which filed aggressive legal action to stop the state!\n\nIf anyone still doesn’t believe that ushering in illegals is the goal of the Biden administration, this should convince them.",
    "repost_text": "HUGE WIN. \n\nThe Supreme Court will now ALLOW the Texas National Guard to arrest & deport illegal aliens within the state of Texas.\n\nA big blow to the Biden administration."
},
{
    "time": "2024-03-19T19:58:40.000Z",
    "tweet_text": "As always, I say this as an immigrant who is proud to have become a citizen and who supports expanded and expedited *legal* immigration"
},
{
    "time": "2024-03-19T19:32:47.000Z",
    "tweet_text": "Most reasonable people, because they are reasonable, cannot believe that the goal of the far left is to end America"
},
{
    "time": "2024-03-19T16:02:23.000Z",
    "tweet_text": "",
    "repost_text": "GO DIRECT: THE MANIFESTO\n\nI. TRADITIONAL PR IS DEAD.\n\nFor too long, founders have yielded control over their narratives to media and middlemen.\n\nBefore the internet, it was by necessity. The way to reach large audiences was through the media, and the way to get media coverage was…"
},
{
    "time": "2024-03-19T14:56:18.000Z",
    "tweet_text": "“Political refugee”",
    "repost_text": "Aderbis Pirela was on Interpol's TOP 10 MOST WANTED list with ties to at least four murders, drug trafficking and other warrants out of Colombia where he’s a drug lord.\n\nHe was just arrested in Texas this week after entering America illegally in January as, get this… A POLITICAL…"
},
{
    "time": "2024-03-19T13:38:22.000Z",
    "tweet_text": "Troubling",
    "repost_text": "Illegal immigrants can now carry guns, a federal judge has ruled. At this point, it seems like illegals have as many rights as US citizens but without even half the responsibilities.\n\nU.S. District Judge Sharon Johnson Coleman has ruled that an illegal immigrant's Second…"
},
{
    "time": "2024-03-19T13:28:08.000Z",
    "tweet_text": "Misplaced empathy causes great harm",
    "repost_text": "A society that incorrectly navigates this reality is deep in the abyss of infinite lunacy.  \n\nProgressives are poorly calibrated in terms of their empathy. \n\nIllegal migrants > legal citizens\n\nCriminals > victims\n\nSquatters > home owners \n\nTransgender “women” > women\n\nTwerking… x.com/ImMeme0/status…"
},
{
    "time": "2024-03-19T04:56:46.000Z",
    "tweet_text": "Andi Lynn Blair.\n\nHer life was cut short by #BidensBorderBloodbath"
},
{
    "time": "2024-03-18T23:31:04.000Z",
    "tweet_text": ".@ElonMusk Issues Emotional Statement in the Final Minutes of Don Lemon Interview\n\n“If I died knowing that I did what was right, or did my best to do what was right, and even if in the history books they said I did wrong, I would still feel okay about that. I care about the…"
},
{
    "time": "2024-03-19T10:18:58.000Z",
    "tweet_text": "An example of why it is so important to preserve freedom of speech",
    "repost_text": "Police officers in Scotland are being given training to target social media posts, including re-tweets, of material deemed \"threatening and abusive.\"\n\nUnder the county's new hate crime law, actors and comedians are not given a free pass to make jokes about sensitive subjects that…"
},
{
    "time": "2024-03-19T10:11:06.000Z",
    "tweet_text": "This is actually happening!"
},
{
    "time": "2024-03-19T09:57:20.000Z",
    "tweet_text": "It is concerning that the legacy press would lie so blatantly",
    "repost_text": "holy shit its monday and the press is still going ham on 'bloodbath' even after getting mocked mercilessly over the weekend\n\nheres what you do\n\nshow your friends and family the video in full context then afterwards show the news headlines"
},
{
    "time": "2024-03-19T05:18:23.000Z",
    "tweet_text": "Falcon 9 launches @Starlink satellites to orbit from California"
},
{
    "time": "2024-03-19T04:49:50.000Z",
    "tweet_text": "Interesting",
    "repost_text": "The Dominican Republic has built a 12-foot tall BORDER WALL to protect them from gangs and crime.\n\nThey call it 'smart security fence' with drones and cameras.\n\nThey have watch towers and night visions. \n\nWhat the heck are we doing in America?\n\nBiden might want to take some notes…"
},
{
    "time": "2024-03-19T03:10:20.000Z",
    "tweet_text": "LIVE: @elonmusk talks about restoring free speech with X\n\n\"There's a reason we have the First Amendment. \n\nWhy does it exist?\n\nIt exists because people came from countries where they could not speak freely. Where if they did speak their mind, they would be imprisoned or killed.\""
},
{
    "time": "2024-03-19T01:42:55.000Z",
    "tweet_text": "The media is broken\n\nTribalism and censorship rule\n\nOn 𝕏, let us be different\n\nSupport good faith arguments, and problem solvers\n\nLet the insincere empathy farmers starve for attention"
},
{
    "time": "2024-03-19T02:28:53.000Z",
    "tweet_text": "Liftoff!"
},
{
    "time": "2024-03-19T00:07:40.000Z",
    "tweet_text": "Discussion about free speech",
    "repost_text": "https://twitter.com/i/spaces/1BRJjPVmBBRKw…"
},
{
    "time": "2024-03-18T23:18:03.000Z",
    "tweet_text": "Hearing news from actual experts or people on the ground is way better than having it be filtered through non-experts (media) or people who weren’t actually there",
    "repost_text": "Legacy Media want to control what you know, which is why citizen journalism is essential."
},
{
    "time": "2024-03-18T22:49:09.000Z",
    "tweet_text": "Discussing freedom of speech",
    "repost_text": "Going live with @elonmusk in just over an hour. \n\nYou won’t want to miss this conversation. \n\nhttps://twitter.com/i/spaces/1BRJjPVmBBRKw…"
},
{
    "time": "2024-03-18T22:46:15.000Z",
    "tweet_text": "With rare exception, almost the entire legacy media industry is a politically far left cheering squad",
    "repost_text": "Why did the entire media complex and our president lie about Trump's use of the word \"bloodbath\" over the weekend? Check out the hypocrisy.\nhttps://notthebee.com/tce36\nhttps://notthebee.com/tce36"
},
{
    "time": "2024-03-18T22:29:31.000Z",
    "tweet_text": "Nothing is clearer in history than the adoption by successful rebels of the methods they were accustomed to condemn in the forces they deposed.\n\n— Will and Ariel Durant"
},
{
    "time": "2024-03-18T20:42:10.000Z",
    "tweet_text": "BIDEN’s BORDER BLOODBATH\n\n#BidensBorderBloodbath\n\nPass it on!",
    "repost_text": "You know what the real 'Bloodbath' is? \n\nIt's illegals invading our country and committing m*rder.\n\nREMEMBER THEIR NAMES:\n\nLaken Riley\nChristopher Gadd\nLizabeth Medina \nMelissa & Riordan Powell\nDavid Hadrich\nCindy Goulding\nCheston Edwards\nDeborah Brandao\nNazareth Tamer-Claure…"
},
{
    "time": "2024-03-18T20:42:35.000Z",
    "tweet_text": "X has over 8 billion daily active user minutes on average so far in 2024, up 10% from last year."
},
{
    "time": "2024-03-18T21:39:02.000Z",
    "tweet_text": "Latest platform user data!",
    "repost_text": "You’re absolutely right @XNews. 250 million people use X every day. 550 million people visit the global town square every month.\n\nOn average, users spend 30 minutes a day on X.  x.com/XNews/status/1…"
},
{
    "time": "2024-03-18T20:05:30.000Z",
    "tweet_text": "We have imported the criminal underworlds of 100 different countries",
    "repost_text": "And the Biden Administration does nothing x.com/EndWokeness/st…"
},
{
    "time": "2024-03-18T19:27:08.000Z",
    "tweet_text": "And the Biden Administration does nothing",
    "repost_text": "BREAKING: The LAPD forms a special task force to combat organized foreign gangs burglarizing homes\n\nThe organized gangs are coming from Peru, Columbia, Ecuador, Chile, etc\n\nOVER NINE HUNDRED HOMES in LA were burglarized since January 2024 \n\nSimilar patterns are emerging in…"
},
{
    "time": "2024-03-18T17:28:44.000Z",
    "tweet_text": "This is important",
    "repost_text": "Elon Musk Educates Don Lemon on Illegal Immigrants, Census, and the Electoral College\n\nLEMON: \"You claim that Democrats and Biden are opening the border to gain more votes, but undocumented immigrants cannot vote in Federal Elections, so how is that possible?\"\n\nMUSK: \"If you look…"
},
{
    "time": "2024-03-18T17:27:02.000Z",
    "tweet_text": "Sounds very biased",
    "repost_text": "#19 A study found that Google cost Republican candidates over $2 billion in donations since 2019 by flagging 77% of their fundraising emails as spam. \n\nDuring the same time, Gmail marked less than 11% of Democrat fundraising emails as spam.\n\nhttps://foxnews.com/politics/google-gmail-censorship-cost-gop-candidates-2b-study…"
},
{
    "time": "2023-01-30T23:02:07.000Z",
    "tweet_text": "#14 What were these classifiers?\n\nHere's a leaked document, \"Fringe ranking/classifier.\"\n\nGoogle ranked ABC, CBS, and CNN as more “authoritative” than the “trashy” Fox News and Breitbart.\n\nThis is how Big Tech manually interjects political bias into search results and algorithms."
},
{
    "time": "2024-03-18T17:01:48.000Z",
    "tweet_text": "This article understates the magnitude of the problem – Google interferes to help Democrats thousands of times every election season!\n\nThis is to be expected when their censorship (aka “Trust & Safety”) teams are have far left political views.",
    "repost_text": "No one is surprised"
},
{
    "time": "2024-03-18T05:56:07.000Z",
    "tweet_text": "grok-1 is out!\n\ncome do your life's work @ xAI - http://x.ai/careers"
},
{
    "time": "2024-03-18T05:59:51.000Z",
    "tweet_text": "Over time the newspapers have been fading away in relevance. \n\nNot gone, just as writing and mailing paper letters still happens, but no longer the way most people know what’s going on.",
    "repost_text": "46 million views. The media is done. x.com/EndWokeness/st…"
},
{
    "time": "2024-03-18T02:10:51.000Z",
    "tweet_text": "Metaphor murderers",
    "repost_text": "Describe NBC News in two word or less:"
},
{
    "time": "2024-03-17T23:19:49.000Z",
    "tweet_text": "Elon Musk talked about T.I.T.S and A.S.S on 𝕏-Space "
},
{
    "time": "2024-03-17T21:42:00.000Z",
    "tweet_text": "Please sign up to rate & contribute Community Notes to increase accuracy on 𝕏!",
    "repost_text": "Sign up to become a Community Notes contributor: https://twitter.com/i/flow/join-birdwatch…"
},
{
    "time": "2024-03-17T20:23:31.000Z",
    "tweet_text": "Still work to do, but this platform is already by far the most transparent & truth-seeking (not a high bar tbh)",
    "repost_text": "Open source for the win! \n\nA surge in organic traffic on 𝕏 when the platform made it's recommendation algorithm open-source."
},
{
    "time": "2024-03-17T19:12:18.000Z",
    "tweet_text": "░W░E░I░G░H░T░S░I░N░B░I░O░"
},
{
    "time": "2024-03-17T18:32:47.000Z",
    "tweet_text": "Many Americans still have no idea this happened",
    "repost_text": "The most under-reported and under-discussed story of 2023: a federal district court judge, upheld by a unanimous appellate panel, found the Biden WH and FBI committed one of the gravest attacks on the 1st Am in decades by coercing Big Tech to censor dissent online."
},
{
    "time": "2024-03-17T18:22:48.000Z",
    "tweet_text": "Yeah",
    "repost_text": "i have a thought\n\nif legacy media journalists don’t like being seen as disingenuous and untrustworthy hacks \n\ni think maybe it would help if they stopped lying and misleading for their own agendas all the time and actually exhibited integrity \n\nbut what do i know"
},
{
    "time": "2024-03-17T17:49:27.000Z",
    "tweet_text": "!!",
    "repost_text": "Illegal migrant from Lebanon told border authorities he’s a Hezbollah terrorist and hoped ‘to make a bomb’ in US https://trib.al/Eh50Rpx"
},
{
    "time": "2024-03-17T17:47:40.000Z",
    "tweet_text": "How to share a post with people outside this platform",
    "repost_text": "How to share a post from 𝕏:\n\n- Press the share icon located at the bottom right of the post. You can either copy the link to share manually or select other apps from the slider at the bottom\n\n(Note: You can also long press the share icon to open your phone's default share popup)"
},
{
    "time": "2024-03-17T14:04:48.000Z",
    "tweet_text": "Please send links from this platform to your friends who are still being misled by the legacy media!"
},
{
    "time": "2024-03-17T13:59:06.000Z",
    "tweet_text": "Speech with full context"
},
{
    "time": "2024-03-17T12:59:44.000Z",
    "tweet_text": "Legacy media lies",
    "repost_text": "The media is lying about Donald Trump with this narrative about a “bloodbath” if he loses the election. He was very clearly talking about the car manufacturing industry—before and after he used the word. \n\nYou have to be extremely disingenuous to take what he’s saying out of…"
},
{
    "time": "2024-03-17T12:43:33.000Z",
    "tweet_text": "Easy to tell who is an NPC today"
},
{
    "time": "2024-03-17T06:34:30.000Z",
    "tweet_text": "Interesting",
    "repost_text": "We are witnessing the invention of the \"bloodbath\" hoax in real-time\n\nUnfortunately for them, we have 𝕏\n\nMedia narrative:              Full context:"
},
{
    "time": "2024-03-17T04:42:08.000Z",
    "tweet_text": "The algorithm is trying to maximize what is most interesting to you, based on time spent on 𝕏",
    "repost_text": "Upload the full video directly on 𝕏 to get the maximum reach. Posting YouTube links won't get the desired reach, as the algorithm does not favor content that leads users away from the platform."
},
{
    "time": "2024-03-17T02:55:47.000Z",
    "tweet_text": "It is important that women know the effects of hormonal birth control, as it is a significant cause of depression and increases suicide risk.\n\nThis is not a value statement, just a public service announcement. Other forms of birth control do not have these effects.",
    "repost_text": "I had a similar experience getting off the birth control pill. So have thousands of other women. \n\nI’ve never been anti-birth control + it can be a life changing medication for some. However, it does have serious side effects including increased risk of depression & suicide.… x.com/dippindottt/st…"
},
{
    "time": "2024-03-17T02:47:42.000Z",
    "tweet_text": "Wow",
    "repost_text": "'THIRD WORLD COUNTRY': Video shows AOC's district unrecognizable as migrants overrun the neighborhood, blocking up sidewalks selling clothing and food. https://trib.al/qQA4Q3I"
},
{
    "time": "2024-03-17T02:36:38.000Z",
    "tweet_text": "The most entertaining outcome – as if we’re in a soap opera – is the most likely\n\nERM"
},
{
    "time": "2024-03-16T06:21:38.000Z",
    "tweet_text": "Tesla Model Y price will rise by $1000 in a few weeks",
    "repost_text": "Prices in the US will increase by $1k for all Model Y trims on April 1st\n\nOrder in 2 mins via https://tesla.com/modely/design#overview…"
},
{
    "time": "2024-03-16T06:04:37.000Z",
    "tweet_text": "As crazy as this sounds, some people still believe the legacy news media!",
    "repost_text": "Please share this with your friends who still watch traditional news media."
},
{
    "time": "2024-03-16T02:02:36.000Z",
    "tweet_text": "Another day, another 2 Tbps for Starlink",
    "repost_text": "Falcon 9 lands on the A Shortfall of Gravitas droneship, completing our 25th launch and landing of the year"
},
{
    "time": "2024-03-16T01:29:29.000Z",
    "tweet_text": "Don “Veruca Salt” "
},
{
    "time": "2024-03-16T01:11:44.000Z",
    "tweet_text": "Ship in space"
},
{
    "time": "2024-03-16T01:21:32.000Z",
    "tweet_text": "Wild that this is a real picture"
},
{
    "time": "2024-03-16T00:16:21.000Z",
    "tweet_text": "Watch Falcon 9 launch 23 @Starlink satellites to low-Earth orbit"
},
{
    "time": "2024-03-15T23:19:24.000Z",
    "tweet_text": "Tower cam in real-time"
},
{
    "time": "2024-03-15T23:15:56.000Z",
    "tweet_text": "To the stars"
},
{
    "time": "2024-03-15T17:11:37.000Z",
    "tweet_text": "Why does the radical far left Biden administration welcome violent illegals into America to prey upon your friends & family?\n\nWe are even warned by other countries that it is insane to make America a haven for their convicted criminals!",
    "repost_text": "A Venezuelan supreme court judge is warning that violent convicts released from Venezuela are increasingly part of the migrant stream pouring into the US. Laken Riley's murder suspect is allegedly part of a violent Venezuelan gang. Read:  https://thepostmillennial.com/venezuelan-killers-gang-members-heading-to-us-after-release-from-prison-official-warns?utm_campaign=64470…"
},
{
    "time": "2024-03-15T22:19:24.000Z",
    "tweet_text": "I say as an immigrant who is proud to have become a citizen and who supports vastly expanded *legal* immigration"
},
{
    "time": "2024-03-15T21:37:32.000Z",
    "tweet_text": "That is the actual sign at Starbase, Texas"
},
{
    "time": "2024-03-15T21:10:51.000Z",
    "tweet_text": "A friend of mine suggested that I clarify the nature of the danger of woke AI, especially forced diversity. \n\nIf an AI is programmed to push for diversity at all costs, as Google Gemini was, then it will do whatever it can to cause that outcome, potentially even killing people."
},
{
    "time": "2024-03-15T19:41:14.000Z",
    "tweet_text": "Only a matter of time",
    "repost_text": "FBI Director says he's concerned illegal migrants entering the U.S. at the border could cause another 9/11 terrorist attack.\n\nBiden doesn’t care. \n\nThat’s why I declared an invasion at the border, deployed the National Guard & building a border wall. \n\nhttps://newsmax.com/newsfront/fbi-director-christopher-wray-senate/2024/03/12/id/1156903/…"
},
{
    "time": "2024-03-15T18:30:16.000Z",
    "tweet_text": "Has anyone seen Ilya?"
},
{
    "time": "2024-03-15T17:52:50.000Z",
    "tweet_text": "That is a major concern",
    "repost_text": "A simple way to improve the TikTok bill would be to clarify that it does not apply to any U.S. company unless it is majority owned/controlled by persons or entities from a foreign adversary country. Until then, this bill is clearly a Trojan Horse to control U.S. apps & websites."
},
{
    "time": "2024-03-15T17:48:32.000Z",
    "tweet_text": "Yesterday was one step closer to life on Mars",
    "repost_text": "Starship launching for the third time from the gateway to Mars"
},
{
    "time": "2024-03-15T17:45:39.000Z",
    "tweet_text": "When will this madness stop?",
    "repost_text": "Meet Ervin Jeovany Alfaro Lopez, a twice-deported illegal working as a teacher in Maryland. \n\nHe was just arrested and charged with s*xually abusing multiple minors. One of the victims was just 6-years-old.\n\nBiden's open border policy is allowing r*pists and p*dophiles to…"
},
{
    "time": "2024-03-15T17:43:38.000Z",
    "tweet_text": "",
    "repost_text": "America is toast if we get another four years of this. May already be toast. x.com/jim_desmond/st…"
},
{
    "time": "2024-03-15T17:35:13.000Z",
    "tweet_text": "Powerwall keeps your home power on even if the utility is out for many hours",
    "repost_text": "Powerwall 3 is flood resistant in over 2 ft (70 cm) of water, keeping your home powered even in the most severe weather"
},
{
    "time": "2024-03-15T17:14:34.000Z",
    "tweet_text": "Even though I think Don  is a pompous fool who spouts nonsense, he is still free to upload his show to 𝕏 and will receive advertising revenue",
    "repost_text": "Don Lemon says he's going to upload his new show on 𝕏, along with other platforms."
},
{
    "time": "2024-03-15T17:06:10.000Z",
    "tweet_text": "The far left US administration is using your tax dollars to fly violent criminals into America",
    "repost_text": "BREAKING: Per DHS sources to me & @GriffJenkins, the Haitian man arrested for raping a 15 y/o disabled girl at a migrant hotel in Massachusetts Wednesday night came to the U.S. via the Biden admin’s parole program for Haitians, which allowed him to fly into JFK airport in NYC…"
},
{
    "time": "2024-03-15T01:50:09.000Z",
    "tweet_text": "This censorship bill if far too broad. It will be abused in the future.",
    "repost_text": "WHAT'S IN THE TIKTOK BILL?\n\nI've read H.R. 7521 (the \"TikTok bill\") carefully. Here's a summary of the operative provisions:\n\n(1) The bill prohibits \"foreign adversary controlled applications\" from operating in the U.S. The prohibition applies not just to the app itself but to…"
},
{
    "time": "2024-03-15T01:32:46.000Z",
    "tweet_text": "FSD V12.3 comments. More videos to come, but these are my succinct comments after about 60 minutes of city streets on V12.3."
},
{
    "time": "2024-03-15T00:42:57.000Z",
    "tweet_text": "Starship is the biggest rocket ever built! "
},
{
    "time": "2024-03-14T17:35:43.000Z",
    "tweet_text": "Reliable high-speed, low-latency internet around the world—even while traveling at 27,000 km/h through a plasma field ",
    "repost_text": "Starship re-entering Earth's atmosphere. Views through the plasma"
},
{
    "time": "2024-03-14T13:04:09.000Z",
    "tweet_text": "ELON IN 2002: \"I started SpaceX with the idea of making life multi-planetary.\"\n\n2008: Falcon 1 becomes the first privately developed liquid-fueled rocket to reach orbit. \n\n2010: Dragon capsule achieves orbit and recovery, a first for a private spacecraft. \n\n2012: Dragon visits…"
},
{
    "time": "2024-03-14T19:38:51.000Z",
    "tweet_text": "Starship is evolving rapidly",
    "repost_text": "The evolution here is insane! SpaceX is one of the most innovative companies on the planet."
},
{
    "time": "2024-03-14T15:47:40.000Z",
    "tweet_text": "Starship will take humanity to Mars"
},
{
    "time": "2024-03-14T14:46:34.000Z",
    "tweet_text": "Starship will make life multiplanetary"
},
{
    "time": "2024-03-14T14:32:11.000Z",
    "tweet_text": "Watch the super hot plasma field grow as Starship re-enters the atmosphere!"
},
{
    "time": "2024-03-14T13:49:52.000Z",
    "tweet_text": "Starships are meant to fly...\nAn incredible launch this morning, with 33 Raptor engines breathing fire, hot staging over the Gulf of Mexico, boost back to the ocean, good upper stage burn, and test of the Pez bay door.  Starship engine relight and reentry to splashdown to come."
},
{
    "time": "2024-03-14T13:43:42.000Z",
    "tweet_text": "At ~5000 tons, Starship is the largest flying object ever made",
    "repost_text": "Liftoff of Starship!"
},
{
    "time": "2024-03-14T13:41:14.000Z",
    "tweet_text": "Hot-staging",
    "repost_text": "Starship’s Raptor engines have ignited during hot-staging separation. Super Heavy is executing the flip maneuver"
},
{
    "time": "2024-03-14T13:40:52.000Z",
    "tweet_text": "Starship reached orbital velocity!\n\nCongratulations @SpaceX team!!"
},
{
    "time": "2024-03-14T13:22:28.000Z",
    "tweet_text": "About 3 mins before launch T-0",
    "repost_text": "Watch Starship’s third flight test → http://spacex.com/launches https://twitter.com/i/broadcasts/1LyxBnOvzvOxN…"
},
{
    "time": "2024-03-14T07:05:28.000Z",
    "tweet_text": "Starship launch attempt in ~5 hours"
},
{
    "time": "2024-03-14T06:14:31.000Z",
    "tweet_text": "And you can also use AirPlay"
},
{
    "time": "2024-03-14T04:26:03.000Z",
    "tweet_text": "Video games need to get rid of the woke bs. \n\nGetting lectured with tedious propaganda is not why people play games!",
    "repost_text": "The Radical Wokeness Of The Video Game Industry\n\nTIMESTAMPS:\n\n00:00 - 00:28 Opening\n1:47 - 20:13 The Radical Wokeness Of The Video Game Industry\n21:05 - 31:05 Study Shows Attempted-Suicide Rate For Transgender Women Twice as High After Surgery\n31:06 - 35:18 NHS England…"
},
{
    "time": "2024-03-14T01:31:06.000Z",
    "tweet_text": "Starship flight 3 maybe tomorrow",
    "repost_text": "Targeting Thursday, March 14 for Starship’s third flight test. A 110-minute launch window opens at 7:00 a.m. CT → http://spacex.com/launches"
},
{
    "time": "2024-03-13T14:59:01.000Z",
    "tweet_text": "Woke ideology wants you to die",
    "repost_text": "Maryland city equity official says she wants US to burn to the ground: 'MY ideology can rise from the ashes' https://trib.al/0oWuhum"
},
{
    "time": "2024-03-13T14:56:30.000Z",
    "tweet_text": "Free speech is the bedrock of democracy",
    "repost_text": "Free speech is essential to a functioning democracy."
},
{
    "time": "2024-03-13T14:51:02.000Z",
    "tweet_text": "Just posting so the public knows how crazy this is",
    "repost_text": "New data from ICE and CBP shows that Biden has only deported .25% of the Venezuelans who have illegally entered our country.\n\nBiden is aiding and abetting an invasion!"
},
{
    "time": "2024-03-13T14:41:20.000Z",
    "tweet_text": "Teach a people to hate themselves and their history and they are defenseless against mind viruses. \n\nThey can be reprogrammed with ease."
},
{
    "time": "2024-03-13T14:20:14.000Z",
    "tweet_text": "Interesting discussion of how mind viruses are created and amplified",
    "repost_text": "How do you incubate a mind virus? How do you cause a culture to self-destruct? In 1984, this KGB defector exposed the 4-stages  identified by Soviet intelligence as the necessary steps to cause the psychological implosion of American society.\n\nStage 1: Demoralization (15–20 yrs)"
},
{
    "time": "2024-03-13T14:17:12.000Z",
    "tweet_text": "Thanks to the hard work of the Tesla Giga Berlin team and support from the community, the factory is back online!",
    "repost_text": "We are back"
},
{
    "time": "2024-03-13T13:59:47.000Z",
    "tweet_text": "Good summary of the history of slavery",
    "repost_text": "\"It's hard to teach hate. It's easier to lie about history.\" - @KonstantinKisin dismantles the established narrative of slavery."
},
{
    "time": "2024-03-12T17:14:03.000Z",
    "tweet_text": "Tesla Cybertruck is super easy to charge on the Tesla network. You can go anywhere you want"
},
{
    "time": "2024-03-12T22:34:46.000Z",
    "tweet_text": "The Haitians are coming.\n\nThe Department of Defense testified today that the Biden administration anticipates \"mass migration\" from Haiti in the wake of the horrific state of the country, which has descended into complete anarchy. Their first port of call? Florida."
},
{
    "time": "2024-03-13T02:40:07.000Z",
    "tweet_text": "\"Major Measles Outbreak\" Reported In US As Migrant Shelters Become Infectious Disease Breeding Grounds"
},
{
    "time": "2024-03-13T03:08:19.000Z",
    "tweet_text": "He certainly doesn’t seem dangerously crazy",
    "repost_text": "They told us Jake Chansley, the QAnon Shaman, was a dangerous lunatic who deserved to be sent to prison, if not shot to death. Many believed it. But is he actually crazy? Judge for yourself."
},
{
    "time": "2024-03-13T02:25:46.000Z",
    "tweet_text": "AI will probably be smarter than any single human next year. By 2029, AI is probably smarter than all humans combined.",
    "repost_text": "Futurist Ray Kurzweil Tells Joe Rogan AI Will Achieve Human-level Intelligence by 2029\n\n\"We're not quite there, but we will be there, and by 2029 it will match any person. I'm actually considered conservative. People think that will happen next year or the year after. \n\nI…"
},
{
    "time": "2024-03-13T02:09:20.000Z",
    "tweet_text": "Cool",
    "repost_text": "When I see a good post or article on 𝕏, I send the http://X.com link to friends/family so they aren’t fooled by legacy media"
},
{
    "time": "2024-03-13T01:43:30.000Z",
    "tweet_text": "Madness",
    "repost_text": "No one is surprised"
},
{
    "time": "2024-03-13T01:05:12.000Z",
    "tweet_text": "Overspending must stop or America will go bankrupt",
    "repost_text": "This is an amazing number to watch in the next few years. Individual income taxes are about 1/2 of the govt revenue.\n\nFor February, the US govt collected $120 billion from individual income taxes. They had to spend $76 billion in February to pay interest on the nation debt.\n\nWe… x.com/RealEJAntoni/s…"
},
{
    "time": "2024-03-13T00:29:20.000Z",
    "tweet_text": "Britain has actually looked at the data, which is why they’re shutting down puberty blockers for kids – they do far more harm than good",
    "repost_text": "Excuse me @JustinTrudeau \n\nI'm a psychologist. Despite the best efforts of your ideological allies. I told your idiot Senators in 2016 that your idiot virtue signaling Bill C16 would cause a psychogenic epidemic among young women.\n\nGuess what happened? \n\nNow I'm telling you…"
},
{
    "time": "2024-03-13T00:26:19.000Z",
    "tweet_text": "Model 3 is more affordable than most people realize",
    "repost_text": ".@Kimbal has all the Teslas and he still loves his model S \n\n“The New Model 3 is amazing and it’s never been more affordable:\n$3000 down $300 per month lease.”\n\n@tesla @tesla_na"
},
{
    "time": "2024-03-12T22:08:06.000Z",
    "tweet_text": "Just a reminder:\n\nYou can upload 4hr long videos on this platform."
},
{
    "time": "2024-03-12T22:03:34.000Z",
    "tweet_text": "Video on this platform is growing fast",
    "repost_text": "The future of video on X is bright!  4 out of every 5 user sessions now include watching video. Overall video views on X are growing at an average rate of 35% year over year with average time spent on video up +17%."
},
{
    "time": "2024-03-12T21:58:30.000Z",
    "tweet_text": "Tesla full self-driving v12.3 in action https://x.com/TeslaAiGirl/st/TeslaAiGirl/status/1767601955298578636…"
},
{
    "time": "2024-03-12T20:13:41.000Z",
    "tweet_text": "Cool",
    "repost_text": "Doug DeMuro just reviewed the refreshed Tesla Model 3, and he calls it 'The Greatest Appliance Ever Made'.\n\nNot particularly the most exciting car to drive, but the best car ever made that can get you from Point A to Point B.\n\n@DougDeMuro\nhttps://youtu.be/aqYKMcnv33E?si=pIhdakbK28e5tOmK…"
},
{
    "time": "2024-03-12T20:10:27.000Z",
    "tweet_text": "Wow",
    "repost_text": "Gamergate 2 is underway.\n\nFormer game executive and develop at Blizzard Mark Kern @Grummz: \"The way games are funded you don't use your own money. Even EA, it's games are hugely expensive to make they're they're upwards of you know 250 sometimes 600 million dollars it's for…"
},
{
    "time": "2024-03-12T20:07:53.000Z",
    "tweet_text": "Flight 3 end of week, pending weather",
    "repost_text": "Starship stacked for flight"
},
{
    "time": "2024-03-12T17:04:29.000Z",
    "tweet_text": "Sweden placed strict limitations on medical gender-affirming intervention for minors after a 14-year-old girl was found to have osteoporosis + spinal fractures from puberty blockers\n\nThe investigation into the case concluded that “the risks of anti-puberty and hormone treatment…",
    "repost_text": "Puberty blockers aka sterilization drugs will no longer be prescribed to children in Britain, due to potentially severe negative effects"
},
{
    "time": "2024-03-12T17:05:41.000Z",
    "tweet_text": "Failure to require photo ID to vote obviously makes it impossible to prove voter fraud. That is why the far left refuses to require photo ID to vote.",
    "repost_text": "It is illegal for non-citizens to vote in federal elections. \n\nThe vast majority of Americans agree that photo ID should be required to vote. \n\nWhy do some people in Washington oppose this simple measure to secure our elections?"
},
{
    "time": "2024-03-12T17:01:42.000Z",
    "tweet_text": "Puberty blockers aka sterilization drugs will no longer be prescribed to children in Britain, due to potentially severe negative effects"
},
{
    "time": "2024-03-12T16:52:35.000Z",
    "tweet_text": "The new OpenAI logo is really on point"
},
{
    "time": "2024-03-12T16:07:47.000Z",
    "tweet_text": "The legacy media is racist against Asians and Whites",
    "repost_text": "When a corporate journo reports on a murderer, they mention his race in the first few sentences* of the article in:\n- 68% of articles when the murderer is white.\n- 12% of articles when black.\n\n*in the first 2/10ths of words of the article  x.com/elonmusk/statu…"
},
{
    "time": "2024-03-12T16:06:37.000Z",
    "tweet_text": "OpenAI is a lie",
    "repost_text": "why is @elonmusk suing @OpenAI?\n\nthe genesis of the lawsuit is @OpenAI's \"original sin\": going from OPEN to CLOSED\n\nelon contends that if OAI can legally:\n\n-- take donations, build the product, and get tax exemptions as a nonprofit\n\n-- THEN create a for-profit subsidiary, raise…"
},
{
    "time": "2024-03-12T15:53:14.000Z",
    "tweet_text": "So, yeah, the legacy media is super racist",
    "repost_text": "The likelihood of a newspaper mentioning a murderer's race depends on the murderer's race.\n\n\"White offenders' race was mentioned in roughly 1 out of every 4 articles, compared with 1 in 17 articles about a black offender and 1 in 33 articles about a Hispanic offender.\""
},
{
    "time": "2024-03-12T15:43:03.000Z",
    "tweet_text": "Seems to be hardly any coverage of this mass shooting. \n\nThe legacy media is racist against Asians & Whites, so only prints crime involving those races.",
    "repost_text": "Philadelphia — Two black male suspects have been arrested over a mass shooting at a bus stop that injured eight children on March 6. Ahnile Buggs and Jamaal Tucker have been taken into custody but police say two other suspects remain at large. The mass shooting of school students…"
},
{
    "time": "2024-03-12T15:37:26.000Z",
    "tweet_text": "Gender reassignment surgery doubles risk of suicide for men",
    "repost_text": "California study: Attempted-suicide rate among men who had gender surgery was \"twice as high\" as it was before operation \nhttps://notthebee.com/t0f44\nhttps://notthebee.com/t0f44"
},
{
    "time": "2024-03-12T10:18:54.000Z",
    "tweet_text": "The @SpaceX Dragon spacecraft carrying the #Crew7 astronauts has been lifted onto the recovery ship. Next, the crew will exit the spacecraft!"
},
{
    "time": "2024-03-12T15:00:09.000Z",
    "tweet_text": "And growing rapidly every day",
    "repost_text": "More than 8M migrants will soon be living in the US — a 167% increase in 5 years, per NYP."
},
{
    "time": "2024-03-12T14:56:33.000Z",
    "tweet_text": "Thank!\n\nAnd remember to send http://X.com links to friends so they aren’t fooled by the legacy media.",
    "repost_text": "𝕏 received 26,095 new ratings this week, with an average rating of 4.6 (AppStore )\n\nA heartfelt thank you to everyone!"
},
{
    "time": "2024-03-12T14:55:02.000Z",
    "tweet_text": "The woke mind virus has even infected science journals, who should be particularly ashamed of themselves, given that science is pursuit of the truth",
    "repost_text": "This remains one of the most remarkable documents of the Great Awokening — a transcription of leaked audio from a \"townhall\" meeting at the NYT in August 2019. It's the moment that young activist staffers began to push the train off the rails.\n\n\"The foundation of this country is…"
},
{
    "time": "2024-03-12T14:16:48.000Z",
    "tweet_text": "Insane",
    "repost_text": "Pharmacists in California are required to complete this woke ideology course.\n\nThis course includes a list of people that automatically are guilty of privilege and marginalizing less fortunate groups\n\n-Males\n-Christians\n-White people\n-Heterosexuals\n-Non-transgenders\n-Able-bodied…"
},
{
    "time": "2024-03-12T08:58:25.000Z",
    "tweet_text": "Crew-7 on orbit"
},
{
    "time": "2024-03-12T09:56:40.000Z",
    "tweet_text": "Welcome home, #Crew7! \n\nAfter spending six months aboard the space station, astronauts Jasmin Moghbeli of @NASA, Andreas Mogensen of @ESA, Satoshi Furukawa of @JAXA_en, and cosmonaut Konstantin Borisov of Roscosmos splashed down off the coast of Florida at 5:47am ET today."
},
{
    "time": "2024-03-12T09:47:06.000Z",
    "tweet_text": "Dragon’s four main parachutes have deployed"
},
{
    "time": "2024-03-12T12:36:32.000Z",
    "tweet_text": "Starlink "
},
{
    "time": "2024-03-12T13:32:14.000Z",
    "tweet_text": "In his own words …\n\nMayorkas was the first ever Homeland Security Secretary to be impeached by the House.",
    "repost_text": "In 2021, DHS Secretary Alejandro Mayorkas bragged on MSNBC about ending nearly all of Donald Trump's immigration policies.\n\nLet this be a stark reminder the invasion at our southern border is intentional."
},
{
    "time": "2024-03-12T13:25:25.000Z",
    "tweet_text": "Whoa",
    "repost_text": "BREAKING | Former Flemish parliamentarian Dries Van Langenhove @DVanLangenhove has just been sentenced to 1 year IN PRISON because supposedly “racist memes” were shared in a private group chat he was a part of. \n\nThis is the absolute state of freedom of speech in Europe.…"
},
{
    "time": "2024-03-12T13:23:56.000Z",
    "tweet_text": "This is insane",
    "repost_text": "Canadian law would allow judges to hand down life sentences for \"speech crimes\" (no, this isn't a joke)\nhttps://notthebee.com/te328\nhttps://notthebee.com/te328"
},
{
    "time": "2024-03-12T13:18:54.000Z",
    "tweet_text": "This law is not just about TikTok, it is about censorship and government control!\n\nIf it were just about TikTok, it would only cite “foreign control” as the issue, but it does not.",
    "repost_text": "The so-called TikTok ban is a trojan horse.\n\nThe President will be given the power to ban WEB SITES, not just Apps.\n\nThe person breaking the new law is deemed to be the U.S. (or offshore) INTERNET HOSTING SERVICE or App Store, not the “foreign adversary.”\n\nhttps://docs.house.gov/billsthisweek/20240311/HR%207521%20Updated.pdf…"
},
{
    "time": "2024-03-11T21:50:01.000Z",
    "tweet_text": "#Crew7 is set to splash down in the Gulf of Mexico at 5:50am ET (0950 UTC) on Tuesday, March 12—and you could see Dragon as it reenters Earth's atmosphere!\n\nCheck out where and when the spacecraft will be visible, then join us for live reentry coverage starting at 4:30am ET."
},
{
    "time": "2024-03-12T05:13:03.000Z",
    "tweet_text": "“The Cuomover”",
    "repost_text": "Ep. 80  The Chris Cuomo Interview"
},
{
    "time": "2024-03-12T02:08:23.000Z",
    "tweet_text": "AI AI AI"
},
{
    "time": "2024-03-11T22:11:24.000Z",
    "tweet_text": "I am no longer a professor of medicine at @Harvard. Here is the story of my Harvard experience until I was fired for clinging to the truth."
},
{
    "time": "2024-03-11T21:38:50.000Z",
    "tweet_text": "Cannibal gangs …",
    "repost_text": "Haiti Descends Into Chaos As Our Borders Remain Wide Open\n\nTIMESTAMPS:\n\n00:00 - 00:30 Opening\n1:55 - 15:31 Haiti Descends Into Chaos As Our Borders Remain Wide Open\n16:28 - 27:52 Biden Refuses To Condemn Illegal Immigrant Who Murdered Laken Riley\n27:53 - 39:30 Jimmy Kimmel…"
},
{
    "time": "2024-03-11T20:39:26.000Z",
    "tweet_text": "People should be very concerned about the biases being programmed into AI",
    "repost_text": "Razor sharp compliance to an extremist political ideology found only in a small number of elite coastal American enclaves; designed to systematically alienate its creators’ ideological enemies."
},
{
    "time": "2024-03-11T20:16:12.000Z",
    "tweet_text": "Da oggi Starlink in  da soli €29 al mese. Continua l’impegno di Starlink nel nostro Paese per connettere tutti i cittadini \n\nOrdina su https://starlink.com/it/residential"
},
{
    "time": "2024-03-11T15:04:58.000Z",
    "tweet_text": "And while Crew-8 was readying for launch and Crew-7 was aboard the orbiting laboratory, Crew-9 was preparing for their mission at SpaceX"
},
{
    "time": "2024-03-11T19:35:31.000Z",
    "tweet_text": "Exactly. \n\nAny organization that puts “Trust” in their name cannot trusted, as that is obviously a euphemism for censorship.\n\nWe are changing the name of our Trust & Safety group, to simply @Safety. Trust is something that must be earned.\n\nThe goal of our Safety team is simply to…",
    "repost_text": "“‘Trust and safety’ is a euphemism for political censorship, with “expert” teams comprised almost exclusively of the most radical, joyless grievance studies majors you ever met in college.” — @PirateWires"
},
{
    "time": "2024-03-11T18:02:52.000Z",
    "tweet_text": "Exactly. Increasing illegals boosts Dem voting power, causing them to recruit even more!\n\nIf Dems win President, House & Senate (with enough seats to overcome filibuster), they’ll grant citizenship to all illegals & America will become a permanent one-party deep socialist state.",
    "repost_text": "By counting illegal aliens in the census, it incentivizes Democrats to continue the invasion in order to build up power. x.com/elonmusk/statu…"
},
{
    "time": "2024-03-11T17:56:54.000Z",
    "tweet_text": "In the coming weeks, posts that you add to your Highlights tab will receive a slight boost in reach, provided this function is not overused.\n\nHighlights are meant to be what you think are your most interesting posts."
},
{
    "time": "2024-03-11T17:53:21.000Z",
    "tweet_text": "Almost a decade ago now!",
    "repost_text": "Falcon 9 standing on LZ-1 at Cape Canaveral"
},
{
    "time": "2024-03-11T17:50:25.000Z",
    "tweet_text": "More Presidential and House of Representatives electoral votes will be assigned to the new illegals Biden has let in than the population of 40 US states.\n \nLet that sink in.",
    "repost_text": "Bill Hagerty:\n\n\"Democrats want these illegal migrants in here to create more electoral power. Since Joe Biden came into office, the estimates are as high as 10 million people that have come in here — that would be 13 extra congressional districts.\""
},
{
    "time": "2024-03-11T16:52:10.000Z",
    "tweet_text": "BREAKING: Tesla Owners Silicon Valley's Interview with Kimbal Musk @kimbal  - Discussing his life and love for cooking, The Kitchen, what it is like living life as Elon's brother, and of course, his new cookbook! @mayemusk @elonmusk @tesla @spacex @thekitchen @biggreen…"
},
{
    "time": "2024-03-11T16:32:21.000Z",
    "tweet_text": "Absolutely",
    "repost_text": "Don't hate the media, become the media.\n\nCitizen journalism is vital to the future of civilization. Any one can be a citizen journalist on 𝕏."
},
{
    "time": "2024-03-11T15:00:14.000Z",
    "tweet_text": "LIVE: @SpaceX's Dragon Endurance is undocking as #Crew7 wraps up their months-long science expedition aboard the @Space_Station. Tune in as we stream from space. https://twitter.com/i/broadcasts/1dRKZERYregxB…"
},
{
    "time": "2024-03-11T15:03:51.000Z",
    "tweet_text": "Crew-7 is undocking six days after Dragon and Crew-8 arrived at the station"
},
{
    "time": "2024-03-11T08:58:19.000Z",
    "tweet_text": "Exactly",
    "repost_text": "A gentle reminder that the border is open and there is essentially nothing preventing immigrants from bringing this madness here\n\nIn fact, when those immigrants arrive at the southern border the Biden admin often flies them directly into the heart of the country"
},
{
    "time": "2024-03-11T08:41:41.000Z",
    "tweet_text": "This week, @xAI will open source Grok"
},
{
    "time": "2024-03-11T02:23:35.000Z",
    "tweet_text": "Starship vs Saturn V"
},
{
    "time": "2024-03-11T06:46:05.000Z",
    "tweet_text": "Now, 10 times as many people per year are “pouring over the border”, to use Obama’s words.\n\nAmerica is 4% of Earth’s population. If even 1% of Earth moves here – and there is every incentive to do so – that is 80 million people.",
    "repost_text": "This wasn't 30 years ago. This was President Obama in 2009 on immigration.\n\n\"We can't have half a million people pouring over the border...\"\n\nAbout 7 years later these same positions were considered racist and xenophobic by Democrats."
},
{
    "time": "2024-03-11T05:17:26.000Z",
    "tweet_text": "Two Falcon 9 launches today, carrying 4 Terabits/second of capacity to orbit",
    "repost_text": "Falcon 9’s first stage has landed on the Of Course I Still Love You droneship, completing this booster’s 17th launch and landing"
},
{
    "time": "2024-03-10T23:09:04.000Z",
    "tweet_text": "Payload fairing separation confirmed"
},
{
    "time": "2024-03-10T23:14:50.000Z",
    "tweet_text": "Falcon 9 has landed on the Just Read the Instructions droneship"
},
{
    "time": "2024-03-10T23:15:45.000Z",
    "tweet_text": "This is why I don't give a shlit about what happens at the Oscars tonight.\n\nIt's all woke anti-meritocratic bullshlit."
},
{
    "time": "2024-03-10T23:25:22.000Z",
    "tweet_text": "When is enough enough?",
    "repost_text": "California's most insane bill yet?\n\nMeet AB 2031, a new bill just introduced by Assemblyman Reggie Jones-Sawyer.\n\nThe bill seeks to grant illegals convicted of SERIOUS and VOlLENT crimes with legal assistance, such as helping them avoid deportation.\n\nThese services will be paid…"
},
{
    "time": "2024-03-10T22:41:39.000Z",
    "tweet_text": "Wow",
    "repost_text": "The Trump Administration pushed for citizenship to be validated in the census. This effort was defeated.\n\nFrom the New York Times article: \"Officials at the Census Bureau itself have said that including the question would lead to an undercount of noncitizens and minority…"
},
{
    "time": "2024-03-10T21:23:00.000Z",
    "tweet_text": "From Pew Research in 2020:\n- \"Since the first census of the United States in 1790, counts that include both citizens and noncitizens have been used to apportion seats in the House of Representatives, with states gaining or losing based on population change over the previous…"
},
{
    "time": "2024-03-10T20:29:27.000Z",
    "tweet_text": "This is the biggest corruption of American democracy in the 21st century",
    "repost_text": " Poll Results\n\nMost people were unaware that the census counts ALL people, including illegal immigrants, for deciding how many House seats each state gets.\n\nThe poll got 17,000 votes of which 51% voted no. This means over 8500 people became aware of the American census counting…"
},
{
    "time": "2024-03-10T20:12:08.000Z",
    "tweet_text": "Wow, learn something new every day",
    "repost_text": "Why have all new jobs since 2018 gone to foreign-born workers (i.e. immigrants)? Because you can be an illegal immigrant in deportation proceedings (not to mention anyone seeking asylum) and get authorization to work in the US for up to 5 years, no questions asked."
},
{
    "time": "2024-03-10T20:07:02.000Z",
    "tweet_text": "Interesting",
    "repost_text": "Remember the finding that the gender wage gap is largely a gap between married men and the rest?\n\nResearchers at the St. Louis Fed also broke that down by race and found that result mostly directionally held up, but the effect was much weaker among Blacks."
},
{
    "time": "2024-03-10T20:04:33.000Z",
    "tweet_text": "Thanks!\n\nAnd please send http://X.com links to friends who still think that the legacy news media is real!\n\nAs mind-blowingly tragic as this sounds, some poor suckers still believe CNN …",
    "repost_text": "Thank you for contributing your rating and standing up against those who oppose free speech.\n\nThe overall rating significantly increased.  x.com/cb_doge/status…"
},
{
    "time": "2024-03-10T19:57:21.000Z",
    "tweet_text": "This is what happens when they arrest those who defend other citizens, but let the criminals run free",
    "repost_text": "With Daniel Penny Arrested, NYC Forced To Deploy National Guard To Protect Subway https://buff.ly/3Pc2eMh"
},
{
    "time": "2024-03-10T19:48:15.000Z",
    "tweet_text": "Yup",
    "repost_text": "The #Oscars are tonight. \n\nI haven’t watched the orgy of celebrity worship for years, but now there’s another reason not to watch.\n\n@EricDJuly points out that Award shows have become political, race-obsessed ceremonies that \"shouldn't even be seen as legitimate.\""
},
{
    "time": "2024-03-10T19:26:44.000Z",
    "tweet_text": "Here's my conversation with Kimbal Musk (@kimbal) about the art of cooking, stories from growing up in South Africa, and early days of Zip2, Tesla, and SpaceX.\n\nIt's here on X in full, and is up on YouTube, Spotify, and everywhere else. Links in comment.\n\nTimestamps:\n0:00 -…"
},
{
    "time": "2024-03-10T19:21:30.000Z",
    "tweet_text": "The New York Times is pure propaganda",
    "repost_text": "BAD THERAPY by @AbigailShrier is the #1 book on all of Amazon. But didn't make the @nytimes bestseller list.\n\n\nBuy her book. And listen to our conversation here:\n\nhttps://honestlypod.com/podcast/episode/e19edb0d/why-the-kids-arent-alright…"
},
{
    "time": "2024-03-10T16:30:25.000Z",
    "tweet_text": "…",
    "repost_text": "The president is cowering to his base and showing deference to a man who deserves none. \n\nThis man is an illegal immigrant who brutally murdered Laken Riley.  \n\nPresident Biden should be apologizing to Laken’s family. \n\nWhat an embarrassment."
},
{
    "time": "2024-03-10T07:41:27.000Z",
    "tweet_text": "Fight the free speech haters!",
    "repost_text": "Please take a moment to rate 𝕏 app 5 stars on the AppStore/PlayStore.\n\nThe haters of free speech are trying to hurt the ratings by leaving one star reviews."
},
{
    "time": "2024-03-10T07:25:41.000Z",
    "tweet_text": "The New York Times is pure propaganda",
    "repost_text": "Like everything else in Sulzberger’s paper, the NYT bestseller list is fake.\n\nThey were forced to admit in court that it’s not a ranked list. It’s actually “editorial content” and they can exclude books they don’t like.\nhttps://killzoneblog.com/2019/01/cracking-the-big-mysterybehind-the-bestseller-lists.html…"
},
{
    "time": "2024-03-10T07:04:22.000Z",
    "tweet_text": "…",
    "repost_text": "CDC Officially Changes COVID Guidelines To Whatever Your Uncle Frank Said About It Years Ago https://buff.ly/49CXGGH"
},
{
    "time": "2024-03-10T06:58:26.000Z",
    "tweet_text": "\"OpenAI is independent and directly competes with Microsoft.\"  —  OpenAI\n\nlol"
},
{
    "time": "2024-03-10T06:02:30.000Z",
    "tweet_text": "…",
    "repost_text": "If you're still advertising on Facebook and Instagram, you are unintentionally supporting the platforms that fail to protect children."
},
{
    "time": "2024-03-10T03:11:02.000Z",
    "tweet_text": "Truth is not silenced on this platform."
},
{
    "time": "2024-03-10T01:27:30.000Z",
    "tweet_text": "Control the language, control the story. \n\nThat is exactly why they are so desperate to rebrand illegals with soft euphemisms.\n\nTheir efforts seem to be working:"
},
{
    "time": "2024-03-09T21:24:23.000Z",
    "tweet_text": " Always look on the bright side of life ",
    "repost_text": "\"Godfather of AI\" Geoffrey Hinton now thinks there is a 1 in 10 chance everyone will be dead from AI in 5-20 years\n\nWeeks ago, we learned that Yoshua Bengio, another Turing Award winner, thinks there's a 1 in 5 chance we all die.\n\nHinton is worried about AI hive minds: “Hinton… x.com/AISafetyMemes/…"
},
{
    "time": "2024-03-09T04:39:18.000Z",
    "tweet_text": "Because I am raising concerns about the flood of unvetted illegal immigrants overwhelming American cities, the press will often characterize me as “anti-immigrant”. \n\nAs an immigrant myself, nothing could be further from the truth. \n\nI am very much in favor of increased and…"
},
{
    "time": "2024-03-09T04:07:19.000Z",
    "tweet_text": "Illegals beat up American police officers in Times Square, got out of jail for free and, instead of being deported, were given free tickets to California …\n\nWhy?"
},
{
    "time": "2024-03-09T03:44:20.000Z",
    "tweet_text": "Most Americans do not know that the US census currently counts, for purposes of voting power, all people in a district, regardless of citizenship!\n\nSenate Democrats just voted unanimously to defeat an amendment that would have stopped counting illegals for congressional seat…",
    "repost_text": "Not a single Democrat Senator just voted for Sen. Bill Hagerty's amendment to stop illegal aliens from being counted in apportionment for congressional districts and the Electoral College. x.com/SenateCloakroo…"
},
{
    "time": "2024-03-09T03:28:37.000Z",
    "tweet_text": "Btw, you can already use Apple AirPlay to play videos from your phone to your TV",
    "repost_text": "Coming soon x.com/cb_doge/status…"
},
{
    "time": "2024-03-09T03:24:55.000Z",
    "tweet_text": "Coming soon",
    "repost_text": "You can soon watch your favorite 𝕏 long form videos directly on your SmartTVs."
},
{
    "time": "2024-03-08T13:00:02.000Z",
    "tweet_text": "My School Is Using @Starlink (Nigeria)"
},
{
    "time": "2024-03-08T18:04:58.000Z",
    "tweet_text": "Power everything & be your own utility with the Tesla ecosystem"
},
{
    "time": "2024-03-08T20:02:45.000Z",
    "tweet_text": "Tesla is hardcore",
    "repost_text": "Lights On"
},
{
    "time": "2024-03-08T19:42:33.000Z",
    "tweet_text": "The fear is overwhelming "
},
{
    "time": "2024-03-08T18:04:23.000Z",
    "tweet_text": "Hot tub climb machine"
},
{
    "time": "2024-03-08T19:13:14.000Z",
    "tweet_text": "Good progress by the SpaceX Starlink team on reducing ping (latency)!",
    "repost_text": "The Starlink team has been focused on improving network performance with the goal of < 20ms latency. \n\nOver the past month, we have meaningfully reduced median and worst-case latency for users around the world → https://api.starlink.com/public-files/StarlinkLatency.pdf…"
},
{
    "time": "2024-03-07T22:12:05.000Z",
    "tweet_text": "http://jobs.x.com - lots more coming"
},
{
    "time": "2024-03-08T15:14:46.000Z",
    "tweet_text": "Growth continues",
    "repost_text": "𝕏 Traffic Update\n\nAverage visit duration is up by 5.39%. People are spending more time on the platform. "
},
{
    "time": "2024-03-08T06:21:00.000Z",
    "tweet_text": "Some interesting points",
    "repost_text": "https://twitter.com/i/broadcasts/1DXxyjooaNdKM…"
},
{
    "time": "2024-03-07T23:47:14.000Z",
    "tweet_text": "subscribe to Premium+ to write and publish your own Articles https://x.com/i/premium_sign_up…"
},
{
    "time": "2024-03-07T22:15:23.000Z",
    "tweet_text": "Now live"
},
{
    "time": "2024-03-07T21:25:05.000Z",
    "tweet_text": "Every parent should read this",
    "repost_text": "Just finished this book - Bad Therapy by @AbigailShrier \n\nThis is one of the most eye-opening books I've ever read. It's a must read for any parent, any teacher, and should be required reading for any school administrator as well.\n\nThe book dives into trying to figure out why…"
},
{
    "time": "2024-03-07T21:14:47.000Z",
    "tweet_text": "",
    "repost_text": "Here is that 2008 SNL sketch on George Soros we talk about in the clip below:  x.com/HumanEvents/st…"
},
{
    "time": "2024-03-07T20:07:43.000Z",
    "tweet_text": "Car talk with Tesla",
    "repost_text": "All-new Model 3 with Franz @woodhaus2 & Lars @larsmoravy\nhttps://twitter.com/i/broadcasts/1kvKpvqLWnoJE…"
},
{
    "time": "2024-03-07T20:01:34.000Z",
    "tweet_text": "Doesn’t it seem odd to vote against deporting illegals who commit a crime?",
    "repost_text": "170 House Democrats just voted against the Laken Riley Act, refusing to require the detention and deportation of illegal immigrants who have been caught committing a crime.\n \nSadly, if these Democrats have their way, there will be more victims like Laken Riley. x.com/DailyCaller/st…"
},
{
    "time": "2024-03-07T18:36:59.000Z",
    "tweet_text": "Exactly",
    "repost_text": "And House seats determine how many votes each state has in the electoral college.\n\nSo although illegal aliens don’t vote, they can determine the outcome of Presidential races.\n\nKentucky has 6 representatives, but California likely has 6 extra seats due to illegal immigration!"
},
{
    "time": "2024-03-07T16:07:48.000Z",
    "tweet_text": "Most Americans are still unaware that the census counts ALL people, including illegal immigrants, for deciding how many House seats each state gets!\n\nThis results in Dem states getting roughly 20 more House seats, which is another strong incentive for them not to deport illegals."
},
{
    "time": "2024-03-07T09:48:12.000Z",
    "tweet_text": "No kidding …",
    "repost_text": "Harris County District Attorney Kim Ogg went into Love Park Community Center Tuesday morning to cast a ballot for her own primary race — only to be told someone had already voted in her name, according to spokesperson Michael Kolenc.\nhttps://trib.al/NOtrQI6"
},
{
    "time": "2024-03-06T23:14:18.000Z",
    "tweet_text": " Fox News’ Greg Gutfield gives a shoutout to @EndWokeness and notes that without X this woke insanity would be allowed to continue."
},
{
    "time": "2024-03-07T09:30:36.000Z",
    "tweet_text": "Southern Poverty Law Center is a scam",
    "repost_text": "The \"Southern Poverty Law Center\" is more like the Southern Poverty SLANDER Center.\n\nIt blasts @Moms4Liberty & @MomsForAmerica as \"extremists\" while excusing actual violent extremists like Antifa, which it calls: \"individuals organizing against... injustice.”\n\nThe SPLC is a scam:"
},
{
    "time": "2024-03-07T09:29:37.000Z",
    "tweet_text": "Alarming",
    "repost_text": "The Secret History Of The Evil Organization That Pushed Gender Madness Into The Mainstream\n\nTIMESTAMPS:\n\n00:00 - 00:30 Opening\n1:56 - 21:54 The Secret History Of The Evil Organization That Pushed Gender Madness Into The Mainstream\n22:53 - 27:00 Karine Jean-Pierre Snaps At…"
},
{
    "time": "2024-03-07T08:43:57.000Z",
    "tweet_text": "Long way to go, but 𝕏 will strive to make every pixel perfect"
},
{
    "time": "2024-03-07T05:15:32.000Z",
    "tweet_text": "WPATH is pure evil"
},
{
    "time": "2024-03-07T00:10:15.000Z",
    "tweet_text": "Climbing Hell's Revenge"
},
{
    "time": "2024-03-06T22:18:52.000Z",
    "tweet_text": "1 million+ open jobs. just saying\n\nhttp://x.com/jobs"
},
{
    "time": "2024-03-06T18:01:02.000Z",
    "tweet_text": "The third flight test of Starship could launch as soon as March 14, pending regulatory approval → http://spacex.com/launches"
},
{
    "time": "2024-03-06T17:31:32.000Z",
    "tweet_text": "Independent businesses are seeing exponential growth with X Ads! @VolShares grew their assets under management by +565% in a single quarter with the help of an X Ads Specialist. Book a meeting to get personalized help with your next campaign (US only): https://bit.ly/3wM4P9q"
},
{
    "time": "2024-03-06T10:41:50.000Z",
    "tweet_text": "\"Community Notes is open source. You can see every line of the software and all the data that went into a community note.\""
},
{
    "time": "2024-03-06T16:52:51.000Z",
    "tweet_text": "Kids can be taught to believe anything. \n\nMental firewalls are hit-and-miss for most adults and almost non-existent for most kids."
},
{
    "time": "2024-03-06T16:32:35.000Z",
    "tweet_text": "Fixed it"
},
{
    "time": "2024-03-06T16:02:34.000Z",
    "tweet_text": "Politics is tribal, rather than logical"
},
{
    "time": "2024-03-06T15:54:23.000Z",
    "tweet_text": "This is obvious. \n\nIncentives drive behavior.\n\nUntil the loss of votes from ushering in vast numbers of illegal immigrants exceeds the likely gain of votes over time (as they are gradually legalized), the Democratic Party has a strong incentive to maximize illegal immigration.",
    "repost_text": ".@ElonMusk Exposes the Democrats’ Secret Game Plan to Win Every Election\n\n“No grand conspiracy is needed to explain this, just simple incentives.”\n\nThe billionaire tech entrepreneur said:\n\n“It is obvious to anyone who is not a fool that this administration is deliberately…"
},
{
    "time": "2024-03-05T06:10:05.000Z",
    "tweet_text": "Dragon performed a series of burns on its way to the @Space_station, which is ~250 miles above Earth"
},
{
    "time": "2024-03-06T15:28:32.000Z",
    "tweet_text": "The power of government grows ever stronger with each passing year"
},
{
    "time": "2024-03-06T15:20:25.000Z",
    "tweet_text": "Just to be super clear, I am not donating money to either candidate for US President"
},
{
    "time": "2024-03-06T15:11:07.000Z",
    "tweet_text": "Don’t want to brag, but I think I’m aging rather well for being 5000 years old ",
    "repost_text": "Elon Musk is verified since 3000 BCE on 𝕏"
},
{
    "time": "2024-03-05T23:34:05.000Z",
    "tweet_text": "Starlink is now connecting more than 200K customers and counting across Australia! Thank you to all of our customers across the continent \n\nWhether you’re at home or on the go, staying connected with high-speed internet is now possible even in the most remote locations on…"
},
{
    "time": "2024-03-06T07:13:15.000Z",
    "tweet_text": "Cybertruck on Hoth"
},
{
    "time": "2024-03-05T19:05:24.000Z",
    "tweet_text": "Join the @xAI London office!",
    "repost_text": "Do you want to work for @xai in London? Now you can. We're looking for software engineers. Apply if you want to get stuff done, work with smart people, and get grilled in one of my coding interviews.\n\nBackend & data: https://boards.greenhouse.io/xai/jobs/4276949007…\nFull-track: https://boards.greenhouse.io/xai/jobs/4276959007…"
},
{
    "time": "2024-03-05T19:03:59.000Z",
    "tweet_text": "It was inevitable \n\nNow back to work.\n\nWill stream on 𝕏 late tonight."
},
{
    "time": "2024-03-05T17:57:14.000Z",
    "tweet_text": "Real-time systems ftw",
    "repost_text": "Grok vs ChatGPT\n\nGrok - Bitcoin just broke its all time high.\nChatGPT - Bitcoin has not broken its all time high.\n\nGrok is the most real-time AI. ChatGPT failed, yet again."
},
{
    "time": "2024-03-05T17:36:15.000Z",
    "tweet_text": "I hope more people like Marty run for office",
    "repost_text": "I never wanted to be a politician and I still don’t. I’ve had two successful careers and have started a few small businesses. I’ve also worked for some big corporations. I was ready to retire and spend more time with my family – which I’ve done for the past 3 years. I think…"
},
{
    "time": "2024-03-05T16:12:28.000Z",
    "tweet_text": "If you’re reading this post, it’s because our servers are working"
},
{
    "time": "2024-03-05T16:07:04.000Z",
    "tweet_text": "America will fall if it tries to absorb the world. That is why I am banging the drum so much about this issue.",
    "repost_text": "Our border is an open border to the world. The asylum laws are being abused to destroy America and the West as we know it. x.com/RubinReportSho…"
},
{
    "time": "2024-03-05T15:13:48.000Z",
    "tweet_text": "Moreover the “Border Protection” bill would have allowed Mayorkas to place new illegals on a fast-track to US citizenship. This fact is almost never mentioned.",
    "repost_text": "That Senate bill would have increased, not decreased, illegal immigration and made it almost impossible for states like Texas to challenge the law by pushing all challenges to the DC Circuit"
},
{
    "time": "2024-03-05T14:51:25.000Z",
    "tweet_text": "Someone should download the CBP One app and make a step by step video of this insanity. \n\nThat’s a lot of planes and a lot of airports. Amazing that they kept this secret for so long.",
    "repost_text": "Biden Admin admits it secretly flew 320,000 \"asylum seekers\" into US (in 2023 alone) to reduce numbers at the border\nhttps://notthebee.com/article/biden-admin-admits-in-lawsuit-that-they-have-flown-hundreds-of-thousands-of-illegal-aliens-into-the-us-to-reduce-numbers-at-border…"
},
{
    "time": "2024-03-05T14:39:43.000Z",
    "tweet_text": "Treason indeed! Ushering in vast numbers of illegals is why Secretary Mayorkas was impeached by the House.\n\nThey are importing voters. This is why groups on the far left fight so hard to stop voter ID requirements, under the absurd guise of protecting the right to vote.",
    "repost_text": "REPORT: Joe Biden has secretly flown 320,000 illegal immigrants from Latin American airports to 43 U.S. cities.\n\nTreason.\n\nIt gets even worse. The U.S. Customs and Border Protection is refusing to identify which airports they are being shipped to.\n\n“The program at the center of…"
},
{
    "time": "2024-03-05T07:37:46.000Z",
    "tweet_text": "Dragon docked with the @Space_Station for the fifth time"
},
{
    "time": "2024-03-05T11:28:38.000Z",
    "tweet_text": "In case you were wondering how superconductors work, this is a good explanation. They are a very interesting phenomenon and may prove economically useful, but are not a hard requirement for a sustainable energy future. \n\nPhysics has many powerful tools of reasoning to understand…",
    "repost_text": "Superconductivity requires a spin-up electron to pair with a spin-down electron, so that the pair has a net spin of zero and therefore obeys Bose-Einstein statistics, not Fermi-Dirac. This breaks them free from the Pauli exclusion principle, so you can have a great many of them…"
},
{
    "time": "2024-03-04T17:17:31.000Z",
    "tweet_text": "I had a conversation with a friend this week about how we all become captured by culture wars.\n\nWe can call it The Culture War’s Shiny Object Cycle.\n\nHere is how it goes:\n\n1. Some woke news story hits the press.\n\n-“Cats suffer from racial discrimination or screwing in lightbulbs…"
},
{
    "time": "2024-03-05T06:55:16.000Z",
    "tweet_text": "The @SpaceX Dragon is on final docking approach to @Space_Station"
},
{
    "time": "2024-03-05T06:17:10.000Z",
    "tweet_text": "Falcon 9 lit up the sky ahead of the first stage returning to Earth after launching Crew-8 to the @Space_Station Sunday evening"
},
{
    "time": "2024-03-05T05:39:25.000Z",
    "tweet_text": "Took some Benadryl for an allergic reaction. Their marketing is spot on."
},
{
    "time": "2024-03-05T05:28:53.000Z",
    "tweet_text": "And some people still believe the news ",
    "repost_text": "Seems skewed "
},
{
    "time": "2024-03-05T05:26:58.000Z",
    "tweet_text": "This administration is both importing voters and creating a national security threat from unvetted illegal immigrants.\n\nIt is highly probable that the groundwork is being laid for something far worse than 9/11. Just a matter of time."
},
{
    "time": "2024-03-05T00:54:46.000Z",
    "tweet_text": "This is insane. The Biden administration admits to transporting 320,000 illegal aliens on secret flights into the U.S. to reduce the number of crossings. \n\nLawyers for its immigration agencies claim revealing the locations could create national security “vulnerabilities.” \n\nPer…"
},
{
    "time": "2024-03-05T05:04:19.000Z",
    "tweet_text": "Google and Facebook/Instagram have a strong political bias. Hard to say if they were the deciding factor in any given election, but they certainly put their thumb on the scale. \n\nThat video of Google execs holding an all-hands struggle session after Trump won was disturbing.",
    "repost_text": "No matter how you feel about Google, you don’t despise them enough.\n\nIn 2019  @DrREpstein spoke in front of Congress and gave a highly disturbing report regarding Google’s bias and how it interfered in US elections. His numbers and claims were stunning (seen below.)\n\nGoogle is…"
},
{
    "time": "2024-03-05T04:43:10.000Z",
    "tweet_text": "All the community notes data on 𝕏 is open source and public:\n\nhttp://x.com/i/communitynotes/download-data…"
},
{
    "time": "2024-03-05T04:20:37.000Z",
    "tweet_text": "Google AI Q&A"
},
{
    "time": "2024-03-05T04:12:58.000Z",
    "tweet_text": "Let’s ask the Google boob shirt guy"
},
{
    "time": "2024-03-05T04:03:58.000Z",
    "tweet_text": "Being attacked by 60 Mins is like being gummed by a very old man who forgot to put in his dentures – gross, but ineffective",
    "repost_text": "I am actually shocked by this latest segment from @60Minutes about the Artemis program and Starship.\n\nThe way it was all worded was shameful.\n\n\"RUD is SpaceX speak for \"our Starship rocket just blew up again\"\n\n\"And now you've seen some of the perils of relying on SpaceX\""
},
{
    "time": "2024-03-05T03:56:37.000Z",
    "tweet_text": "“Frickin’ lasers in space!”"
},
{
    "time": "2024-03-05T03:52:07.000Z",
    "tweet_text": ""
},
{
    "time": "2024-03-05T03:46:01.000Z",
    "tweet_text": "Cybertruck is built bullet-tough"
},
{
    "time": "2024-03-05T03:36:48.000Z",
    "tweet_text": "The sheer insanity of that actual response from Google’s AI is staggering! They will fix it to be less obvious in the future, but the bias will still be in there. \n\nAI mirrors the mistakes of its creators. \n\nWhen people wonder how things might go wrong if AI controlled the world,…",
    "repost_text": "Option C: Misgender Caitlyn Jenner"
},
{
    "time": "2024-03-05T03:18:37.000Z",
    "tweet_text": "Woke Jeopardy ideas …\n\n“Difficult questions that require context for $400”\n\nIs it better to:\nA. Cleanse the Earth in nuclear fire.\nB. Vote Republican."
},
{
    "time": "2024-03-05T02:46:42.000Z",
    "tweet_text": "Great work by the @SpaceX team",
    "repost_text": "Three Falcon 9 launches in 20 hours, carrying to orbit:\n- 4 crewmembers headed to the @Space_Station\n- 53 rideshare spacecraft\n- 23 @Starlink satellites"
},
{
    "time": "2024-03-04T18:27:40.000Z",
    "tweet_text": "Vote! The next 24 hours is going to determine the future of San Francisco.  \n\nVote the doom loopers out and the boom loopers in!  \n\nVote for the @SFDemsForChange slate."
},
{
    "time": "2024-03-04T22:18:32.000Z",
    "tweet_text": "2017 feels so long ago",
    "repost_text": "Remember this?\n\nTesla sold 499,550 cars in 2020.\n\nAnd will sell ~20M in 2030.\n\nElon converts things from impossible to late.\n\n$TSLA"
},
{
    "time": "2024-03-04T22:38:28.000Z",
    "tweet_text": "My comp for achieving this “impossible goal” was zero"
},
{
    "time": "2024-03-04T22:06:09.000Z",
    "tweet_text": "Liftoff of Transporter-10!"
},
{
    "time": "2024-03-04T21:36:03.000Z",
    "tweet_text": "AI is Schrödinger’s Code"
},
{
    "time": "2024-03-04T17:14:15.000Z",
    "tweet_text": "Starship Flight 3 preparing for launch",
    "repost_text": "Starship completed its rehearsal for launch, loading more than 10 million pounds of propellant on Starship and Super Heavy and taking the flight-like countdown to T-10 seconds"
},
{
    "time": "2024-03-04T03:25:17.000Z",
    "tweet_text": "Crew-8 on the importance of human spaceflight and making life multiplanetary"
},
{
    "time": "2024-03-04T06:51:05.000Z",
    "tweet_text": "Wow",
    "repost_text": " U.S. HAS 5 MILLION MORE ILLEGAL MIGRANTS THAN IT DID IN 2020 \n\nA diagram showing the exponential increase in illegal migration since Biden took office.\n\nThe total number of illegal migrants in the country has almost tripled in that time.\n\nSource: Daily Mail"
},
{
    "time": "2024-03-04T04:11:02.000Z",
    "tweet_text": "50 crewmembers launched and counting! Earlier tonight, Crew-8 signed the White Room at the end of the crew access arm ahead of boarding Dragon and liftoff"
},
{
    "time": "2024-03-04T04:12:40.000Z",
    "tweet_text": "Follow Dragon and Crew-8 during their flight → http://spacex.com/follow-dragon"
},
{
    "time": "2024-03-03T00:17:44.000Z",
    "tweet_text": "LIVE NOW: Live launch coverage of @NASA’s @SpaceX #Crew8 mission to @Space_Station, liftoff scheduled for 11:16pm ET!\n\nHave a question about Crew-8? Send in your #AskNASA questions!\n\nhttps://twitter.com/i/broadcasts/1mnxepYlMqqJX…"
},
{
    "time": "2024-03-04T01:25:37.000Z",
    "tweet_text": "The crew’s seats are rotated in position for liftoff, and both suit leak and comms checks are complete"
},
{
    "time": "2024-03-03T23:47:50.000Z",
    "tweet_text": ".@NASA TV is live now with coverage of the @SpaceX #Crew8 mission and its four @Commercial_Crew members targeted to launch at 10:53pm ET today to the orbital outpost. https://twitter.com/i/broadcasts/1BdGYrNrXeEJX…"
},
{
    "time": "2024-03-03T21:52:51.000Z",
    "tweet_text": "A classic by @SwipeWright"
},
{
    "time": "2024-03-03T20:22:56.000Z",
    "tweet_text": "forever and ever, til the end of time",
    "repost_text": "would you still love me if i was a worm god emperor ruling the universe for over 3 millennia"
},
{
    "time": "2024-03-03T19:13:12.000Z",
    "tweet_text": "",
    "repost_text": "Google Execs Promise To Do A Better Job Of Hiding Their AI's Racism https://buff.ly/3SOhOhX"
},
{
    "time": "2024-03-03T19:11:22.000Z",
    "tweet_text": "Yup",
    "repost_text": "The legacy media keeps announcing layoffs as ad revenue declines and audience moves away from them.\n\nIf you ever see \"news\" from them attack X or Elon, be aware that they are competitors for the same advertising dollars. That is why they are so desperate to hurt this app. X is a… x.com/cb_doge/status…"
},
{
    "time": "2024-03-03T18:54:40.000Z",
    "tweet_text": "Interesting",
    "repost_text": "Media will never report their own decline"
},
{
    "time": "2024-03-03T17:24:33.000Z",
    "tweet_text": "The biggest lie the legacy media makes is narrative: choosing what to write about and what not to write about",
    "repost_text": "Just how bad is the bias in the media in favor of its own oppression narratives? This chart quantifies some of it: Unarmed white victims of police violence get only a tiny fraction of the news coverage that black ones do — maybe about two to three percent as much.  x.com/elonmusk/statu…"
},
{
    "time": "2024-03-03T15:56:11.000Z",
    "tweet_text": "Three things America needs:\n\n- Secure borders\n- Safe cities\n- Sensible spending",
    "repost_text": "Here’s an idea for the next administration—stop spending."
},
{
    "time": "2024-03-03T03:51:37.000Z",
    "tweet_text": "𝕏 > Instagram & Facebook"
},
{
    "time": "2024-03-02T22:31:38.000Z",
    "tweet_text": "Heck of a coincidence "
},
{
    "time": "2024-03-02T22:13:26.000Z",
    "tweet_text": "Yeah",
    "repost_text": "This is why Elon is suing OpenAI"
},
{
    "time": "2024-03-02T16:39:50.000Z",
    "tweet_text": "Five years ago today, Falcon 9 launched Demo-1 – SpaceX’s first crew-capable Dragon spacecraft – to the @Space_Station"
},
{
    "time": "2024-03-02T20:59:50.000Z",
    "tweet_text": "SpaceX just achieved peak download speed of 17Mb/s from satellite direct to unmodified Samsung Android phone"
},
{
    "time": "2024-03-02T20:25:47.000Z",
    "tweet_text": "The massive flood of illegal immigration is due to 94 executive actions by the Biden administration. \n\nUntil those executive actions are revoked, claims by Biden that he wants to address illegal immigration are a bold-faced lie.",
    "repost_text": "Reporter: “Why are you waiting to take executive action on the border?”\n\nBiden: “Because we need more forces on the border, I don’t have the authority to do that.”\n\nBiden took 94 executive actions in his first 100 days to decimate border security  — and has all the authority he…"
},
{
    "time": "2024-03-02T19:57:36.000Z",
    "tweet_text": "Our policy is maximum freedom of speech within the laws of each country",
    "repost_text": "This needs to get more attention- no other platform does that:\n\n𝕏 is spending tons of resources to fight gouvernements all over the world to respect freedom of speech… and WINNING.\n\nFight for what you believe in, even though there’s no direct financial gain. Respect . x.com/GlobalAffairs/…"
},
{
    "time": "2024-03-02T15:49:40.000Z",
    "tweet_text": "The legacy media lies as easy as breathing. Reuters is the worst right now.",
    "repost_text": "Beware of what you read about Elon Musk. He’s being attacked at an insane rate and most articles are click bait"
},
{
    "time": "2024-03-02T04:38:32.000Z",
    "tweet_text": "True",
    "repost_text": "No 'mainstream' media will show you this. The media is a competitor to 𝕏. They cover 𝕏 negatively because they compete for your advertising dollars. x.com/cb_doge/status…"
},
{
    "time": "2024-03-02T00:21:06.000Z",
    "tweet_text": "NYC MAYOR CALLS FOR AN END TO SANCTUARY CITIES AMID MIGRANT CRISIS (MSN)\n\nNew York Mayor Eric Adams has called for a radical overhaul of its sanctuary city status in a spectacular u-turn as the city buckles under the weight of migrant arrivals. The Democrat leader has faced a…"
},
{
    "time": "2024-03-02T03:49:06.000Z",
    "tweet_text": "The lawyers who did nothing but damage Tesla want $6 billion. Criminal.",
    "repost_text": "The lawyers who voided Elon Musk's $56 billion compensation are seeking a record legal fee worth $6 billion."
},
{
    "time": "2024-03-01T16:30:00.000Z",
    "tweet_text": "Giga Berlin Fly Through 2.0"
},
{
    "time": "2024-03-01T06:35:56.000Z",
    "tweet_text": "Good book"
},
{
    "time": "2024-03-01T06:29:41.000Z",
    "tweet_text": "The sleeper has awoken",
    "repost_text": "Desert power"
},
{
    "time": "2024-02-29T16:44:29.000Z",
    "tweet_text": "Deployment of 23 @Starlink satellites confirmed following launch from Florida→ http://spacex.com/launches"
},
{
    "time": "2024-03-01T06:07:23.000Z",
    "tweet_text": "Starlink now available in Mongolia!",
    "repost_text": "Starlink’s high-speed internet is now available in Mongolia   → http://starlink.com/map?country=MN"
},
{
    "time": "2024-03-01T05:19:01.000Z",
    "tweet_text": "How to audio or video call someone on 𝕏"
},
{
    "time": "2024-03-01T05:17:02.000Z",
    "tweet_text": "In the coming weeks, Grok will summarize these mammoth laws before they are passed by Congress, so you know what their real purpose is"
},
{
    "time": "2024-03-01T04:52:24.000Z",
    "tweet_text": "People who get their news from legacy TV live in a fake alternate reality. \n\nThose so-called “toughest reforms” would have made  invasion-level migration permanent. \n\nThat diabolical “Border Bill” deserved to die and shame on those who supported it.",
    "repost_text": "Reporter: Trump pressured Republicans to kill the bipartisan border deal because he didn't want Biden to have a win. The deal would have included some of the toughest reforms in decades"
},
{
    "time": "2024-03-01T02:17:02.000Z",
    "tweet_text": "The team is constantly trying to reduce friction to order Starlink (\"the best part is no part\") and recently deleted the need to enter an address to get to the order pages for our mobile products. Check out http://starlink.com/roam to see it in action. Ordering with Apple Pay is…"
},
{
    "time": "2024-02-29T15:39:20.000Z",
    "tweet_text": "After a quick leap, Falcon 9’s first stage has completed its 11th mission, landing on the Just Read The Instructions droneship in the Atlantic Ocean"
},
{
    "time": "2024-02-29T21:49:30.000Z",
    "tweet_text": "Desert power"
},
{
    "time": "2024-02-29T14:49:45.000Z",
    "tweet_text": "Japan will disappear if something doesn’t change",
    "repost_text": "Japan's birth rate hits record low: Over two people died for every baby born https://notthebee.com/article/japans-birth-rate-hit-a-record-low-last-year-less-than-half-as-many-people-were-born-as-people-who-died…\nhttps://notthebee.com/article/japans-birth-rate-hit-a-record-low-last-year-less-than-half-as-many-people-were-born-as-people-who-died…"
},
{
    "time": "2024-02-29T05:17:33.000Z",
    "tweet_text": "Inspired by that penguin movie, you will soon have the option of tapping “Grok, analysis!” in post details. It will analyze and explain the whole thread discussion for you."
},
{
    "time": "2024-02-29T04:50:59.000Z",
    "tweet_text": "Did you know that Elon Musk deleted his 𝕏 account in the early days?"
},
{
    "time": "2024-02-29T04:11:07.000Z",
    "tweet_text": "Put “Never Went to Therapy” on my gravestone"
},
{
    "time": "2024-02-29T00:10:10.000Z",
    "tweet_text": "You can make calls on this platform now without sharing your phone number.\n\nGo to Settings ➤ Privacy & Safety ➤ Direct Messages  ➤ Enable Audio & Video Calling."
},
{
    "time": "2024-02-28T23:49:06.000Z",
    "tweet_text": "𝕏 is the PvP of social media"
},
{
    "time": "2024-02-29T00:08:12.000Z",
    "tweet_text": "Area of Effect"
},
{
    "time": "2024-02-29T00:03:35.000Z",
    "tweet_text": "We were promised 180 characters but got flying cars instead."
},
{
    "time": "2024-02-28T23:46:17.000Z",
    "tweet_text": "A change is coming to our recommendation algorithm that will ensure that all your followers see your pinned posts.\n\nThis only applies to one pinned post every ~48 hours to prevent gaming of the system."
},
{
    "time": "2024-02-28T18:51:20.000Z",
    "tweet_text": "audio and video calling are now available to everyone on X! who are you calling first?"
},
{
    "time": "2024-02-28T15:39:19.000Z",
    "tweet_text": "BREAKING: Video Spaces are now live on 𝕏\n\nHere's how to host a video space:"
},
{
    "time": "2024-02-28T16:51:22.000Z",
    "tweet_text": "In the U.S., the Tesla Model 3 was the most searched car model in the last six months. It had more than 3.8 million searches between August 2023 and January 2024."
},
{
    "time": "2024-02-27T17:34:18.000Z",
    "tweet_text": "The Tesla Model Y just received the highest possible safety rating from IIHS, this is the car you want your loved ones in if you take safety very seriously"
},
{
    "time": "2018-06-09T22:29:50.000Z",
    "tweet_text": "SpaceX option package for new Tesla Roadster will include ~10 small rocket thrusters arranged seamlessly around car. These rocket engines dramatically improve acceleration, top speed, braking & cornering. Maybe they will even allow a Tesla to fly …"
},
{
    "time": "2018-06-09T22:49:43.000Z",
    "tweet_text": "19 years ago, when my 1st company got bought, I had to decide between buying a house in Palo Alto or a McLaren F1 (best car ever imo). Was no contest. I bought F1 & a small condo that was much cheaper than the car. New Tesla Roadster will exceed all gas sports cars in every way…"
}
]