[
{
    "time": "2023-06-06T13:38:02.000Z",
    "tweet_text": "There are only three truly censorship resistant technologies at scale today: tor, bitcoin, and nostr. \n\nAll are currently niche…showing most of the world doesn’t actually care about censorship.\n\nGranted, these technologies aren’t yet accessible or easy to use. But…they will be!"
},
{
    "time": "2024-04-29T05:30:59.000Z",
    "tweet_text": "algorithm is good enough now that following is just signaling"
},
{
    "time": "2024-04-29T05:19:02.000Z",
    "tweet_text": "free"
},
{
    "time": "2024-04-26T15:44:08.000Z",
    "tweet_text": "feels completely unnecessary",
    "repost_text": "On May 3rd, 2024, @PhoenixWallet will be removed from US app stores.\n\nUsers from the US should empty their wallet:\n- Settings > Close channels (Android)\n- Settings > Drain wallet (iOS)\n\nWe highly recommend *not force-closing* channels, as on-chain fees could be significant."
},
{
    "time": "2024-04-25T06:40:10.000Z",
    "tweet_text": "for more wars, PAUSE "
},
{
    "time": "2024-04-24T16:13:47.000Z",
    "tweet_text": "square sellers: auto-convert a percent of your daily sales to bitcoin: https://techcrunch.com/2024/04/24/block-now-lets-square-merchants-convert-a-part-of-their-daily-sales-to-bitcoin/?guccounter=1&guce_referrer=aHR0cHM6Ly9wcmltYWwubmV0Lw&guce_referrer_sig=AQAAAJQKIX6smxE9qoTZUU-q6PlvS7pbflpihtuJjFDu17emPyeb8Kdb_RDFlnYdCiVDhouM7gBY7pTcpGeyTpTclAgzERIK6T9YL1Xl9O4ulDV_6rQihD3qlGgvFUGPgbc-4hlOOgcbvorlJ9RsUIQZZ2-FS6GwV1GNRnl_o1WOKjtO…"
},
{
    "time": "2024-04-23T16:44:58.000Z",
    "tweet_text": "we’re building a mining rig"
},
{
    "time": "2024-04-19T21:08:45.000Z",
    "tweet_text": "21"
},
{
    "time": "2024-04-19T04:39:40.000Z",
    "tweet_text": "only",
    "repost_text": "We should send rockets not at each other, but rather to the stars"
},
{
    "time": "2024-04-16T19:53:15.000Z",
    "tweet_text": "W",
    "repost_text": "Craig Wright has discontinued his claims against Bitcoin developers (incl me) in the TTL case (where he was asking for a fork of bitcoin that seized random coins and gave him free money)!\n\nhttps://old.reddit.com/r/bsv/comments/1c5mdv2/notice_of_discontinuance/…"
},
{
    "time": "2006-03-21T20:50:14.000Z",
    "tweet_text": "just setting up my twttr"
},
{
    "time": "2024-03-20T21:46:01.000Z",
    "tweet_text": "watch this"
},
{
    "time": "2024-03-14T13:38:14.000Z",
    "tweet_text": "W\n\n\"I will make certain declarations which I am satisfied are useful and are necessary to do justice between the parties. First, that Dr Wright is not the author of the Bitcoin White Paper. Second, Dr Wright is not the person who adopted or operated under the pseudonym Satoshi…"
},
{
    "time": "2024-03-13T20:03:12.000Z",
    "tweet_text": "oh yeah",
    "repost_text": "On this day in 2006: Jack Dorsey began programming Twitter."
},
{
    "time": "2024-03-13T19:58:06.000Z",
    "tweet_text": "make your #bitcoin very hard to lose and easy to use. \n\nstarts shipping today."
},
{
    "time": "2009-01-11T03:33:52.000Z",
    "tweet_text": "Running bitcoin"
},
{
    "time": "2024-01-06T04:35:49.000Z",
    "tweet_text": ""
},
{
    "time": "2023-12-07T16:29:47.000Z",
    "tweet_text": "move your bitcoin off the exchanges:"
},
{
    "time": "2023-11-29T03:05:52.000Z",
    "tweet_text": "“she thought it was the ocean…it’s just the pool” https://ocean.xyz"
},
{
    "time": "2023-11-26T02:27:22.000Z",
    "tweet_text": "My brother @darkside wrote something beautiful about our little brother @andrew.\n\nI miss you, Dewey. "
},
{
    "time": "2023-09-14T00:33:57.000Z",
    "tweet_text": "My party has lost its way. Here is my open letter to the DNC, urging it to “Please, lead by example and hold the most transparent, equal, accessible, and accountable election that has ever been seen in this country.” #Kennedy24\nRead my letter here"
},
{
    "time": "2023-09-10T16:10:49.000Z",
    "tweet_text": "Yesterday's event to launch the David Miranda Institute -- @idm_org -- was as powerful and inspiring as I know the Institute's work will be, to continue and expand on David's legacy.\n\nHere's the video Edward @Snowden recorded for it: about David and his work:"
},
{
    "time": "2023-09-10T01:51:50.000Z",
    "tweet_text": "The magic bullet theory is now dead. This preposterous construction has served as the mainstay of the theory that a single shooter murdered President Kennedy since the Warren Commission advanced it 60 years ago under the direction of the former CIA Director Allen Dulles whom my…"
},
{
    "time": "2023-09-09T17:43:40.000Z",
    "tweet_text": "Today is a special day for our family. We are launching the David Miranda Institute, designed to preserve and build on David's work and legacy. It will focus on material improvements for those most in need.\n\nOur video on David's life and the Institute (enlarge for subtitles):"
},
{
    "time": "2023-09-07T21:26:28.000Z",
    "tweet_text": "a bit of bitcoin, the easy way: https://azte.co"
},
{
    "time": "2023-09-07T17:24:43.000Z",
    "tweet_text": "The always-smart and thoughtful @NellieBowles on why she quit the NYT to work in independent media, the severe ideological constraints imposed on reporters at liberal-run outlets, and why independent media is both more enjoyable and more consequential:"
},
{
    "time": "2023-09-06T16:46:00.000Z",
    "tweet_text": "#Google and #Apple charge app developers 30% of their earnings to allegedly vet for security risks.  \n\nAnd yet, a fake @Signal app has found its way into the @GooglePlay app store.  \n\nBig Tech monopolies don't lead to better security. They stifle innovation and kill competition.",
    "repost_text": "A Fake Signal App Was Planted On Google Play By China-Linked Hackers https://trib.al/ESdbAls"
},
{
    "time": "2023-09-06T00:06:00.000Z",
    "tweet_text": "The news media made propaganda their business model under President Ronald Reagan when he abolished the fairness doctrine. Here's how it happened."
},
{
    "time": "2023-09-06T17:17:11.000Z",
    "tweet_text": "After more than 7 years of building this company, I can finally say we’ve completed the user journey. Took a long time but super proud of this launch and the team behind it.",
    "repost_text": "Announcing Autoscale & Static deployments.\n\nThis is our biggest release yet, and it makes Replit the fastest place to go from idea to production for your next app. Deployments scale reliably with pricing that is cost-effective and transparent.\n\nHere's how it works:\nAutoscale…"
},
{
    "time": "2023-09-01T01:22:48.000Z",
    "tweet_text": "Everything in this conversation is right…which I learned through all my past actions. \n\nThe only solution is to build on unowned protocols like nostr and bitcoin.\n\nAll single points of control have to be removed.\n\n@SharylAttkisson @RobertKennedyJr @ggreenwald @JeninYounesEsq…"
},
{
    "time": "2023-08-31T19:54:18.000Z",
    "tweet_text": "Imagine how Satoshi would feel if you told him that all the Bitcoin was held at exchanges, banks, and the elite, and that all we managed to accomplish was an upgraded banking infrastructure over Lightning.\n\nNow tell me why you think we are not on that path?"
},
{
    "time": "2023-08-31T22:49:26.000Z",
    "tweet_text": "They washed off the names of 2,500 overdose victims written in chalk by the mothers of those victims like @Gina_MADAD so that Dean Preston and his open air drug den squad can flaunt their pro death policies\n\nSan Francisco’s corrupt political machine is a disgraceful clown show"
},
{
    "time": "2023-08-30T03:06:44.000Z",
    "tweet_text": "is this at all controversial?"
},
{
    "time": "2023-08-26T01:20:58.000Z",
    "tweet_text": "I. Don't. Support. Either. Side. Politically. Not the left, not the right. Im about supporting people and restoring local communities.\n\nNow, go breath some fresh air and relax. Please? :)  I'm not worth obsessing over, I promise. Go spend time with your loved ones."
},
{
    "time": "2023-08-25T22:28:29.000Z",
    "tweet_text": "Yes, we owe an enormous debt to Julian Assange!\n\nHere’s how he exposed the U.S. government‘s corrupt efforts to force Monsanto's toxic Roundup on the world."
},
{
    "time": "2023-08-25T15:17:47.000Z",
    "tweet_text": "People ask, what does corporate influence on government have to do with inflation?"
},
{
    "time": "2023-08-19T18:19:44.000Z",
    "tweet_text": "SimpleX Directory Service and v5.3 public beta are released!\n\nYou can search for public groups via the experimental SimpleX Directory Service, connect to it in SimpleX app via this address:"
},
{
    "time": "2023-08-18T05:00:22.000Z",
    "tweet_text": "deleted my instagram account after 12 years. was one of the first 10 accounts I believe, and one of the first angel investors. \n\nwho will they give the @jack handle to?"
},
{
    "time": "2023-08-16T23:39:46.000Z",
    "tweet_text": "America reacts to \"Rich Men North of Richmond\""
},
{
    "time": "2023-08-18T04:46:01.000Z",
    "tweet_text": "collaborate to make music via nostr: https://stemstr.app\n\n(Nostr is an open app protocol, not a social network)"
},
{
    "time": "2023-08-16T06:54:31.000Z",
    "tweet_text": "A good reminder that @CommunityNotes code and data is open source, making it possible to do public analyses of its performance and attributes, like this one today from @VitalikButerin "
},
{
    "time": "2023-08-15T13:48:32.000Z",
    "tweet_text": "The Red Cross raised $500 million for Haiti earthquake relief in 2010, spent 25% on internal administrative costs, built about 6 houses for Haitians and refuses to say what it did with the rest of the money. And Michelle Obama helped lead their fundraising drive.",
    "repost_text": "It will take all of us coming together and doing what we can to help those in need in Maui and Lāhainā right now. I hope you’ll join me in donating to the Hawai'i Red Cross today: http://redcross.org/donate/cm/khon2-pub.html…"
},
{
    "time": "2023-08-15T17:06:35.000Z",
    "tweet_text": "Golden State Warriors logo redesign. Which team should I do next??"
},
{
    "time": "2023-08-14T23:49:13.000Z",
    "tweet_text": "When will people figure out that the US federal govt always always has infinite money for war but never enough money to help the people it supposedly represents. They are fronts for professional thieves engaged in a perpetual wealth transfer from us to them.",
    "repost_text": "Over 2,700 structures were destroyed in Lahaina, Maui, valued at approximately $5.6 billion.\n\nMeanwhile, President Joe Biden, with $115 billion sent to Ukraine, offers just $1.9 million ($700 per household) to Lahaina.\n\nThis is deeply insulting."
},
{
    "time": "2023-08-11T16:32:23.000Z",
    "tweet_text": "Stop ruining land + water. Stop poisoning the earth. Protect what remains + regenerate what was damaged. Healthy ecosystems stabilize weather and mitigate flood-drought cycle. They also draw down carbon."
},
{
    "time": "2023-08-09T21:57:48.000Z",
    "tweet_text": "Introducing Square Go, the new app to discover, book, and manage your local self-care experiences. Creative Studio collaborated with the amazing folks from the Square Go team to help launch their new booking platform. Shoutout to everyone involved!"
},
{
    "time": "2023-08-03T01:43:44.000Z",
    "tweet_text": "Let's give corporate and state authorities the ability to regulate access to our most vital systems via immutable biometrics. Biometrics from where? A crypto scheme with a history of preying on the global poor, self-dealing — all clothed in technobabble. Fascinating!"
},
{
    "time": "2023-08-02T15:28:43.000Z",
    "tweet_text": "This is crazy. Fix the money. "
},
{
    "time": "2023-08-02T18:38:32.000Z",
    "tweet_text": "Africa will lead Bitcoin adoption.",
    "repost_text": "An Open Letter To The Nigerian Government: Pursue A #Bitcoin Standard.\n\n\"A delay in pursuing a national plan for bitcoin adoption will risk a scenario where Nigeria is left behind.\"\n\nWritten by @RussellOkung.\n\nhttps://bitcoinmagazine.com/culture/bitcoin-letter-to-nigeria-government…"
},
{
    "time": "2023-08-02T16:28:58.000Z",
    "tweet_text": "Speed is a feature.\n\nWe rewrote Replit's IDE filetree to make it 20x faster & enhance accessibility.\n\nYou can expand a directory with 500 files in 16ms.\n\nPeople think browser software has to be slower, but we're starting to beat local editors on speed.\n\nhttps://blog.replit.com/filetree-updates…"
},
{
    "time": "2023-08-02T05:35:29.000Z",
    "tweet_text": "join us in Tokyo or Hong Kong https://nostr.world"
},
{
    "time": "2023-08-01T11:40:57.000Z",
    "tweet_text": " 6 years ago today, #Bitcoin users proved, once and for all, that miners *do not* control the protocol. \n\nToday we celebrate #Bitcoin's decentralization \n\nToday we celebrate #Bitcoin Independence Day "
},
{
    "time": "2023-08-01T18:21:36.000Z",
    "tweet_text": "Just had a nice message from a Vegan. “I love your work. I just want to add that you might appeal to Vegans by mentioning that animals need not ever be killed and eaten, just allowed to breed naturally growing their population to further heal the Earth.”\n\nUnfortunately, Nature is…"
},
{
    "time": "2023-08-01T00:38:55.000Z",
    "tweet_text": "Your tweeting me like tweety bird on ya iPhone....... X X X O \n\n..... Timeless"
},
{
    "time": "2023-07-31T17:49:21.000Z",
    "tweet_text": "Thriller, performed only vocally, without instrumental accompaniment.\nSo good!\nhttps://twitter.com/DimeFred2/status/1685455433350139904/video/1…"
},
{
    "time": "2023-07-30T20:01:56.000Z",
    "tweet_text": "1 out of every 3 light bulbs in France is powered with uranium from Niger Republic.\n\nHowever in Niger Republic, 82% of the population do not have access to electricity."
},
{
    "time": "2023-07-30T22:37:00.000Z",
    "tweet_text": "Describing the present can be Prescribing the future . So Watch what u say . Think of it as an experiment.  \nWe gone learn . \n\nI Am : is a command"
},
{
    "time": "2023-07-30T03:00:01.000Z",
    "tweet_text": "David Bowie in New York, 1983. Photo by Art Zelin."
},
{
    "time": "2023-07-29T16:03:12.000Z",
    "tweet_text": "red blood cell on the tip of a needle"
},
{
    "time": "2023-07-30T05:14:11.000Z",
    "tweet_text": "why not?"
},
{
    "time": "2023-07-29T16:31:04.000Z",
    "tweet_text": "get in your car, drive to your apartment, read some of the book your friend recommended, scroll Instagram before bed"
},
{
    "time": "2023-07-29T23:27:13.000Z",
    "tweet_text": "biologic"
},
{
    "time": "2023-07-29T18:23:47.000Z",
    "tweet_text": "hiding the chrome and navigation on scroll is great. higher density"
},
{
    "time": "2023-07-28T17:18:44.000Z",
    "tweet_text": "CIA planning docs show when they overthrew the Guatemalan president in 1954, they plotted planting \"flying saucer\" stories to distract the media. \n\nAnother declassified study shows the Air Force misled the public in the 1950s about UFOs to conceal the CIA's spy plane testing."
},
{
    "time": "2023-07-28T16:50:32.000Z",
    "tweet_text": "Sinéad O'Connor presents Nina Simone with a lifetime achievement award in 1999 at Dublin's @hotpress Music Hall of Fame.\n\nMay Sinéad rest in eternal peace.\n\n    "
},
{
    "time": "2023-07-27T11:45:00.000Z",
    "tweet_text": "Kurt Cobain Photo by Kevin Mazur."
},
{
    "time": "2023-07-27T12:13:19.000Z",
    "tweet_text": "Sinead O'Connor covering Nirvana's \"All Apologies\""
},
{
    "time": "2023-07-27T20:46:16.000Z",
    "tweet_text": "In tribute to the late Sinead O’Connor, we remember her collaboration w/ Queen Latifah on the Queen Latifah Show circa ‘00, performing “Princess of the Posse.” A memorable moment where 2 legends from different genres came 2gether, leaving a lasting impact. RIP, Sinead O’Connor."
},
{
    "time": "2023-07-27T21:47:35.000Z",
    "tweet_text": "super excited to join the board of http://block.xyz. i love everything they're doing "
},
{
    "time": "2023-07-27T18:02:18.000Z",
    "tweet_text": "“Whatever it may bring, I will live by my own policies, I will sleep with a clear conscience, I will sleep in peace.”\n\nSinéad O'Connor. "
},
{
    "time": "2023-07-27T07:13:25.000Z",
    "tweet_text": "DND: a lifestyle"
},
{
    "time": "2023-07-26T23:04:34.000Z",
    "tweet_text": "The world really did a number on Sinead O’Oconnor. RIP Angel."
},
{
    "time": "2023-07-27T00:04:29.000Z",
    "tweet_text": "Salute ."
},
{
    "time": "2023-07-27T00:16:23.000Z",
    "tweet_text": "Her music was such a major part of my teen life. An incredible voice in every way. Rest now, Sinéad O'Connor. Thank you  #SineadOConnor",
    "repost_text": "Rest in peace, Sinéad O'Connor"
},
{
    "time": "2023-07-27T00:09:14.000Z",
    "tweet_text": "for all  us street kids, for all us wildlings, when sinead got huge, it felt like one of us made it. It was incredible. im not trying to compare myself or anyone else to sinead, she is one of a kind, but thats what it felt like to me. like she was one of us. she was like billie…"
},
{
    "time": "2023-07-26T19:11:34.000Z",
    "tweet_text": "If you think the imminent massive increase in the Space Force budget will be used to deal w these alleged UFOs and not to build a satellite surveillance grid to power the digital ID/cbdc technocracy to control everybody, you might be really gullible"
},
{
    "time": "2023-07-26T23:46:39.000Z",
    "tweet_text": "",
    "repost_text": "day 3 of @worldcoin launch, crazy lines around the world. one person getting verified every 8 seconds now."
},
{
    "time": "2023-07-25T21:09:44.000Z",
    "tweet_text": "Sumn different….. "
},
{
    "time": "2023-07-26T19:15:15.000Z",
    "tweet_text": "the narcissism and hubris of the geriatric governing class is disgusting and insulting on so many levels."
},
{
    "time": "2023-07-26T20:38:27.000Z",
    "tweet_text": "Sinead was a force of nature. A brilliant songwriter & performer whose talent we will not see the like of again. Such passion, such intense presence & a beautiful soul, who battled her own personal demons courageously. Be at peace dear Sinead, you will forever be in our hearts. t"
},
{
    "time": "2023-07-26T18:42:55.000Z",
    "tweet_text": "Respect to Sinead….. She stood for something… Unlike most people…. Rest Easy..",
    "repost_text": "Damn Sinéad "
},
{
    "time": "2023-07-26T18:32:13.000Z",
    "tweet_text": "",
    "repost_text": "Protecting open source is vital for the future of AI and keeping its foundations open!\nhttps://theverge.com/2023/7/26/23807218/github-ai-open-source-creative-commons-hugging-face-eu-regulations…"
},
{
    "time": "2023-07-26T18:03:31.000Z",
    "tweet_text": "https://twitter.com/i/spaces/1YqJDoqZMoLGV…"
},
{
    "time": "2023-07-26T00:20:41.000Z",
    "tweet_text": "\"The photograph of Kurt Cobain in tears has been extensively published. Tilton watched Cobain smash his guitar through an amplifier and walk offstage. He followed him backstage. The pent-up emotion 'just had to go somewhere,' says Tilton, and Cobain burst into tears. 'What I…"
},
{
    "time": "2023-07-25T21:55:53.000Z",
    "tweet_text": "SimpleX Chat: New Frontiers – 7/27 at 17:00 UTC\nJoin us online on Thursday at 10am PT/1pm ET/6pm UK at https://stream.simplex.chat.\nWe will:\n- demo the new desktop app.\n- show how to set up SimpleX servers with dual address (public+onion).\n- share the plan for SimpleX group and…"
},
{
    "time": "2023-07-25T12:40:07.000Z",
    "tweet_text": "Looking forward to joining this Twitter Space tomorrow with leaders of the #Bitcoin community!\n\n@MartyBent @natbrunell @scottmelker @1MarkMoss @Breedlove22\nhttps://twitter.com/i/spaces/1YqJDoqZMoLGV…"
},
{
    "time": "2023-05-08T20:33:45.000Z",
    "tweet_text": "Wechat map tells users whether they are within a 500-meter radius of someone, whose social credit scores are so low that they are being blacklisted.\n\nThis alerts who you may want to 'stay away' from, lest your social credit score goes down!\n\nSociety becomes a virtual prison!!"
},
{
    "time": "2023-07-23T16:19:24.000Z",
    "tweet_text": "Peak iPhone design"
},
{
    "time": "2023-07-24T22:48:34.000Z",
    "tweet_text": "",
    "repost_text": "FREE AS A BIRD.\nFree as a bird\nIt's the next best thing to be\nFree as a bird\n\nhttps://youtube.com/watch?v=ODIvONHPqpk…"
},
{
    "time": "2023-07-24T18:15:50.000Z",
    "tweet_text": "Seen at IETF… Every Bitcoin conference should have this!"
},
{
    "time": "2023-07-24T16:50:29.000Z",
    "tweet_text": "CBDCs are here\n\nAnd while people in democracies might be able to close their eyes and imagine a world where these new tools maybe just maybe protect privacy and financial freedom\n\nThat’s an impossible dream for our 5.8 billion friends living under authoritarian regimes\n\nOpt out",
    "repost_text": "JUST IN - Putin signed a law on introducing a central bank digital ruble and creating an appropriate electronic platform — TASS"
},
{
    "time": "2023-07-23T16:01:38.000Z",
    "tweet_text": "Steve Jobs was asked in 2008 if BlackBerry should worry about the iPhone:"
},
{
    "time": "2023-07-24T07:51:23.000Z",
    "tweet_text": "",
    "repost_text": "We liked using a circles to construct our drawings, it felt like the bird should have an underlying neutrality and simplicity about it"
},
{
    "time": "2023-07-22T20:26:29.000Z",
    "tweet_text": "This is the day america underwent a coup, and ever since, every administration has refused to release the documents detailing what really happened and the true scale of CIA involvement. \n\nNow lets speculate for a moment. What do you think happens if those documents are released…"
},
{
    "time": "2023-07-24T07:30:53.000Z",
    "tweet_text": "visit the Orb or the Orb will visit you...",
    "repost_text": "The Worldcoin project is now live."
},
{
    "time": "2023-07-24T07:28:31.000Z",
    "tweet_text": "\"Worldcoin is an attempt at global scale alignment...\"\n\ncute",
    "repost_text": "The Worldcoin project is now live."
},
{
    "time": "2023-07-24T02:47:29.000Z",
    "tweet_text": "A critic tried to tell Steve Jobs how he should build his product\n\nSteve’s response:"
},
{
    "time": "2023-07-24T06:40:11.000Z",
    "tweet_text": "why doesn't gmail have a dark mode?"
},
{
    "time": "2023-07-24T04:30:18.000Z",
    "tweet_text": "Wit and humor."
},
{
    "time": "2023-07-24T04:33:47.000Z",
    "tweet_text": "at no time should a corporation or state own any part of the global financial system",
    "repost_text": "It's time. 24.7.23"
},
{
    "time": "2023-07-24T04:05:43.000Z",
    "tweet_text": "keep calm and just x through it"
},
{
    "time": "2023-07-24T03:57:43.000Z",
    "tweet_text": "",
    "repost_text": "Unofficial tagline for each candidate\n\nBiden: “If we bury our heads in the sand, the problems will just go away, man.”\n\nTrump: “Drain the swamp! (except big pharma; I love big pharma and insist operation warp speed was a success).”\n\nVivek: “Here are some gimmicky policies that…"
},
{
    "time": "2023-07-24T03:51:41.000Z",
    "tweet_text": "tick tock, next block",
    "repost_text": "#Bitcoin block 800,000."
},
{
    "time": "2023-07-23T13:44:47.000Z",
    "tweet_text": "Long shot candidate — or frontrunner? A new Harvard-Harris poll puts my favorability rating at 47% — higher than Trump (45%), Desantis (40%), Biden (39%), and every public figure in the poll. #Kennedy24\n\nPoll: https://harvardharrispoll.com/wp-content/uploads/2023/07/HHP_July2023_KeyResults.pdf…"
},
{
    "time": "2023-07-23T00:07:14.000Z",
    "tweet_text": "great update. no phone number or email needed to use. highly recommended.",
    "repost_text": "SimpleX Chat – #private and #secure #opensource messenger without user IDs of any kind (not even random numbers) – v5.2 with message delivery receipts  and more stable message delivery is now released in App Store and Play Store!\n\nRead more in this post: https://simplex.chat/blog/20230722-simplex-chat-v5-2-message-delivery-receipts.html…"
},
{
    "time": "2023-07-22T11:00:55.000Z",
    "tweet_text": "The migration to @SimpleXChat is starting!\n\nSeems the @BitcoinReviewHQ listeners are leading the charge."
},
{
    "time": "2023-07-22T02:12:44.000Z",
    "tweet_text": "LIONEL ANDRÉS MESSI IS NOT HUMAN."
},
{
    "time": "2023-07-21T20:22:01.000Z",
    "tweet_text": "It's the coolest looking card I have."
},
{
    "time": "2023-07-21T20:15:26.000Z",
    "tweet_text": "Temperature check: The new Mood Cash App Cards are out in the wild, and we want to see yours.\n\nDebit cards issued by Sutton Bank pursuant to a license from Visa U.S.A., Inc."
},
{
    "time": "2023-07-21T19:39:18.000Z",
    "tweet_text": "smart",
    "repost_text": "Everyone in NYC should know about @CashApp’s MTA boost coupon\n\n$1 off any MTA transaction, eligible every 6hrs\n\nWith the new $2.90 rate, that’s nearly $60 in savings EVERY MONTH if you keep applying the coupon + travel at least 2 ways every day\n\nUse it, everyone. Use it  x.com/nytimes/status…"
},
{
    "time": "2023-07-21T12:05:14.000Z",
    "tweet_text": ".@Newsweek writer Paul Bond is the first MSM journalist I’ve spoken to in a decade who asked me for the scientific citations that supported my arguments, read the journal papers, and then wrote an honest and fair article. I commend him. #Kennedy24"
},
{
    "time": "2023-07-20T22:54:54.000Z",
    "tweet_text": "BITCOIN."
},
{
    "time": "2023-07-20T19:09:58.000Z",
    "tweet_text": " We are @FreedomofPress, a nonprofit organization that protects, defends, and empowers public-interest journalism.\n\nWe build @SecureDrop, run @USPressTracker, train journalists in digital security, and advocate for press freedom.\n\nHere are some ways you can support our work "
},
{
    "time": "2023-07-20T17:43:54.000Z",
    "tweet_text": "I'm so excited to be able to spend my time on these two projects, improving Lightning little by little. Thanks so much @spiral. ",
    "repost_text": "New grantee. Alyssa Hertig (@mehmehturtle) is doing LNDK work to add BOLT 12 support for LND and @eyeofsatoshi projects. She’s also a writer covering bitcoin tech and the flute orchestra that plays from the treetops every night behind our office.\n\nGitHub:\nhttps://github.com/orbitalturtle"
},
{
    "time": "2023-07-20T18:20:05.000Z",
    "tweet_text": "An enormous thank you to #startsmall and @jack for supporting @FreedomofPress with an incredible $1M grant to help launch the Daniel Ellsberg Chair on Government Secrecy"
},
{
    "time": "2023-07-19T13:12:19.000Z",
    "tweet_text": "lol to everyone gushing over meta’s llama 2 release, I invite you to actually try it. It’s the most sensitive language model I’ve ever interacted with and if this is the future of models I don’t really want it."
},
{
    "time": "2023-07-19T23:01:03.000Z",
    "tweet_text": "Truly tragic what has happened to Spiral grantee @chris_belcher_. Give the following a read to appreciate what he's gone through the past year. If anyone has any ideas about whom to connect him with or how to help, please reach out to him."
},
{
    "time": "2023-07-20T00:07:27.000Z",
    "tweet_text": "We are heartbroken."
},
{
    "time": "2023-07-19T15:04:09.000Z",
    "tweet_text": "Lekker Feeling is now live on YouTube!\n\nThis short film is about hope and I am so incredibly proud of it.\n\nWe are looking to raise 1 BTC for @BitcoinEkasi to support the renovation of its facilities in Mossel Bay, South Africa. \n\nInstructions on how to donate directly are…"
},
{
    "time": "2023-07-18T21:05:40.000Z",
    "tweet_text": "Confirmed.\n\n70B LLaMA 2 easily training on a single GPU with 48GB\n\nGreen light on 70B 4-bit QLoRA & A6000.\n\nGo wild."
},
{
    "time": "2023-07-19T05:43:04.000Z",
    "tweet_text": "",
    "repost_text": "This newly built Las Vegas sphere cost $2.3 billion and uses 150 terawatt-hours of electricity per year to power the massive screen.\n\nThat's almost double the yearly power consumption of Bitcoin.\n\nWait until the climate people see this..."
},
{
    "time": "2023-07-18T20:30:00.000Z",
    "tweet_text": "How did it happen so fast?"
},
{
    "time": "2023-07-18T18:04:28.000Z",
    "tweet_text": "Today at Meta we’re releasing Llama 2, the next generation of our open source LLM available for research and commercial use.\nhttps://ai.meta.com/llama/\n\nI am proud to have led the safety effort behind Llama 2. The dedication of the team was key to making our model safer. \n1/n"
},
{
    "time": "2023-07-19T04:01:43.000Z",
    "tweet_text": "https://habla.news is great. truly free."
},
{
    "time": "2023-07-19T03:59:33.000Z",
    "tweet_text": "a great move. grateful",
    "repost_text": "Llama 2 by @Meta is already integrated with @huggingface transformers, TGI, inference endpoints, PEFT and much more. Time for builders to build! https://huggingface.co/blog/llama2#inference…"
},
{
    "time": "2023-07-19T02:44:57.000Z",
    "tweet_text": "₿𝗥𝗘𝗔𝗞𝗜𝗡𝗚: Presidential candidate @RobertKennedyJr announces plan to back the dollar with bitcoin."
},
{
    "time": "2023-07-18T20:10:41.000Z",
    "tweet_text": "Just a reminder that there is plenty of funding available for you to work full time on #Bitcoin and #nostr FOSS projects.\n\nApply for a grant on @OpenSats, no excuses.\n\nPs: if you already have started to code it, it's easier to get the application through."
},
{
    "time": "2023-07-18T16:13:02.000Z",
    "tweet_text": "This is huge: Llama-v2 is open source, with a license that authorizes commercial use!\n\nThis is going to change the landscape of the LLM market.\nLlama-v2 is available on Microsoft Azure and will be available on AWS, Hugging Face and other providers\n\nPretrained and fine-tuned…"
},
{
    "time": "2023-07-18T02:52:06.000Z",
    "tweet_text": "Shameless plug of my daughter's new drop."
},
{
    "time": "2023-07-17T22:18:10.000Z",
    "tweet_text": "SimpleX Chat – #private and #secure #opensource messenger – v5.2-beta.2 with delivery receipts, favorite chats, and more is available via the links here:"
},
{
    "time": "2023-07-17T19:40:02.000Z",
    "tweet_text": "Still can't believe I co-wrote a song with David Bowie ",
    "repost_text": "Pug nose face, hilarious! #BowieForever #DavidBowie"
},
{
    "time": "2023-07-17T17:19:02.000Z",
    "tweet_text": "Did you know that #WhatsApp shares its metadata with #Meta? While your messages are encrypted and secure, #Meta knows your location, who you’re communicating with, at what time, how often, and from which device.\n\nWe recommend using @Signalapp or another #privacy-first alternative…"
},
{
    "time": "2023-07-17T14:06:38.000Z",
    "tweet_text": "Numbers of public models on @huggingface:\n- @Meta: 689 including MusicGen, Galactica, Wav2Vec, RoBERTa,... - https://huggingface.co/facebook\n- @Google: 591 including BERT, Flan, T5, mobilnet,...  - https://huggingface.co/google\n- @Microsoft : 252 including DialoGPT, BioGPT, layoutLM, uniML,…"
},
{
    "time": "2023-07-16T01:24:18.000Z",
    "tweet_text": "Too soon b"
},
{
    "time": "2023-07-15T15:46:38.000Z",
    "tweet_text": "\"The computer can be used as a tool to liberate and protect people, rather than to control them,\" - Hal Finney\n\nWe are proud to announce grants for over a dozen open source projects in the bitcoin ecosystem.\n\nFreedom Tech is Hope \nhttps://opensats.org/blog/bitcoin-grants-july-2023…"
},
{
    "time": "2023-07-14T02:30:55.000Z",
    "tweet_text": "SimpleX is worth checking out\n\nhttps://simplex.chat"
},
{
    "time": "2023-07-13T19:23:50.000Z",
    "tweet_text": "Surprise! Today we launched our Creator Ads Revenue Sharing program.\n\nWe’re expanding our creator monetization offering to include ads revenue sharing for creators. This means that creators can get a share in ad revenue, starting in the replies to their posts. This is part of our…"
},
{
    "time": "2023-07-12T16:06:50.000Z",
    "tweet_text": " Watch now: #nostrdocumentary \n\nSee how NOSTR has the power to fix our broken social media landscape.\nLink below "
},
{
    "time": "2023-07-10T19:41:56.000Z",
    "tweet_text": "Data not collected. Which iOS apps do you use that collect no data?"
},
{
    "time": "2023-07-10T15:23:43.000Z",
    "tweet_text": "Urban African-American communities have become food deserts where you cannot find healthy food. It’s time to bring wholesome food and agriculture to these communities, which is what Vel Scott has done at her beautiful farm in Cleveland."
},
{
    "time": "2023-07-10T01:34:46.000Z",
    "tweet_text": "Progress until the bitcoin halving:\n▓▓▓▓▓▓▓▓▓▓▓▓▓░░ 80% \n       41,959 blocks ~292 days"
},
{
    "time": "2023-07-10T03:08:50.000Z",
    "tweet_text": "All orders shipped today "
},
{
    "time": "2023-07-08T20:31:09.000Z",
    "tweet_text": "Imagine your government built upon open protocols that they can’t own, control, or manipulate…every interaction visible to all. What changes?"
},
{
    "time": "2023-07-08T12:36:35.000Z",
    "tweet_text": "If you’ve ever bought the Apollo #Reddit app, read the linked post from @gruber.\n\nIn a nutshell, @ChristianSelig is on the hook to pay out hundreds of thousands  because Reddit pulled out the rug. Help him out. Click the “I don’t need a refund” button."
},
{
    "time": "2023-07-08T18:44:23.000Z",
    "tweet_text": "Love seeing emphasis on frictionless and fast onboarding \n\nNo KYC is more than just privacy. It is also better UX.",
    "repost_text": "21-second onboarding just dropped "
},
{
    "time": "2023-07-08T16:50:05.000Z",
    "tweet_text": "Yes.",
    "repost_text": "GM\n\nThe world needs open source hardware phones with open source firmware and open source software.\n\nThere are few attempts: pinephone, librem5 (purism), ...\nThe two solutions above are really cool for a nerd like myself but have downsides.\nPhone hardware specs are sub-par,… x.com/zerohedge/stat…"
},
{
    "time": "2023-07-07T22:22:24.000Z",
    "tweet_text": "Nostr is a censorship resistant open source communication protocol that is incredibly complementary to bitcoin.\n\nWe are funding sixteen projects in our first round of nostr grants.\n\nMuch more to come. We are just getting started. \nhttps://opensats.org/blog/nostr-grants-july-2023…"
},
{
    "time": "2023-07-07T19:02:20.000Z",
    "tweet_text": "",
    "repost_text": "You will not post about politics or news. That's badspeak. Also being angry is not tolerated (why do they think we're angry?). Basically just talk about things our advertisers want to run ads against, it helps our revenue"
},
{
    "time": "2023-07-07T13:07:06.000Z",
    "tweet_text": "Wow. New release from Lightning Labs is WILD. \n\nA new standard for developers to connect AI to #Bitcoin and Lightning, enabling dynamic pricing for APIs, while allowing the AI to send/hold/receive bitcoin. \n\nFuture is here."
},
{
    "time": "2023-07-06T17:39:52.000Z",
    "tweet_text": "“We wanted flying cars, instead we got 7 Twitter clones.”",
    "repost_text": "Gotta say, it feels like we missed an opportunity to reinvent social. Can you tell them apart?"
},
{
    "time": "2023-07-05T21:29:39.000Z",
    "tweet_text": "Where can you spend Bitcoin in Costa Rica?\n\nIt's amazing what a few dedicated individuals can achieve with no investors, no token, no government support, no sponsors, no fees, using open-source software.\n\nPowered by Pure Love of Bitcoin and love of Humanity\n\n @BitcoinJungleCR"
},
{
    "time": "2023-07-04T22:56:57.000Z",
    "tweet_text": "",
    "repost_text": "Simplex and Nostr fixes this. x.com/shellenberger/…"
},
{
    "time": "2023-07-04T17:34:10.000Z",
    "tweet_text": "Everyone should understand how dangerous the situation is\n\nPeople tied to the national security state are trying to create a \"back door\" to read your private text messages.\n\nThis would set a precedent and put global surveillance & repression on steroids.\n\nPlease watch & share",
    "repost_text": "\"In the history of human communication, for hundreds of thousands of years, the default was private....\n\"What we are talking about here is the UK is poised to set a damning precedent if we break encryption, if this mass surveillance provision goes forward.\n\"I want to protect…"
},
{
    "time": "2023-07-04T21:58:55.000Z",
    "tweet_text": "They’ve nailed the narrowcasting use case. But it can be taken away. Lots of opportunity here.",
    "repost_text": "In Costa Rica, facebook is still very much a town square. It's the People's Tribunal: disputes, crimes and all sorts of drama are exposed and resolved. Most little towns have multiple dedicated facebook groups. Business happens over facebook too."
},
{
    "time": "2023-07-04T19:14:35.000Z",
    "tweet_text": "SimpleX TestFlight is really good (censorship resistant messaging, no phone number or email needed)"
},
{
    "time": "2023-07-04T00:57:19.000Z",
    "tweet_text": "Great",
    "repost_text": "Calling all developers, builders, and pioneers: The first ever #Ai4All hackathon starts today!\n\nTry your hands at building projects that democratise AI with #Bitcoin as you learn, collaborate, and compete for amazing prizes and bounties.\n\nRegister today!\nhttps://bolt.fun/tournaments/ai4all/overview…"
},
{
    "time": "2023-07-04T00:01:14.000Z",
    "tweet_text": "All your Threads are belong to us https://apps.apple.com/us/app/threads-an-instagram-app/id6446901002…"
},
{
    "time": "2023-07-03T22:02:24.000Z",
    "tweet_text": "Listen to our conversation as @CherylHines gives her thoughts on husband @RobertKennedyJr presidential bid for the FIRST TIME! Our full interview is streaming on Rumble on July 4th at 9am PT | 12pm ET - don't miss it!"
},
{
    "time": "2023-07-03T07:56:39.000Z",
    "tweet_text": "TODAY is Julian’s 52nd birthday.\n\n#FreeAssangeNOW"
},
{
    "time": "2023-07-03T13:59:17.000Z",
    "tweet_text": " You can now buy an Azteco bitcoin anywhere in the world from G2A. It takes less than a minute to redeem your voucher and there’s no need to create an account.\n\nPlus, if you buy a $10 Azteco bitcoin voucher on G2A during July, you’ll receive a guaranteed bonus: either an…"
},
{
    "time": "2023-07-02T19:28:07.000Z",
    "tweet_text": "It’s not about conspiracy – it is about transparency. In a midnight Friday night announcement the White House has delivered the bad news that President Biden will be maintaining secrecy indefinitely on some JFK assassination related records."
},
{
    "time": "2023-07-02T14:52:11.000Z",
    "tweet_text": ""
},
{
    "time": "2023-07-02T00:03:51.000Z",
    "tweet_text": "Love @MIAuniverse",
    "repost_text": "We are over the moon to announce our second narrator for THE TRUST FALL! Mathangi Arulpragasam A.K.A. \"M.I.A.\" is a British rapper and singer. She has long supported #Assange and been outspoken in her defence of him and his work. She composed the theme to Assange's television…"
},
{
    "time": "2023-07-01T23:08:16.000Z",
    "tweet_text": "Running Twitter is hard. I don’t wish that stress upon anyone. I trust that the team is doing their best under the constraints they have, which are immense. It’s easy to critique the decisions from afar…which I’m guilty of…but I know the goal is to see Twitter thrive. It will."
},
{
    "time": "2023-07-01T23:08:17.000Z",
    "tweet_text": "And I do hope they consider building on truly censorship-resistant open protocols like bitcoin and nostr to help ease that burden. Good for all, and critical to preserve the open internet."
},
{
    "time": "2023-07-01T22:16:39.000Z",
    "tweet_text": "Read every tweet like it could be your last."
},
{
    "time": "2023-07-01T19:38:35.000Z",
    "tweet_text": "Twouble",
    "repost_text": "JUST IN - Twitch is having problems now too."
},
{
    "time": "2023-07-01T16:13:10.000Z",
    "tweet_text": "Americans no longer trust their government, and they no longer trust the press. As President, I promise that the government will start telling the truth again. #Kennedy24"
},
{
    "time": "2023-07-01T02:36:35.000Z",
    "tweet_text": "https://reports.exodus-privacy.eu.org/en/"
},
{
    "time": "2023-06-30T20:03:00.000Z",
    "tweet_text": "21 Free Speech and Human Rights groups including Amnesty, ACLU, RSF, ACLU, CPJ, HRW, PEN urge Biden Admin to \"protect democratic values and human rights norms, including freedom of the press, by abandoning this relentless pursuit of Julian Assange\" https://cpj.org/2022/12/cpj-partners-send-letter-calling-for-us-to-drop-charges-against-julian-assange/…"
},
{
    "time": "2023-06-29T12:28:03.000Z",
    "tweet_text": "Scientists, on the basis of early testing, were saying aspartame was a carcinogen in the late 1970s and early 1980s, but Donald Rumsfeld, who was CEO of the company that owned Aspartame, became part of the Reagan transition team and got to appoint the new head of the FDA, who…",
    "repost_text": "Exclusive: Aspartame, one of the world's most common artificial sweeteners, is set to be declared a possible carcinogen next month by a leading global health body, pitting it against the food industry and regulators https://reut.rs/3XzfgWX"
},
{
    "time": "2023-06-29T23:22:31.000Z",
    "tweet_text": "Great interview"
},
{
    "time": "2023-06-29T16:28:43.000Z",
    "tweet_text": "Introducing the Bitcoin Script Project, an idea.\n\nBitcoin is missing a cohesive technological narrative.\n\nOver last couple of years, Lightning shifted most of the attention towards secondary layers, leaving little exposure to the innovation & progress made around Bitcoin script."
},
{
    "time": "2023-06-29T03:59:59.000Z",
    "tweet_text": " Robert F. Kennedy Jr Debates a Family Physician on Vaccine Safety During the NewsNation Town Hall"
},
{
    "time": "2023-06-29T02:25:21.000Z",
    "tweet_text": "He couldn’t have answered this question in a more beautiful way"
},
{
    "time": "2023-06-28T19:39:12.000Z",
    "tweet_text": "New documents show that the CIA’s MKULTRA program targeted indigenous and Black children in medical torture “experiments.” Horrific."
},
{
    "time": "2023-06-28T20:15:50.000Z",
    "tweet_text": "TX"
},
{
    "time": "2023-06-28T13:31:10.000Z",
    "tweet_text": "In Brazil, thousands of politicians, scholars, journalists, researchers, ex-ministers, and activists -- many on the left but not all - sign a letter urging President Lula da Silva, a vocal defender of Julian Assange, to grant asylum to Assange in Brazil."
},
{
    "time": "2023-06-28T16:00:03.000Z",
    "tweet_text": "New previously omitted evidence of #CIA involvement emerges in ongoing Spanish case of illegal spying on Julian Assange and his lawyers | El Pais"
},
{
    "time": "2023-06-26T15:26:03.000Z",
    "tweet_text": "Nikola Tesla's prediction of a smartphone, Collier’s magazine interview, 1926:\n\n\"When wireless is perfectly applied the whole earth will be converted into a huge brain, which in fact it is, all things being particles of a real and rhythmic whole. We shall be able to communicate…"
},
{
    "time": "2023-06-28T09:12:44.000Z",
    "tweet_text": "all the longevity experts are ~52 years old"
},
{
    "time": "2023-06-27T23:59:18.000Z",
    "tweet_text": "Yes.",
    "repost_text": ".@YouTube just pulled another of my videos, with former NY Post political reporter @al_guart. People made a big deal about Russia supposedly manipulating internet information to influence a Presidential election. Shouldn’t we be worried when giant tech corporations do the same?"
},
{
    "time": "2023-06-27T21:55:01.000Z",
    "tweet_text": "As president, I will make sure that your right to use and hold Bitcoin is inviolable. Bitcoin is not only a bulwark against totalitarianism and the manipulation of our money supply, it points the way toward a future in which government institutions are more transparent and more…"
},
{
    "time": "2023-06-27T10:34:37.000Z",
    "tweet_text": "Removed from the App Store for enabling tipping to everyone in the world without the need for a bank, payment card, or government permission."
},
{
    "time": "2023-06-27T10:09:57.000Z",
    "tweet_text": "Why doesn’t Apple Pay support bitcoin @tim_cook?",
    "repost_text": "Their suggested fix is to use apple pay. Sure, I'll use apple pay when it supports censorship resistant, peer-to-peer payments to anyone in the world. Maybe start with peer-to-peer first?"
},
{
    "time": "2023-06-26T16:15:53.000Z",
    "tweet_text": "Tips aren’t unlocking content, @Apple",
    "repost_text": "Looks like we are getting removed from the appstore even after updating our app to make it clear that no digital content is getting unlocked when users are tipped. Users are only ever tipped after posts are made, the idea that content is being sold is nonsense. We will be filing…"
},
{
    "time": "2023-06-22T17:34:37.000Z",
    "tweet_text": "https://nodeless.io"
},
{
    "time": "2023-06-20T21:31:59.000Z",
    "tweet_text": "International remittances still cost an average of over 6% in fees today, which is remarkably high.\nhttps://remittanceprices.worldbank.org\n\nThe international financial system is rather siloed, piecemeal, and has been slow to innovate."
},
{
    "time": "2023-06-21T03:35:50.000Z",
    "tweet_text": "Essential reading.\n\n@VPrasadMDMPH on what @RobertKennedyJr   gets right—and what he gets wrong—on vaccines, regulatory capture, and more."
},
{
    "time": "2023-06-19T21:08:19.000Z",
    "tweet_text": "Played a small clip of @RobertKennedyJr to comment on for my YouTube video today, and now MY ENTIRE CHANNEL HAS BEEN DEMONETIZED!!!\n \nBut...... maybe I should now go to @rumblevideo and/or Twitter and do a full interview with RFK now?"
},
{
    "time": "2023-06-20T18:54:47.000Z",
    "tweet_text": "Clip from my talk at @OsloFF on @Wikileaks\n#FreeAssange"
},
{
    "time": "2023-06-20T15:22:52.000Z",
    "tweet_text": "https://youtube.com/watch?v=mZ2Ze59QjLA…"
},
{
    "time": "2023-06-20T15:13:04.000Z",
    "tweet_text": "Grateful for Brink and their support of bitcoin core development.",
    "repost_text": "Honored to receive a very generous $5,000,000 pledge to our developer funding efforts from @jack and #startsmall\n\nBrink will receive $1,000,000 per year for the next 5 years.\n\nThank you for supporting #bitcoin developers!"
},
{
    "time": "2023-06-18T13:54:01.000Z",
    "tweet_text": "This is a really interesting story that I had to keep secret for 10 years, now told by @guardian: how a then-27-year-old Google employee, William Fitzgerald, played a key role in helping @Snowden get to safety in Hong Kong. He decided to reveal his role:"
},
{
    "time": "2023-06-17T03:46:01.000Z",
    "tweet_text": "The right tab bar config \n\nDid you know that as verified user you can change what to show in your tab bar?"
},
{
    "time": "2023-06-16T20:03:07.000Z",
    "tweet_text": "Here's a photo I took of the first time @DanielEllsberg spoke with Edward @Snowden in Sept. 2013 — on a burner laptop, using Tails and encrypted IM! He typed for three or four hours, and would've kept going if he could've"
},
{
    "time": "2023-06-16T20:25:10.000Z",
    "tweet_text": "This is great ",
    "repost_text": "Yesterday, I shared my @Forbes article on #Nostr.\n\nI received #zaps from 47 people & earned a total of 65,100 sats. That's $17. \n\nOh, and I get to keep 100% of it.\n\nCan't do that on Twitter, Instagram, Snapchat, TikTok, Patreon, or even OnlyFans.\n\nhttps://forbes.com/sites/briannahonkawadestries/2023/06/15/how-to-earn-bitcoin-and-join-the-creator-economy-with-nostr/?sh=6514b3481fec…"
},
{
    "time": "2023-06-16T20:28:44.000Z",
    "tweet_text": "Bitcoin + nostr = 0 gatekeepers"
},
{
    "time": "2023-06-16T12:28:53.000Z",
    "tweet_text": "One hour in and I can’t believe my ears. How have we been so blind to the government/pharmaceutical industry? \n\nIf you only listen to one,  make it this one. @RobertKennedyJr @joerogan"
},
{
    "time": "2023-06-16T18:24:34.000Z",
    "tweet_text": "Have now listened to entire Rogan/RFK interview. Didn't agree w/everything. But his ending message of creating a populist message that links right and left, based on old middle class, is compelling. Also - he spoke fluidly, w/out notes, w/out talking points for 3 hrs..."
},
{
    "time": "2023-06-16T18:45:24.000Z",
    "tweet_text": "Rest in peace @DanielEllsberg, a generous spirit who will continue to inspire so many of us."
},
{
    "time": "2023-06-16T18:36:47.000Z",
    "tweet_text": "My dear father, #DanielEllsberg, died this morning June 16 at 1:24 a.m., four months after his diagnosis with pancreatic cancer. His family surrounded him as he took his last breath. He had no pain and died peacefully at home. https://commondreams.org/opinion/daniel-ellsberg-pentagon-papers…"
},
{
    "time": "2023-06-16T17:33:55.000Z",
    "tweet_text": "The Democratic Party Bosses who promote censorship, who have stripped New Hampshire of its rightful First in the Nation primary status, who have shut down debate, who refuse to campaign in New Hampshire, are in no position to tell me who to talk to. I’m going to speak at Porcfest…"
},
{
    "time": "2023-06-16T13:24:00.000Z",
    "tweet_text": "Bitcoin and nostr are the only two truly censorship resistant technologies at scale. https://x.com/fiatjaf/status/fiatjaf/status/1669673676663578631…"
},
{
    "time": "2023-06-16T05:55:24.000Z",
    "tweet_text": "Nostr Protocol Surpasses 1 Million Zaps Milestone"
},
{
    "time": "2023-06-15T18:03:02.000Z",
    "tweet_text": "I had a great time with @JoeRogan in Austin this week.  The episode is now live. Listen + share and consider making a donation to http://Kennedy24.com if you resonate with our conversation."
},
{
    "time": "2023-06-15T16:59:26.000Z",
    "tweet_text": "When I was fooled by the narrative that there was a ventilator shortage, I kicked into high gear to source ventilators and distribute 3D printing files for key parts.  \nThe New Yorker & others picked up on my efforts.\nPretty quickly I realized there was something scammy afoot.…",
    "repost_text": "Tens of thousands of Americans died after being placed on mechanical ventilators for COVID in spring 2020. It’s long past time we got real answers as to how many were killed this way.\nhttps://michaelpsenger.com/p/the-great-covid-ventilator-death…"
},
{
    "time": "2023-06-15T16:35:14.000Z",
    "tweet_text": "They tried to ignore me and that strategy has failed. Now their coordinated attacks in Time, WaPo, NYT, Guardian, etc. using the same language exposes fear in the ranks of the corporate oligarchy. Luckily, we have outlets like @elonmusk, @joerogan + podcast world, and our network…"
},
{
    "time": "2023-06-15T15:56:27.000Z",
    "tweet_text": "bitkey beta opening globally",
    "repost_text": "Anyone want to help test Bitkey? Beta sign up here\nhttps://bitkey.build/beta/"
},
{
    "time": "2023-06-15T14:45:25.000Z",
    "tweet_text": "If you build your app in rust you can compile to a PWA and a native app, then you can get all the nice native app features but always have the PWA fallback when the app stores try to fuck you.\n\nThis is the plan with @MutinyWallet"
},
{
    "time": "2023-06-15T15:53:36.000Z",
    "tweet_text": "buy bitcoin from an exchange and move it to a hardware key you control",
    "repost_text": "Coinbase is thrilled to have partnered with Bitkey, the self-custody bitcoin wallet made by Block, Inc. to grow self-custody usage. Customers can soon easily transfer new & existing bitcoin with Coinbase to their Bitkey self-custody wallet.\n\nLearn More \nhttps://coinbase.com/blog/announcing-a-global-partnership-with-blocks-bitkey-wallet…"
},
{
    "time": "2023-06-14T20:23:54.000Z",
    "tweet_text": "A new poll shows me ranking higher in favorability than other major 2024 candidates. #Kennedy24"
},
{
    "time": "2023-06-11T08:00:00.000Z",
    "tweet_text": "Editors and publishers of the five media organizations who first partnered with Julian Assange - The Guardian, Le Monde, El País, Der Spiegel and The New York Times - call for his immediate release"
},
{
    "time": "2023-06-13T16:45:47.000Z",
    "tweet_text": "After years of official claims to the contrary, strong new evidence suggests the virus known as SARS-CoV-2 escaped from a Chinese lab. According to multiple sources, the researchers who led gain-of-function research, which increases infectiousness, were the first to be infected."
},
{
    "time": "2023-06-13T11:36:36.000Z",
    "tweet_text": "Poll Sees RFK Jr. Nearly Tie With Biden\n-The Dallas Express\n@Rasmussen_Poll @RobertKennedyJr @POTUS\n#Kennedy24 #AllTheWayWithRFK"
},
{
    "time": "2023-06-13T19:01:07.000Z",
    "tweet_text": "Today marks 52 years since the @nytimes started publishing the #PentagonPapers – the 7,000 page Top Secret study detailing decades of official lies about the Vietnam War.\n\nIt was, of course, given to them by legendary whistleblower @DanielEllsberg."
},
{
    "time": "2023-06-13T18:31:44.000Z",
    "tweet_text": "Happy to see my President @WilliamsRuto taking steps in the right direction towards the #Bitcoin standard.\n+254  tuko site.\n@ProfPLOLumumba always keeping it "
},
{
    "time": "2023-06-13T20:24:27.000Z",
    "tweet_text": "Facts. Apple building on and with bitcoin would benefit their company immensely. \n\nApple has been so great at taking early technologies and protocols and making them easy for everyone. I hope they are considering this one deeply. I imagine they are. https://x.com/ktreywalsh/sta/ktreywalsh/status/1668576891278598144…"
},
{
    "time": "2023-06-13T00:31:53.000Z",
    "tweet_text": "Just In: President of Kenya, @WilliamsRuto, Urges African Nations to Dump the US Dollar for Intracontinental Trade. WATCH"
},
{
    "time": "2023-06-13T20:07:12.000Z",
    "tweet_text": "great marketing for Damus, which i never heard of until today.\n\ni just signed up."
},
{
    "time": "2023-06-13T20:07:41.000Z",
    "tweet_text": "Great conversation, and bitcoin and nostr get a mention",
    "repost_text": "Thanks @esaagar + @krystalball for having me back on your show! #Kennedy24\nhttps://kennedy24.com/rfk_jr_returns_to_breaking_points…"
},
{
    "time": "2023-06-13T20:05:29.000Z",
    "tweet_text": "This is still incorrect @apple. Tipping on posts is not selling digital content. It’s a form of feedback. \n\nWhy limit people sending bitcoin to each other? This is our one opportunity to build a truly global payment protocol for the internet (which would benefit your company…",
    "repost_text": "Damus has to remove the zap button on posts because this is considered “selling digital content”. Only zaps on profiles are allowed. This cripples damus pretty bad, but you can still zap at least "
},
{
    "time": "2023-06-13T17:58:33.000Z",
    "tweet_text": "  Kenyan President\n\nAddressing all African nations - “why should we continue to pay each other in dollars?”\n\nThis will only further US inflation which of course will export its way to the EU & UK."
},
{
    "time": "2023-06-13T17:36:11.000Z",
    "tweet_text": ".@RobertKennedyJr returned to Breaking Points today to discuss whether he would pardon Trump, if Biden is fit for office, economic views, future of big tech, and whether he would declassify UFO docs\n\nWatch:"
},
{
    "time": "2023-06-13T16:42:59.000Z",
    "tweet_text": "!",
    "repost_text": "Apple has contacted us and scheduled a call to discuss the role of zaps in more detail. Will keep y’all posted."
},
{
    "time": "2023-06-13T15:58:42.000Z",
    "tweet_text": "this is great",
    "repost_text": "Progressive Web Apps (PWAs) work in nearly every desktop/mobile browser and can be \"installed\" onto the home screen.\n\nThe best part? Can't be censored by Apple/Google, no download needed.\n\nThis is what it looks like to have a lightning wallet accessible to 5 billion people!"
},
{
    "time": "2023-06-13T15:56:44.000Z",
    "tweet_text": "This seems to be a misunderstanding by @apple of how this feature works and what it's for.\n\nIt's a critical part of the future of the internet. It has the capacity to bring people around the world into the economy without the traditional gatekeepers. Please reconsider @tim_cook.",
    "repost_text": "Damus will be removed from the app store in 14 days, apple says zaps are not allowed on their platform because they *could* be used by content creators to sell digital content. This is right before we’re about to give our talk at the oslo freedom forum on how decentralized social…"
},
{
    "time": "2023-06-13T14:32:20.000Z",
    "tweet_text": "Fix the money, fix the state."
},
{
    "time": "2023-06-11T17:05:45.000Z",
    "tweet_text": "This true?",
    "repost_text": ".@brian_armstrong squirms and gives a non-answer when asked if @Coinbase invests in projects that they later list to trade for retail customers\n\n(they do)"
},
{
    "time": "2023-06-10T15:22:14.000Z",
    "tweet_text": "… but Facebook went one step ahead by encrypting the ID and tracking parameters together, nullifying this feature"
},
{
    "time": "2023-06-10T08:00:11.000Z",
    "tweet_text": "Surface area in the Sahara desert  required to power the world with solar energy (Concentrated solar power plant with 2,500 kWh/m² a year)"
},
{
    "time": "2023-06-08T18:24:00.000Z",
    "tweet_text": "Thorough, brutal, and with receipts. Thanks for everything @ChristianSelig."
},
{
    "time": "2023-06-09T18:00:11.000Z",
    "tweet_text": "\"Eat at a local restaurant tonight. Get the cream sauce. Have a cold pint at 4 o’clock in a mostly empty bar. Go somewhere you’ve never been. Listen to someone you think may have nothing in common with you. Order the steak rare. Eat an oyster. Be open to a world where you may not…"
},
{
    "time": "2023-06-08T20:05:59.000Z",
    "tweet_text": "Absolutely horrible news. Not only is Apollo a great app, Reddit’s management is lying about, slandering and vilifying one of the nicest guys in our indie app world while unceremoniously killing off an app he worked on for many years.",
    "repost_text": "Apollo will close down on June 30th. Reddit’s recent decisions and actions have unfortunately made it impossible for Apollo to continue. Thank you so, so much for all the support over the years.  https://reddit.com/r/apolloapp/comments/144f6xm/apollo_will_close_down_on_june_30th_reddits/…"
},
{
    "time": "2023-06-05T22:59:11.000Z",
    "tweet_text": "This developer used to charge $50 per project.\n\nToday, he makes 100x that by building AI apps for clients who are listed on NASDAQ.\n\nAnd he’s done it all from his dorm room in Nairobi, Kenya.\n\nHis story is a glimpse into the future of software creators in an AI world "
},
{
    "time": "2023-06-06T18:06:18.000Z",
    "tweet_text": "I love a Jack Mallers rant. \nThis one from July 2021, on Brian Armstrong and Coinbase. \nChoose your fighter. \nJack vs Brian. \nI choose Jack."
},
{
    "time": "2023-06-06T17:10:14.000Z",
    "tweet_text": "Tonight, our special episode of @SystemUpdate_, live at 7pm ET:  \n\nToday is the 10-year anniversary of the start of the Snowden reporting, that revealed NSA was illegally spying on millions of Americans.   \n\nI'll speak with @Snowden and Laura Poitras:"
},
{
    "time": "2023-06-06T13:45:37.000Z",
    "tweet_text": "Yes.",
    "repost_text": "is ETH a security jack?"
},
{
    "time": "2023-06-06T13:38:44.000Z",
    "tweet_text": "",
    "repost_text": "Coinbase should pivot back to being focused on #Bitcoin"
},
{
    "time": "2023-06-05T19:06:21.000Z",
    "tweet_text": "YouTube has deleted this interview between Robert F Kennedy Jr and Mike Tyson. \n\nIn it, RFK JR claimed the CIA assassinated his father."
},
{
    "time": "2023-06-05T22:51:23.000Z",
    "tweet_text": "BIG THANKS to @elonmusk @DavidSacks @TulsiGabbard @balajis @RealOmeedMalik @shellenberger @kellyslater for engaging + enjoyable @TwitterSpaces. I appreciate all that attended. Visit http://Kennedy24.com to learn more + sign up to volunteer + donate "
},
{
    "time": "2023-06-05T18:32:11.000Z",
    "tweet_text": "On now",
    "repost_text": "https://twitter.com/i/spaces/1PlJQpmkngnGE…"
},
{
    "time": "2023-06-05T18:20:03.000Z",
    "tweet_text": "https://twitter.com/i/spaces/1PlJQpmkngnGE…"
},
{
    "time": "2023-06-05T18:06:25.000Z",
    "tweet_text": "https://twitter.com/i/spaces/1PlJQpmkngnGE…"
},
{
    "time": "2023-06-04T14:27:34.000Z",
    "tweet_text": "Set a reminder for my upcoming Space with @ElonMusk and moderator @DavidSacks!"
},
{
    "time": "2023-06-04T20:48:25.000Z",
    "tweet_text": "He can and will"
},
{
    "time": "2023-06-04T18:40:47.000Z",
    "tweet_text": "End of an empire"
},
{
    "time": "2023-06-04T14:40:50.000Z",
    "tweet_text": "Hosting @RobertKennedyJr’s upcoming Space"
},
{
    "time": "2023-06-01T19:32:15.000Z",
    "tweet_text": "Open the Democrat primaries and debates. This isn’t fair to anyone.",
    "repost_text": "some top Democrats have privately been saying for months that they’re nervous about Biden tripping again on the trail. Today he did—>"
},
{
    "time": "2023-05-28T16:51:13.000Z",
    "tweet_text": "The “from Earth” attribute is great"
},
{
    "time": "2023-05-27T09:59:53.000Z",
    "tweet_text": "Whoever controls the media controls the mind."
},
{
    "time": "2023-05-27T02:14:07.000Z",
    "tweet_text": "America has a problem"
},
{
    "time": "2023-05-26T00:15:55.000Z",
    "tweet_text": "truly open ai",
    "repost_text": "I can't believe I've just fine-tuned a 33B-parameter LLM on Google Colab in a few hours.\n\nInsane announcement for any of you using open-source LLMs on normal GPUs! \n\nA new paper has been released, QLoRA, which is nothing short of game-changing for the ability to train and…"
},
{
    "time": "2023-05-25T10:30:15.000Z",
    "tweet_text": "Better than Signal? Looks promising."
},
{
    "time": "2023-05-25T13:48:51.000Z",
    "tweet_text": "Ok this is really good. A few bugs and UX issues but great foundation. Love that it’s public domain."
},
{
    "time": "2023-05-24T02:43:13.000Z",
    "tweet_text": "Splinter the CIA, NSA, and FBI into a thousand pieces and scatter them into the winds. \n\nhttps://i.natgeofe.com/k/263f6ee3-a2ec-42e1-b589-69e2ec103075/jfk-portrait_square.jpg…"
},
{
    "time": "2023-01-31T22:38:09.000Z",
    "tweet_text": "a milestone for open protocols...\n\n#nostr is now officially on the Apple App Store with @damusapp:"
},
{
    "time": "2023-01-31T22:38:10.000Z",
    "tweet_text": "and Google Play Store: https://play.google.com/store/apps/details?id=com.vitorpamplona.amethyst&hl=en…\n\nand of course, the open web: https://snort.social (one of many)"
},
{
    "time": "2023-01-01T06:00:30.000Z",
    "tweet_text": "pura vida"
},
{
    "time": "2022-12-26T09:05:33.000Z",
    "tweet_text": "France has the 4th largest gold reserve in the world. How? \nFrance holds 90% of the gold reserves of 15 African countries and pays 0% interest on what it makes from those reserves since 1945. These nations however borrow from #France from their own reserves with interest!"
},
{
    "time": "2022-12-24T19:49:04.000Z",
    "tweet_text": "The more things change, the more they stay the same. The only solution is taking platforms out of the moderation game. The content-layer of the internet should be moved to neutral protocols.\n\n*You* should be the one who decides what you can read. Not a company. Not a government.",
    "repost_text": "16.The government was in constant contact not just with Twitter but with virtually every major tech firm."
},
{
    "time": "2022-12-24T17:39:06.000Z",
    "tweet_text": "Great STL coffee and people at @NWCoffeeEst1993"
},
{
    "time": "2022-04-26T15:57:56.000Z",
    "tweet_text": "I've been using Twitter for the last 16 years. I've seen many changes, ups and downs, great things and awful things! But just like all good conversations, it will keep going and evolving as we grow and develop."
},
{
    "time": "2022-12-19T20:21:08.000Z",
    "tweet_text": "TFTC rip 384 is live! Marty sat down w/ @jb55 to discuss:\n\n- Nostr's grant from @jack\n- How the grant will be disbursed\n- Need for better scalability and security\n- Nostr client competition\n- A return to what the web was supposed to be\n- much more\n\nPeep. Share. Subscribe. ENGAGE."
},
{
    "time": "2022-12-19T21:42:17.000Z",
    "tweet_text": "Something that hasn't really been mentioned recently is http://nvote.co, a reddit clone built on Nostr:"
},
{
    "time": "2022-12-19T00:05:54.000Z",
    "tweet_text": "cool",
    "repost_text": "ok nostr is really cool\n\nexample - instead of emailing info between your phone / computer (e.g. BTC address), you can use this tool built on nostr: https://sendstr.com"
},
{
    "time": "2022-12-18T17:55:43.000Z",
    "tweet_text": "What a game wow"
},
{
    "time": "2022-12-18T17:39:11.000Z",
    "tweet_text": ""
},
{
    "time": "2022-12-18T16:52:34.000Z",
    "tweet_text": "wow"
},
{
    "time": "2022-12-18T00:16:23.000Z",
    "tweet_text": "Great",
    "repost_text": "FINALLY! https://bleepingcomputer.com/news/security/google-introduces-end-to-end-encryption-for-gmail-on-the-web/…"
},
{
    "time": "2022-12-18T00:07:40.000Z",
    "tweet_text": "any one in Africa willing to run a nostr relay? #bitcoin https://sr.ht/~gheartsfield/nostr-rs-relay/…\n\nNeeds in Central and South America too…"
},
{
    "time": "2022-12-18T00:13:30.000Z",
    "tweet_text": "Current coverage: http://nostr.watch"
},
{
    "time": "2022-12-17T15:35:51.000Z",
    "tweet_text": "payments already built in",
    "repost_text": "Cool @damusapp feature. If you post a bolt11 it will parse and show a widget like this. Clicking it will open up your lightning app for payment. Other invoice formats coming soon!"
},
{
    "time": "2022-12-17T02:51:32.000Z",
    "tweet_text": "Verifying my account on nostr\n\nMy Public Key: \"npub1sg6plzptd64u62a878hep2kev88swjh3tw00gjsfl8f237lmu63q0uf63m\"\n\nFind others at https://nostr.directory @nostrdirectory #nostr"
},
{
    "time": "2022-12-16T15:07:14.000Z",
    "tweet_text": "WBD594 - The Reformed Libertarian with Mike Brock (@brockm). We discuss:\n- Libertarianism being an incomplete view\n- Social rights protecting economic rights\n- The importance of liberal democracy\n- #Bitcoin changing central banks’ incentives\n\nhttps://whatbitcoindid.com/podcast/the-reformed-libertarian…"
},
{
    "time": "2022-12-16T22:20:19.000Z",
    "tweet_text": "good conversation",
    "repost_text": "For a deeper conversation about this important issue, listen to today's episode of @thehonestlypod with @RoKhanna: \nhttps://open.spotify.com/episode/2Kpc4m0GOduvtRKIXE4ZOh?si=Ul6Y7wBcRWWhD15b2j7xvw…"
},
{
    "time": "2022-12-15T20:36:51.000Z",
    "tweet_text": "Here all you need to know about #nostr in spanish with @cameri",
    "repost_text": "L164 - Nostr: solucionando la censura de una vez por todas, con Ricardo @cameri \n 1/ Tratamos:\n- qué es Nostr\n- red social o protocolo\n- Nostr vs Mastodon\n- por qué es incensurable\n- cómo funciona\n- relays, clientes, eventos\n- cómo empezar\n\nY mucho más\nhttp://bit.ly/L164_Nostr"
},
{
    "time": "2022-12-13T22:59:02.000Z",
    "tweet_text": "There's a lot of conversation around the #TwitterFiles. Here's my take, and thoughts on how to fix the issues identified. I'II start with the principles I've come to believe based on everything l've learned and experienced through my past actions as a Twitter co-founder and lead:"
},
{
    "time": "2022-12-15T23:43:00.000Z",
    "tweet_text": "working on granting $1mm per year for @torproject now"
},
{
    "time": "2022-12-16T14:12:32.000Z",
    "tweet_text": "working on granting $1m to @calyxinstitute now"
},
{
    "time": "2022-12-14T02:31:00.000Z",
    "tweet_text": "excellent writeup of problems and solutions...excited to see this. and public domain:"
},
{
    "time": "2022-12-15T23:42:22.000Z",
    "tweet_text": "14 BTC deployed to @fiatjaf for #nostr"
},
{
    "time": "2022-12-15T22:18:06.000Z",
    "tweet_text": "This is great",
    "repost_text": "Introducing Bird SQL, a Twitter search interface that is powered by Perplexity’s structured search engine. It uses OpenAI Codex to translate natural language into SQL, giving everyone the ability to navigate large datasets like Twitter.\nhttp://perplexity.ai/sql"
},
{
    "time": "2022-12-15T20:43:51.000Z",
    "tweet_text": "Jay is a master at this"
},
{
    "time": "2022-12-15T18:30:02.000Z",
    "tweet_text": "would def recommend #bitcoin twitter to check out #nostr. I think you'll like...\n\nvia web: http://coracle.social or iOS: https://testflight.apple.com/join/CLwjLxWl"
},
{
    "time": "2022-12-14T20:41:22.000Z",
    "tweet_text": "Hov did. Mr. Carter shares his best of 2022 \nhttps://tidal.com/browse/playlist/af1d0cda-a574-42b0-a17f-1997b7eae129… #TIDAL "
},
{
    "time": "2022-12-14T18:19:06.000Z",
    "tweet_text": "Rogue nations, oligarchs and drug lords are using US dollars to launder billions, evade sanctions, and finance terrorism. Just FYI.",
    "repost_text": "Rogue nations, oligarchs and drug lords are using crypto to launder billions, evade sanctions and finance terrorism. My bipartisan bill puts common-sense rules in place to help close crypto money laundering loopholes and protect our national security.\nhttps://cnn.com/2022/12/14/business/elizabeth-warren-bipartisan-crypto-crackdown/index.html?utm_medium=social&utm_source=twCNN&utm_term=link&utm_content=2022-12-14T11%3A54%3A07…"
},
{
    "time": "2022-12-14T20:55:19.000Z",
    "tweet_text": ""
},
{
    "time": "2022-12-14T18:00:24.000Z",
    "tweet_text": "Damus the iOS client for #nostr is pretty interesting https://testflight.apple.com/join/CLwjLxWl"
},
{
    "time": "2022-12-14T20:25:54.000Z",
    "tweet_text": "And a super clean mobile web client for #nostr https://twitter.com/hodlbod/status/1603098733469925376?s=20&t=lkRMZ1QlNRpbctXniNAokw…"
},
{
    "time": "2022-12-13T22:59:03.000Z",
    "tweet_text": "I don't want to edit everything into 280 char chunks, so here's the rest: https://getrevue.co/profile/jackjack/issues/a-native-internet-protocol-for-social-media-1503112…"
},
{
    "time": "2022-12-14T17:02:47.000Z",
    "tweet_text": "well...after 17 hours, my career as a newsletter writer is coming to an end. post now here: https://pastebin.com/HnBUM33b"
},
{
    "time": "2022-12-14T15:58:32.000Z",
    "tweet_text": "Apple's Advanced Data Protection seems great. Not sure about the recovery code method though. And Private Relay is out of beta..."
},
{
    "time": "2022-12-14T01:43:40.000Z",
    "tweet_text": "Help @TIDAL build the future of music streaming"
},
{
    "time": "2022-12-13T20:34:48.000Z",
    "tweet_text": "Messi. "
},
{
    "time": "2022-12-13T20:34:50.000Z",
    "tweet_text": "Great app for following World Cup"
},
{
    "time": "2022-12-13T17:45:17.000Z",
    "tweet_text": "wow https://llnl.gov/news/national-ignition-facility-achieves-fusion-ignition…"
},
{
    "time": "2022-12-11T19:59:11.000Z",
    "tweet_text": "Wish I could stay longer & surf in #Ghana But stoked to get a bit of swell and glassy conditions!!\n\n@satsminded\n@SpecialAf\n\nDrone@RunwithBitcoin \n\nAnd who knows, if the little #Bitcoin seeds we planted find fertile ground, we might be back sooner than we think.."
},
{
    "time": "2022-12-10T18:45:33.000Z",
    "tweet_text": "#HumanRightsDay marks the 4387th day that Julian Assange's human rights have been denied.\n\nDenied due process. Denied the asylum he was granted. Denied the rule of law. All to hold him in the UK for a show trial and effective death sentence in the US... for publishing the truth."
},
{
    "time": "2022-12-10T19:18:41.000Z",
    "tweet_text": "#fra"
},
{
    "time": "2022-12-10T18:08:21.000Z",
    "tweet_text": "The @Strike send globally feature is amazing\n\nI just sent $5 from my US dollar balance to @bernard_parah in Lagos, and in under 2 minutes he received the value as naira in his Nigerian account\n\nAll I had to enter was his phone number, bank account, bank name\n\nMade possible by "
},
{
    "time": "2022-12-10T17:13:54.000Z",
    "tweet_text": "wow Morocco "
},
{
    "time": "2022-12-10T15:19:47.000Z",
    "tweet_text": "http://gama.africa"
},
{
    "time": "2022-12-09T21:55:19.000Z",
    "tweet_text": "facts",
    "repost_text": "The Afro Bitcoin Conference was the most high signal bitcoin event I’ve ever been too.  I’m speechless.   Congrats @AfroBitcoinOrg"
},
{
    "time": "2022-12-09T10:58:13.000Z",
    "tweet_text": "0.0.0"
},
{
    "time": "2022-12-09T10:58:16.000Z",
    "tweet_text": "off 0"
},
{
    "time": "2022-12-09T10:59:46.000Z",
    "tweet_text": "(finally)"
},
{
    "time": "2022-12-09T08:07:13.000Z",
    "tweet_text": "Powering a rural Kenya village and securing the #Bitcoin network with excess hydropower, all while lowering rates to 2000 people (500 families, ~$10/month to $4).  @GridlessCompute"
},
{
    "time": "2022-12-09T04:21:59.000Z",
    "tweet_text": "#FreeCiham",
    "repost_text": "Today it’s been exactly 10 years since Ciham Ali was illegally arrested in #Eritrea. I urge as many of you to light a candle and do 10 minutes of silence (one for each year) in her honour today. \n\nWe love you Ciham and will never stop fighting for your release  #FreeCiham"
},
{
    "time": "2022-12-08T19:47:04.000Z",
    "tweet_text": "Thanks for the conversation @iHub! "
},
{
    "time": "2022-12-08T19:25:07.000Z",
    "tweet_text": "",
    "repost_text": "It is my pleasure to introduce Sats4Unga. Its a #Bitcoin project I have been working on with @hafeezbana \n\nThis makes it possible for people in #Kenya to receive #Bitcoin donations to buy maize meal A.K.A Unga.\n\nWith the current drought, this brings +Ve social economic change"
},
{
    "time": "2022-12-08T17:33:51.000Z",
    "tweet_text": ""
},
{
    "time": "2022-11-18T18:43:03.000Z",
    "tweet_text": "Salvador Dalí (1904-1989)\nPlaying Cards"
},
{
    "time": "2022-12-08T11:36:03.000Z",
    "tweet_text": "has any company/org successfully replaced @slackhq with IRC?"
},
{
    "time": "2022-12-08T12:56:44.000Z",
    "tweet_text": "@IglooIRC ftw"
},
{
    "time": "2022-12-08T12:09:36.000Z",
    "tweet_text": "What an amazing time we all had at the Africa Bitcoin Conference.\n\nWe can all say that it was a huge success.\nThank you to all of you who made this possible. \n@Farida_N \n\nWe can’t wait for 2023.\n#biggerandbetter.\n\n#AfroBitcoin\n#ABC2022\n#Bitcoin"
},
{
    "time": "2022-12-08T12:33:12.000Z",
    "tweet_text": "1°S "
},
{
    "time": "2022-12-08T07:27:30.000Z",
    "tweet_text": "[WATCH] Introducing The Green Africa Mining Alliance of Africa (GAMA)\n\n“We started mining and realized there are certainly other people who mine in Africa. We found a few other companies. There are now 5 members.\" - @whiteafrican\nhttps://bitcoinke.io/2022/12/introducing-africa-bitcoin-mining-alliance/… @GAMA_alliance @jack"
},
{
    "time": "2022-12-07T23:40:13.000Z",
    "tweet_text": "",
    "repost_text": "It was awesome meeting this star! Samara (@SamaraOsae) is a media personality. I felt so happy and inspired watching her interview great bitcoiners for her YouTube channel. \n\nI believe she'll do great things in the #bitcoin space. \n\nLet's support her work. "
},
{
    "time": "2022-12-07T17:27:43.000Z",
    "tweet_text": "\"In Europe & in the US, #Bitcoin is a desire. In Africa and in some other countries, #Bitcoin is a necessity.\"\n- @jack from @AfroBitcoinOrg  \nFull ITW coming soon on GAC ..."
},
{
    "time": "2022-12-07T20:47:58.000Z",
    "tweet_text": ""
},
{
    "time": "2022-12-07T18:40:04.000Z",
    "tweet_text": "Finally got to meet the excellent @btrustteam in person #bitcoin"
},
{
    "time": "2022-12-07T18:35:39.000Z",
    "tweet_text": ""
},
{
    "time": "2022-12-07T18:34:54.000Z",
    "tweet_text": "HRF brought together some incredible activists from all over Africa "
},
{
    "time": "2022-12-07T08:50:03.000Z",
    "tweet_text": "likely",
    "repost_text": "It would be so amazing to see Africa lead the world into a #Bitcoin future while the arrogance of western governments leaves them playing catch up after the momentum becomes inescapable  x.com/MrHodl/status/…"
},
{
    "time": "2022-12-06T23:24:32.000Z",
    "tweet_text": "US Officials Concern Troll About World Press Freedoms While Assaulting Them\nhttps://caitlinjohnstone.substack.com/p/us-officials-concern-troll-about…"
},
{
    "time": "2022-12-06T20:49:10.000Z",
    "tweet_text": "Send Globally \n\nStrike users can now send US Dollars direct to banks and mobile money accounts in Nigeria, Ghana, and Kenya.\n\n#Bitcoin, as an open, global, instant, free settlement network, is starting to act as the payment rail for the world.\n\nhttp://businesswire.com/news/home/20221206005453/en/Strike-Launches-Lightning-Fast-Money-Transfers-to-Africa…"
},
{
    "time": "2022-12-06T08:03:47.000Z",
    "tweet_text": "BREAKING\n\nJack Dorsey’s Block Inc Leads $2 Million Investment in Kenya Based Bitcoin Mining Company Gridless \nhttps://kenyanwallstreet.com/jack-dorseys-block-inc-leads-2-million-investment-in-kenya-based-bitcoin-mining-company-gridless/…"
},
{
    "time": "2022-12-06T17:44:15.000Z",
    "tweet_text": "#mor!"
},
{
    "time": "2022-12-06T17:01:42.000Z",
    "tweet_text": ""
},
{
    "time": "2022-12-06T14:36:13.000Z",
    "tweet_text": "#bitcoin as a tool for civil resistance"
},
{
    "time": "2022-12-06T13:43:45.000Z",
    "tweet_text": "Thank you for the partnership, and continuing to secure the #Bitcoin network!",
    "repost_text": "We are excited to announce a $2M financing round led by @HelloStillmark and @blocks as we use bitcoin mining to increase energy access across Africa and further distribute and secure the bitcoin network. \n\nhttps://gridlesscompute.com/2022/12/06/gridless-a-bitcoin-mining-company-in-east-africa-raises-2m-in-funding-led-by-stillmark-and-block-inc/…"
},
{
    "time": "2022-12-06T12:39:28.000Z",
    "tweet_text": "Afro #Bitcoin Fellowship is doing great work https://afrobitcoin.org/fellowship"
},
{
    "time": "2022-12-05T22:18:52.000Z",
    "tweet_text": "",
    "repost_text": "Working with #bitcoin is best long-term career path in Africa, \"because at the end of the day, #bitcoin is the tool that will lead us to financial freedom on the continent\" \n\n> @ihate1999 at the African #Bitcoin Confrence \n\nhttps://twitter.com/i/status/1599786479039180801/video/1…"
},
{
    "time": "2022-12-05T16:11:32.000Z",
    "tweet_text": "upside down world"
},
{
    "time": "2022-12-05T17:53:46.000Z",
    "tweet_text": ""
},
{
    "time": "2022-12-05T09:58:25.000Z",
    "tweet_text": "At the opening of @AfroBitcoinOrg here in Accra, @Farida_N reminds us that the banking system in Africa is a colonial framework that excludes and exploits the vast majority\n\nOpen, sound, borderless, decentralized, digital, censorship-resistant freedom money is a way out\n\n "
},
{
    "time": "2022-12-01T17:28:38.000Z",
    "tweet_text": "I finally get it"
},
{
    "time": "2022-12-01T20:15:26.000Z",
    "tweet_text": "#CRC!"
},
{
    "time": "2022-11-30T22:41:17.000Z",
    "tweet_text": "Slow motion videos of objects falling in water, with highly unexpected but extremely satisfying geometries and shapes. \nSource @FrRonconi"
},
{
    "time": "2022-12-01T18:47:00.000Z",
    "tweet_text": "The women of the Berezka Dance Ensemble move with short steps that make them look like they're floating."
},
{
    "time": "2022-12-01T18:18:59.000Z",
    "tweet_text": "I meet so many people who read twitter every day, but almost never tweet.\n\nIf I may beg your indulgence, please add your voice to the public dialogue!"
},
{
    "time": "2022-11-30T21:54:04.000Z",
    "tweet_text": "",
    "repost_text": "Twitter 2.0:\n\nSame mission.\nFaster innovation.\nMore transparency.\n\nhttps://blog.twitter.com/en_us/topics/company/2022/twitter-2-0-our-continued-commitment-to-the-public-conversation…"
},
{
    "time": "2022-11-30T17:24:17.000Z",
    "tweet_text": "Mars is at it's closest to Earth. Here's a photo I captured of it last night using a 14\" telescope. You can clearly see the northern polar ice cap! I'm working hard to learn to overcome the challenges of planetary photography to bring you the best images of Mars at opposition."
},
{
    "time": "2022-11-29T21:38:16.000Z",
    "tweet_text": "a man among men, Chadwick was one of one "
},
{
    "time": "2022-11-28T17:05:18.000Z",
    "tweet_text": "Julian Assange is a prisoner of conscience. Free the man, and free the press."
},
{
    "time": "2022-11-28T00:23:35.000Z",
    "tweet_text": "Wow, people gather under #SitongBridge in #Beijing where lone hero #PengLifa or #PengZaizhou protested and got arrested only over a month ago. See my show on that protest: https://youtu.be/5NaYsqffsJo"
},
{
    "time": "2022-11-25T08:36:10.000Z",
    "tweet_text": "Help!\n\nChinese government is simultaneously building hundreds quarantine camps now. This new one is designed to detain 48,000 people\n\nThey can simply flip a switch to remotely turn your COVID passport to code red, then you need to do your time in a quarantine camp and pay for it."
},
{
    "time": "2022-11-27T19:15:51.000Z",
    "tweet_text": "Here's a link to the \"SBF Bill\", co-sponsored by Senators @SenStabenow (D), @JohnBoozman (R), @SenJohnThune (R) and @CoryBooker (D), all of whom were beneficiaries of SBF and FTX lobbying.\n\nIt's the Digital Commodities \"Consumer Protection\" Act. LOL"
},
{
    "time": "2022-11-27T17:37:12.000Z",
    "tweet_text": "130am in Beijing. Still going. Cries of “we want freedom, we want human rights”"
},
{
    "time": "2022-11-23T16:38:33.000Z",
    "tweet_text": "JUST IN - Chinese government remotely switched all the protesters's COVID passports to code red.\n\nMeanwhile Chinese iPhone factory workers clash with police as COVID protest turns violent."
},
{
    "time": "2022-11-25T20:58:20.000Z",
    "tweet_text": "USA and England once again fail to find anything in the Middle East."
},
{
    "time": "2022-11-24T19:38:41.000Z",
    "tweet_text": "We need a new mobile OS that’s web-only."
},
{
    "time": "2022-11-24T21:23:56.000Z",
    "tweet_text": "PWAs directory:"
},
{
    "time": "2022-11-24T21:34:36.000Z",
    "tweet_text": ""
},
{
    "time": "2022-11-24T19:49:33.000Z",
    "tweet_text": "it's just absolutely *incredible* how lego reuses pieces in their designs\n\nfor their new eiffel tower model they couldn't find the right piece for the railings... so they used HOT DOGS"
},
{
    "time": "2022-11-23T16:52:09.000Z",
    "tweet_text": "No one can break-down the \"Crypto\" scam quite like @coryklippsten . If you want to hear how Silicon Valley VC's pump & dump retail on crypto scam tokens (like @jack was warning you about), this is a crash course on how they do it.  \n#Bitcoin is different. Bitcoin is NOT \"crypto\".",
    "repost_text": "Today, @coryklippsten joins @PrestonPysh for a conversation about how “Crypto” is not #Bitcoin despite Silicon Valley Venture Capitalists trying to conflate the two as being equal.\n\nWatch: https://youtu.be/PCtEDSeRoTs\nListen: https://link.chtbl.com/BTC105\nTranscript: https://buff.ly/3quGkGz"
},
{
    "time": "2022-11-24T19:39:50.000Z",
    "tweet_text": "next block",
    "repost_text": "Bitcoin Core 24.0 is now available at https://bitcoincore.org/bin/bitcoin-core-24.0/…"
},
{
    "time": "2022-11-24T18:18:47.000Z",
    "tweet_text": "incredible game"
},
{
    "time": "2022-11-24T17:04:05.000Z",
    "tweet_text": "#GHA"
},
{
    "time": "2022-11-24T15:35:41.000Z",
    "tweet_text": "",
    "repost_text": "I'm thankful for the Internet. \n\nOne day it will be free and open, edge to edge."
},
{
    "time": "2022-11-24T00:49:40.000Z",
    "tweet_text": "BITCOIN."
},
{
    "time": "2022-11-23T22:06:39.000Z",
    "tweet_text": "Run a ponzi, steal billions, and then -- wait for it -- headline a NYT conference with the people who run Wall Street, Silicon Valley, and the global dollar system\n\n    ",
    "repost_text": "SBF confirms today he is speaking at NYT for the DealBook Summit.\n\nOther speakers include Zelensky, Zuckerberg, and Yellen.\n\nIt cost $2,499 to attend."
},
{
    "time": "2022-11-23T19:41:58.000Z",
    "tweet_text": "",
    "repost_text": "big steppers tour   (directors cut) @PrimeVideo https://KendrickLamar.lnk.to/bigstepperslive"
},
{
    "time": "2022-11-23T16:03:20.000Z",
    "tweet_text": "#crc!"
},
{
    "time": "2022-11-22T19:50:50.000Z",
    "tweet_text": "#fra"
},
{
    "time": "2022-11-20T17:10:37.000Z",
    "tweet_text": "#ECU"
},
{
    "time": "2022-11-20T02:47:28.000Z",
    "tweet_text": "Wow"
},
{
    "time": "2022-11-17T02:49:10.000Z",
    "tweet_text": "Great @Graham__Hancock"
},
{
    "time": "2022-11-16T23:26:00.000Z",
    "tweet_text": "no one",
    "repost_text": "SBF can’t be trusted. \nVitalik can’t be trusted.\nCZ can’t be trusted. \nNo one can be trusted. \n\nThat’s why we bitcoin. \n#bitcoin"
},
{
    "time": "2022-11-16T23:14:33.000Z",
    "tweet_text": "*mic drop* https://twitter.com/BitcoinClip/status/1592978343615664128/video/1…"
},
{
    "time": "2022-11-16T22:43:13.000Z",
    "tweet_text": "nobody knows anything"
},
{
    "time": "2022-11-16T18:06:27.000Z",
    "tweet_text": "Rich Spirit"
},
{
    "time": "2022-11-14T18:02:16.000Z",
    "tweet_text": "bitcoin hardware, made in Austin ",
    "repost_text": "We're making our bitcoin wallet in Texas! \nCheck out our latest post if you want to learn more about how we chose our manufacturing partner\nhttps://wallet.build/choosing-a-hardware-manufacturer/…"
},
{
    "time": "2022-11-14T02:31:01.000Z",
    "tweet_text": "The Yin & Yang of Gerry Lopez"
},
{
    "time": "2022-11-12T05:19:21.000Z",
    "tweet_text": "30"
},
{
    "time": "2022-11-11T17:10:10.000Z",
    "tweet_text": "\"How could Sequoia Capital do this? Why would they think it was a good idea? Why would they brag about it in cringe-worthy fan fiction?\n\nHonestly, why would they not?\""
},
{
    "time": "2022-11-11T13:43:36.000Z",
    "tweet_text": "you can now follow people on TIDAL",
    "repost_text": "We're finally able to share social profiles with playlists on @TIDAL. Let's connect. Drop your profiles in the thread. I wanna know what ya listening to.\nhttps://tidal.com/browse/user/32201982…"
},
{
    "time": "2022-11-08T01:02:08.000Z",
    "tweet_text": "yes",
    "repost_text": "Block (@Square) users are putting their paychecks in @CashApp per https://wsj.com/articles/cash-app-gets-the-money-11667778703… . Likely this puts Block on path to be among the largets bank like institutions in number of account holders."
},
{
    "time": "2022-11-07T16:21:55.000Z",
    "tweet_text": "Currency of Freedom starts shortly at 9am PT today\n\nTune in to hear global perspectives on why Bitcoin matters for:\n\n Humanitarianism\n\n Democracy \n\n Social activism \n\nHRF is thrilled to partner with Block on this ",
    "repost_text": "It’s a Block / @HRF joint production\nCurrency of Freedom\nMonday, 11/7\n9 am PT\nFeat. @Kasparov63, @gladstein, @YeonmiParkNK, @leopoldolopez, @RoyaMahboob, @farida_n, and more. \n\nMark your cal and register here: http://bit.ly/crncyfr"
},
{
    "time": "2022-11-06T17:30:20.000Z",
    "tweet_text": "Thanks, I'll pass.",
    "repost_text": "Former NSA or Intel community?  Come on back!  We now have a vacancy listing to fast track former employees back in.  Check it out.\nhttps://apply.intelligencecareers.gov/job-description/1196671…"
},
{
    "time": "2022-11-07T02:18:36.000Z",
    "tweet_text": "these tracking additions when sharing a tweet are a step backwards\n\nnothing needed after the ?"
},
{
    "time": "2022-11-05T15:17:00.000Z",
    "tweet_text": "Folks at Twitter past and present are strong and resilient. They will always find a way no matter how difficult the moment. I realize many are angry with me. I own the responsibility for why everyone is in this situation: I grew the company size too quickly. I apologize for that."
},
{
    "time": "2022-11-05T15:17:00.000Z",
    "tweet_text": "I am grateful for, and love, everyone who has ever worked on Twitter. I don't expect that to be mutual in this moment...or ever…and I understand. "
},
{
    "time": "2022-11-02T18:01:45.000Z",
    "tweet_text": "It’s a Block / @HRF joint production\nCurrency of Freedom\nMonday, 11/7\n9 am PT\nFeat. @Kasparov63, @gladstein, @YeonmiParkNK, @leopoldolopez, @RoyaMahboob, @farida_n, and more. \n\nMark your cal and register here: http://bit.ly/crncyfr"
},
{
    "time": "2022-11-01T13:53:01.000Z",
    "tweet_text": "On this day in 2010 a pseudonymous artist using the handle \"bitboy\" published what has become one of the most iconic logos in recent history. Thank you bitboy, wherever you are..."
},
{
    "time": "2022-10-31T02:28:32.000Z",
    "tweet_text": "https://spiral.xyz/bitcoin.pdf"
},
{
    "time": "2022-10-27T21:09:50.000Z",
    "tweet_text": "about our #bitcoin hardware…",
    "repost_text": "Check out our bitcoin wallet hardware prototypes! And learn about how we build them here: https://wallet.build/how-we-design-our-hardware/…"
},
{
    "time": "2022-10-27T18:45:38.000Z",
    "tweet_text": "$20 traveled over 10,000 km in under 10 seconds. The transfer was done from @CashApp to @Bitnob_official through the power of the lightning network. \n\nIsn't it cool? "
},
{
    "time": "2022-10-27T20:05:06.000Z",
    "tweet_text": "web5 is happening"
},
{
    "time": "2022-10-25T02:12:32.000Z",
    "tweet_text": "You can now receive #bitcoin instantly via the Lightning Network in @CashApp! \n\n- Open Cash App\n- Money tab -> Bitcoin\n- Share QR code or link\n\nWhat do you think?\n\nTry it by sharing your link below "
},
{
    "time": "2022-10-22T17:57:15.000Z",
    "tweet_text": "we live   @PrimeVideo http://amazon.com/kendricklive"
},
{
    "time": "2022-10-22T17:53:17.000Z",
    "tweet_text": "gkmc 10   the brotherhood in what we created is forever"
},
{
    "time": "2022-10-14T18:30:11.000Z",
    "tweet_text": "This Latinx Heritage Month join @TIDAL and @oye_wellness for a conversation w/ Latinx rising artists @Sanchezsammyy, La Gabi, and @Lasvillaoficial, as they share their career journeys & talk about the importance of mental health in the music industry. \n\n http://TIDAL.link/3CW2Dg4"
},
{
    "time": "2022-10-19T19:27:15.000Z",
    "tweet_text": "https://twitter.com/i/spaces/1eaKbrowqRZKX…"
},
{
    "time": "2022-10-18T17:11:00.000Z",
    "tweet_text": "What happens when you ask an AI to generate \"Human Evolution.\"\n\nThis is terrifying."
},
{
    "time": "2022-10-18T19:42:09.000Z",
    "tweet_text": "Federated social,  portable accounts, algorithmic choice (!!). \n\nDevelopers:"
},
{
    "time": "2022-10-18T18:54:56.000Z",
    "tweet_text": "foundational, @at_protocol",
    "repost_text": "Bluesky is building a social protocol. We released “ADX” (the X stood for Experiment) in May. Now that the design is starting to solidify, we’re renaming it to the “Authenticated Transport Protocol” — the “AT Protocol.” \n\nhttps://blueskyweb.xyz/blog/10-18-2022-the-at-protocol…"
},
{
    "time": "2022-10-18T17:58:04.000Z",
    "tweet_text": "Hello world!"
},
{
    "time": "2022-10-18T15:00:35.000Z",
    "tweet_text": "live from paris     this saturday 10.22  \n8pm cest / 11am pt / 2pm et"
},
{
    "time": "2022-10-17T19:22:48.000Z",
    "tweet_text": "Banks need your money. Your money doesn’t need a bank. #Bitcoin"
},
{
    "time": "2022-09-19T16:14:51.000Z",
    "tweet_text": "the idea that nuclear power is bad is costing us our future, and it’s time to let go of it.\n\nmy @TEDTalks is now live! please watch and share, i’d love to hear your thoughts  #tedtalk #nuclearpower\nhttps://go.ted.com/isabelleboemeke"
},
{
    "time": "2022-09-25T19:51:31.000Z",
    "tweet_text": "Incredible"
},
{
    "time": "2022-09-25T16:20:42.000Z",
    "tweet_text": "America’s Open Wound, ⁦@Snowden⁩  https://edwardsnowden.substack.com/p/americas-open-wound…"
},
{
    "time": "2022-09-14T20:12:07.000Z",
    "tweet_text": "https://scottmsul.substack.com/p/a-bitcoiners-guide-to-proof-of-stake…"
},
{
    "time": "2022-06-09T13:45:40.000Z",
    "tweet_text": "Mr @sc and I are funding The #Bitcoin Academy, a program for residents of Marcy Houses in Brooklyn New York where Jay grew up, designed in collaboration with @CryptoPlug3 and @BlkBTCBillions:"
},
{
    "time": "2022-09-07T23:15:30.000Z",
    "tweet_text": "An update!\n\nAt tonight’s graduation class, @sc and I offered each student a grant of $1,000 in bitcoin. Students can save, spend, or send their bitcoin however they choose to keep investing in themselves.\n\nWill continue updating this thread as time goes on..."
},
{
    "time": "2022-09-02T19:37:22.000Z",
    "tweet_text": "",
    "repost_text": "Americans can't stand the idea of any country in South America rejecting their morally repugnant, indefensible, vile and repellent domination and ultraviolence. PATHETIC."
},
{
    "time": "2022-08-18T17:33:47.000Z",
    "tweet_text": "Dear bitcoiners,\n\nI need your help to finish a fight that began back in March, 2019. \n\nhttps://defendingbtc.com"
},
{
    "time": "2022-08-15T16:09:09.000Z",
    "tweet_text": "invest in yourself tho. @pglang"
},
{
    "time": "2022-08-15T16:39:54.000Z",
    "tweet_text": "That’s money @kendricklamar @RayDalio",
    "repost_text": "Invest in yourself. That’s money. pgLang for @cashapp https://youtu.be/c84RHTQ7JyI"
},
{
    "time": "2022-08-15T15:11:01.000Z",
    "tweet_text": "Meta",
    "repost_text": "This baby Jesus sculpture at LA Museum of Art looks like Mark Zuckerberg"
},
{
    "time": "2022-08-15T05:55:33.000Z",
    "tweet_text": " @kendricklamar giving advise to a 9 year old fan at the Detroit show tonight"
},
{
    "time": "2022-08-10T17:39:55.000Z",
    "tweet_text": "on recovering access to your bitcoin...from our hardware \"wallet\" team\n\n...it's also becoming increasingly clear \"wallet\" isn't the right word for what this is.",
    "repost_text": "One of the most important jobs a bitcoin wallet has is to keep your money safe even when something goes wrong. We’ve been thinking on how to make forgiving, flexible recovery experiences, and want to hear what you think about them. A post and a .. https://wallet.build/losing-your-keys-without-losing-your-coins/…"
},
{
    "time": "2022-08-10T12:58:34.000Z",
    "tweet_text": "You’re probably reading this on a smartphone. But for Africans without Twitter on their cellphones, there’s now an easy way to send and save Bitcoin."
},
{
    "time": "2022-08-06T17:05:31.000Z",
    "tweet_text": "End the CCP",
    "repost_text": "Life in Beijing: relentless covid testing & health app that dictates where I go\nGreen code is needed to enter public areas. Red means quarantine/isolation. \nAuthorities track people's movements thru these apps. Concern is this surveillance will stay long after covid is gone \n@cnn"
},
{
    "time": "2022-07-29T14:08:37.000Z",
    "tweet_text": ""
},
{
    "time": "2022-06-26T22:24:53.000Z",
    "tweet_text": "Kendrick"
},
{
    "time": "2022-06-21T14:08:42.000Z",
    "tweet_text": "— Celebrating the Summer Solstice —\n\n      Paul Klee"
},
{
    "time": "2022-06-17T18:00:46.000Z",
    "tweet_text": ".@warriors  @kendricklamar"
},
{
    "time": "2022-06-17T02:33:23.000Z",
    "tweet_text": "steph"
},
{
    "time": "2022-06-16T21:23:50.000Z",
    "tweet_text": "nah"
},
{
    "time": "2022-06-10T18:49:13.000Z",
    "tweet_text": "Goodbye smart contracts, hello #Bitcoin. \n\nWeb3 critic @jack and his team at @TBD54566975 are out with their alternative vision for a decentralized internet: Web5. \n\n@skesslr reports from #Consensus2022"
},
{
    "time": "2022-06-10T18:31:39.000Z",
    "tweet_text": "",
    "repost_text": "Let me clear this up right now, everybody: No. There are no tokens to invest in with web5. Kthx."
},
{
    "time": "2022-06-10T17:35:32.000Z",
    "tweet_text": "this will likely be our most important contribution to the internet. proud of the team. #web5\n\n(RIP web3 VCs )\n\nhttps://developer.tbd.website/projects/web5/",
    "repost_text": "Web5: An extra decentralized web platform\nhttps://docs.google.com/presentation/d/1SaHGyY9TjPg4a0VNLCsfchoVG1yU3ffTDsPRcU99H1E/edit#slide=id.g11b904107df_0_1…"
},
{
    "time": "2022-06-10T14:06:30.000Z",
    "tweet_text": "no one knows how to measure this",
    "repost_text": "CPI is 8.6% and the NYT recently admitted the inflation truthers (us) were right so it's double digits according to the Science™\n\nhttps://nytimes.com/2022/05/24/technology/inflation-measure-cpi-accuracy.html…"
},
{
    "time": "2022-06-09T19:53:52.000Z",
    "tweet_text": "Showtime. \n\nThe Alicia + Keys Tour starts now in Birmingham, UK!!\n\nIm ready for you!!! Letsss gooooo!!!!!"
},
{
    "time": "2022-06-09T16:06:17.000Z",
    "tweet_text": "Education is Power. Our co-founder Shawn “JAY-Z” Carter and Jack Dorsey are partnering to fund The Bitcoin Academy, a program for residents of Marcy Houses, in Brooklyn, New York, where Mr. Carter grew up."
},
{
    "time": "2022-06-09T16:01:56.000Z",
    "tweet_text": "all eyes on Marcy!",
    "repost_text": "Shout out to @Jack. #Bitcoin Academy, starting in Marcy, a place that taught me so much, is hopefully the first of many. The simple goal is to provide people tools to build independence for themselves and then the community around them. http://Thebitcoinacademy.com"
},
{
    "time": "2022-06-09T15:31:30.000Z",
    "tweet_text": "Shout out to @Jack. #Bitcoin Academy, starting in Marcy, a place that taught me so much, is hopefully the first of many. The simple goal is to provide people tools to build independence for themselves and then the community around them."
},
{
    "time": "2022-06-09T14:03:59.000Z",
    "tweet_text": "We began with a mission to educate the marginalized and @sc, @jack, @CryptoPlug3 , @blocks, and @ShawnCarterSF are helping us to achieve the mission. Shoutout to @bigmarh  and @NajahRoberts for your efforts.",
    "repost_text": "Mr @sc and I are funding The #Bitcoin Academy, a program for residents of Marcy Houses in Brooklyn New York where Jay grew up, designed in collaboration with @CryptoPlug3 and @BlkBTCBillions: https://thebitcoinacademy.com"
},
{
    "time": "2022-06-09T13:45:41.000Z",
    "tweet_text": "Education is where we start. This isn’t just about bitcoin…it’s about long-term thinking, local economies, and self-confidence. Courses are free to all Marcy residents, including kids. And to make it even easier we’re providing devices and data plans for all who need it."
},
{
    "time": "2022-06-09T13:45:41.000Z",
    "tweet_text": "Thanks to the teams at @Blocks and @ShawnCarterSF for all the work to make this happen! This is just the start of the program. Much more to come soon!"
},
{
    "time": "2022-06-08T17:03:10.000Z",
    "tweet_text": " @shantell_martin",
    "repost_text": "We’ve collaborated with celebrated visual artist @shantell_martin to create the Shantell Martin Cash Card. After working with The North Face and Kendrick Lamar, Martin has partnered with us to design this glow-in-the dark Cash Card in her signature style. Order one in app today."
},
{
    "time": "2022-06-07T21:54:38.000Z",
    "tweet_text": "this is an opera. @kendricklamar is a poet and a teacher. I learn something new each listen...and I can't listen to anything else. constant spin."
},
{
    "time": "2022-06-07T19:45:51.000Z",
    "tweet_text": "Dear Mama by 2Pac (1995)\nhttps://twitter.com/samplesmedia10/status/1534254234144735233/video/1…"
},
{
    "time": "2020-10-05T13:02:19.000Z",
    "tweet_text": "Still one of the best commercials ever made "
},
{
    "time": "2022-06-07T16:36:23.000Z",
    "tweet_text": "Bitcoin is being utilized to push back against authoritarianism and tyranny all over the world. It is is helping fund the fight for democracy. So before you lump it in with other crypto nonsense, or write it off, read this first. It's important.",
    "repost_text": "Today I join 20 rights advocates from 20 countries in asking Congress to consider Bitcoin’s humanitarian impact.\n\nWestern technologists may ignore Bitcoin's role in helping tens of millions under tyranny or failed economies, but policymakers should not \nhttps://financialinclusion.tech"
},
{
    "time": "2022-06-06T19:41:27.000Z",
    "tweet_text": "TIL @waybackmachine has a snapshot of the Bitcoin project from Jan 6th, 2009. That's two days before the first binary release (with the genesis block). The project had an MIT license and contained only the whitepaper. Just in case it's relevant for anyone.\nhttps://web.archive.org/web/20090106201347/http://sourceforge.net/projects/bitcoin/…"
},
{
    "time": "2022-06-03T13:48:02.000Z",
    "tweet_text": "♪ #nowplaying Rich spirit - Kendrick Lamar (Mr. Morale & the big steppers - 2022) https://fip.fr"
},
{
    "time": "2022-05-30T19:57:55.000Z",
    "tweet_text": "",
    "repost_text": "Incentives matter. @TIDAL sets a high standard for supporting artists, capturing music culture, and delivering the best audio quality to fans.\n\n#DeleteAppleMusic\n#DeleteAmazonMusic\n#DeleteSpotify\n#DeleteYouTubeMusic\n#DeletePandora\n#DeleteDeezer\n\nSource: https://producerhive.com/music-marketing-tips/streaming-royalties-breakdown/…"
},
{
    "time": "2022-05-30T19:42:34.000Z",
    "tweet_text": "♪ #nowplaying Industry baby - Noga Erez (Industry baby - 2022) https://fip.fr"
},
{
    "time": "2022-05-30T18:54:32.000Z",
    "tweet_text": "when did the dollar lose global reserve currency status?"
},
{
    "time": "2022-05-30T16:06:29.000Z",
    "tweet_text": "2029"
},
{
    "time": "2022-05-27T12:11:41.000Z",
    "tweet_text": "“One of the many strange things about being an American citizen these days is that there’s a whole lot of killing done in our name that our government deliberately keeps secret.“\n\nI wrote about secrecy and American wars for ⁦@nytopinion⁩"
},
{
    "time": "2022-05-27T01:22:59.000Z",
    "tweet_text": "Ya know, it’s pretty damn great to be able to talk to people from all walks of life and many countries on Twitter!\n\nSo much to be learned, even from the harshest critics. \n\nBasically … I’m just saying I love all you crazy people "
},
{
    "time": "2022-05-23T12:04:08.000Z",
    "tweet_text": "my favorite email service",
    "repost_text": "Coming soon: All Proton paid plans are being upgraded with more storage, and there's no price increase for existing subscribers. We've heard your feedback and are greatly increasing storage. (1/2)"
},
{
    "time": "2022-05-20T02:07:05.000Z",
    "tweet_text": "great interview @lexfridman @TheOliverStone"
},
{
    "time": "2022-05-19T20:04:02.000Z",
    "tweet_text": "not a slip up...it's truth.",
    "repost_text": "\"The decision of one man to launch a wholly unjustified and brutal invasion of Iraq... I mean of Ukraine\"\nFormer US President George W Bush slips up and condemns Russian President Vladimir Putin's invasion of \"Iraq\"\nhttps://bbc.in/3wD9PJB"
},
{
    "time": "2022-05-19T18:02:12.000Z",
    "tweet_text": "Tomorrow join @TIDAL on Twitter Spaces as we toast to BIG on the eve of his 50th birthday. \n\nHosted by @ElliottWilson joined by special guests.\n\n#TIDALBIG50"
},
{
    "time": "2022-05-19T19:31:14.000Z",
    "tweet_text": "this song is so perfect to me https://tidal.com/browse/track/228660562…"
},
{
    "time": "2022-05-17T13:49:01.000Z",
    "tweet_text": "excited to do this tomorrow. first time we've told a cohesive story about everything we're doing and why it all fits together. it'll be a bit live and a bit pre-recorded and all fun. $sq",
    "repost_text": "Mark your calendars! @blocks' Investor Day starts Wednesday 5/18 at 8am PT. Tune in to learn more about what we’re building directly from our leadership team. To register for the event, go to: \nhttps://block.brandlive.com/investor-day-2022/en/registration…"
},
{
    "time": "2022-05-18T14:29:17.000Z",
    "tweet_text": "starting this at the top of the hour $sq"
},
{
    "time": "2022-05-18T11:31:51.000Z",
    "tweet_text": "Block is now part of the @w3c",
    "repost_text": "Today, we became a member of the @W3C, as part of our commitment to building open standards for an open web. We are committed to advancing and adopting decentralized and privacy-preserving standards for self-sovereign digital identity that benefits all. Not centralized platforms."
},
{
    "time": "2022-05-18T02:45:33.000Z",
    "tweet_text": "CASH APP REALLY SENDING YOUR BOY TO SEE KENDRICK LAMAR LIVE ON TOUR WTF "
},
{
    "time": "2022-05-18T02:55:25.000Z",
    "tweet_text": "kendrick lamar announced his album with my tweet and now cash app is giving me free tickets to see him live mantruly blessed"
},
{
    "time": "2022-05-16T11:16:59.000Z",
    "tweet_text": "\"When someone shows you who they are, believe them the first time.\"",
    "repost_text": "Them: \"#Bitcoin is a pyramid scheme\"\n\nThe US Dollar:"
},
{
    "time": "2022-05-16T02:41:18.000Z",
    "tweet_text": "Tomorrow, 32 central banks and 12 financial authorities (44 countries) will meet in El Salvador to discuss financial inclusion, digital economy, banking the unbanked, the #Bitcoin rollout and its benefits in our country."
},
{
    "time": "2022-05-13T19:10:26.000Z",
    "tweet_text": "A lot has happened over the past several weeks. I’ve been focused on the company and haven't said much publicly during this time, but I will now."
},
{
    "time": "2022-05-13T16:39:30.000Z",
    "tweet_text": "so happy we get the opportunity to support king @kendricklamar @babykeem and @TannaLeone! love to @pglang!",
    "repost_text": ".@kendricklamar is going on tour & we’re doing the presale. Special advance tickets open up to all Cash Card holders only next Thursday, May 19th. \n\nNeed a Cash Card? Order one in Cash App now—your new card number will work instantly. #CashAppPresale\nhttp://help.cash.app/presale"
},
{
    "time": "2022-05-12T19:21:45.000Z",
    "tweet_text": "21h21"
},
{
    "time": "2022-05-12T17:02:03.000Z",
    "tweet_text": "go ",
    "repost_text": "Kendrick Lamar in Accra, the Capitol of Ghana, ahead of the release of his new album"
},
{
    "time": "2022-05-11T23:01:38.000Z",
    "tweet_text": "damn.",
    "repost_text": "Mr. Morale & The Big Steppers"
},
{
    "time": "2022-05-11T18:15:28.000Z",
    "tweet_text": "Can’t seem to load or join the space I’m supposed to host now…blank"
},
{
    "time": "2022-05-11T18:19:46.000Z",
    "tweet_text": "we’ll try to do it another time then"
},
{
    "time": "2022-05-10T16:00:01.000Z",
    "tweet_text": "We wrote about how individuals and institutions can work with project founders and their communities to sustain free and open-source bitcoin projects:"
},
{
    "time": "2022-05-09T06:40:38.000Z",
    "tweet_text": "",
    "repost_text": "The Heart Part 5 https://KendrickLamar.lnk.to/HeartVideo"
},
{
    "time": "2022-05-07T14:15:20.000Z",
    "tweet_text": "the web is great"
},
{
    "time": "2022-04-29T20:40:25.000Z",
    "tweet_text": "I have tried taking a break from Twitter recently, but I must say: the company has always tried to do its best given the information it had. Every decision we made was ultimately my responsibility*. In the cases we were wrong or went too far, we admitted it and worked to correct."
},
{
    "time": "2022-04-29T20:40:29.000Z",
    "tweet_text": "Doing this work means you’re in the arena. Nothing that is said now matters. What matters is how the service works and acts, and how quickly it learns and improves. My biggest failing was that quickness part. I’m confident that part at least is being addressed, and will be fixed."
},
{
    "time": "2022-04-29T20:40:31.000Z",
    "tweet_text": "*it’s also crazy and wrong that individuals or companies bear this responsibility. As I’ve said before, I don’t believe any permanent ban (with the exception of illegal activity) is right, or should be possible. This is why we need a protocol that’s resilient to the layers above."
},
{
    "time": "2022-04-26T16:09:02.000Z",
    "tweet_text": "my brother ",
    "repost_text": "I've been using Twitter for the last 16 years. I've seen many changes, ups and downs, great things and awful things! But just like all good conversations, it will keep going and evolving as we grow and develop."
},
{
    "time": "2022-04-26T02:03:37.000Z",
    "tweet_text": "Elon’s goal of creating a platform that is “maximally trusted and broadly inclusive” is the right one. This is also @paraga’s goal, and why I chose him. Thank you both for getting the company out of an impossible situation. This is the right path...I believe it with all my heart."
},
{
    "time": "2022-04-26T02:03:37.000Z",
    "tweet_text": "I’m so happy Twitter will continue to serve the public conversation. Around the world, and into the stars!"
},
{
    "time": "2022-04-23T20:48:56.000Z",
    "tweet_text": "hi"
},
{
    "time": "2022-04-23T17:20:35.000Z",
    "tweet_text": "John Coltrane Draws a Picture Illustrating the Mathematics of Music \n\nhttps://openculture.com/2017/04/the-tone-circle-john-coltrane-drew-to-illustrate-the-theory-behind-his-most-famous-compositions-1967.html…"
},
{
    "time": "2022-04-22T22:01:55.000Z",
    "tweet_text": "Reunion of the original BTC team."
},
{
    "time": "2022-04-20T01:16:51.000Z",
    "tweet_text": "great!",
    "repost_text": "is this enables 1/4 of nuclear power plants to run 10 extra yrs, it will keep *580 million tonnes of CO2* out of the atmosphere for just $10 per tonne. sounds like a good deal to me!\n\ncalculation by @Komanoff x.com/AP/status/1516…"
},
{
    "time": "2022-04-19T17:09:12.000Z",
    "tweet_text": "least taxing way to pay taxes",
    "repost_text": "It’s tax day and @CashApp surges to #4\nI’m App Store: $SQ\n\nRemember they acquired Credit Karma Tax a year ago."
},
{
    "time": "2022-04-18T23:53:29.000Z",
    "tweet_text": "never seen this"
}
]