[
    {
        "date":"2024-04-26",
        "tweet_text":"",
        "repost_text":"Today, Consensys took an important step towards preserving access to ether and by extension the Ethereum blockchain in the U.S. We are suing the SEC and fighting back against its overzealous regulatory overreach. You can find more of my thoughts here: \n\nhttps:\/\/consensys.io\/blog\/consensys-suing-sec-to-defend-ethereum-ecosystem……"
    },
    {
        "date":"2024-04-25",
        "tweet_text":"I know ETH is a commodity. You know ETH is a commodity. The CFTC knows ETH is a commodity. It's time for the SEC to admit that it still knows ETH is a commodity too. No more games. Thank you to @Consensys for standing up against the SEC's unlawful expansion of authority.",
        "repost_text":"Today, Consensys filed a lawsuit against the Securities and Exchange Commission. \n\nThe goal behind this is to ensure that Ethereum remains a vibrant and indispensable blockchain platform and to preserve access for the countless developers, market participants, and institutions…"
    },
    {
        "date":"2024-04-20",
        "tweet_text":"Shocking",
        "repost_text":"\"Uber is a bad idea.\" - Taxis\n\n\"Airbnb is a bad idea.\" - Hotels\n\n\"Computers are a bad idea.\" - Newspapers \n\n\"#Bitcoin  is a bad idea.\" - Banks"
    },
    {
        "date":"2024-04-20",
        "tweet_text":"To the miners: Thank you for moving money forward #Bitcoin",
        "repost_text":"The fourth #Bitcoin halving is almost here.\nAnd a proper thank you is in order to the ones impacted the most.\n\nSo, to the miners…thank you for moving money forward."
    },
    {
        "date":"2024-04-14",
        "tweet_text":"Thought this was AI generated at first but appears to be real\n\nGet this man some Bitcoin ",
        "repost_text":"\"If you care about your fucking country, read Ludwig von Mises and the six lessons of the Austrian economic school, motherfuckers.\"\n\n- @moicanoufc"
    },
    {
        "date":"2024-04-10",
        "tweet_text":"DeFi will have to fight back against baseless enforcement actions even with a crystal clear court ruling against the SEC.\n\nNow is the time to contact your representatives.\n\nFind your Senators and Members of Congress at http:\/\/standwithcrypto.org and use the tooling to email and…",
        "repost_text":"Sometimes you have to laugh or else you'll cry.  Question:  how can you square the @SECGov's claim that @Uniswap acts as a broker with the Court's ruling against the @SECGov  just a handful of days ago?  Answer:  you can't.  x.com\/ammori\/status\/…"
    },
    {
        "date":"2024-04-03",
        "tweet_text":"Has been great working with @lightspark on our Lightning integration which should be launching soon ",
        "repost_text":"Thrilled to announce that @Coinbase has selected @Lightspark to enable the #Bitcoin Lightning Network across its platform and services. Yet another significant milestone for Lightning! to many millions of new people and 100+ countries coming soon! http:\/\/bit.ly\/3xkjwAH"
    },
    {
        "date":"2024-03-26",
        "tweet_text":"We’re pleased to introduce cross collateral on Coinbase International Exchange for institutional users. Now, in addition to USDC, you can leverage your existing BTC and ETH as collateral allowing you to optimize your capital efficiency and strategically expand your positions in…",
        "repost_text":null
    },
    {
        "date":"2024-03-18",
        "tweet_text":"\".@coinbase's @Ethereum L2 network @base saw a massive uptick in daily transactions following the Dencun upgrade, surging to a record 2 million  on Saturday.\"\n\n by @tikta_\n Read more: \n\nhttps:\/\/unchainedcrypto.com\/base-daily-transactions-spike-to-2-million-post-dencun-upgrade\/…",
        "repost_text":"big spike in @base transactions"
    },
    {
        "date":"2024-03-14",
        "tweet_text":"I remember that meeting!",
        "repost_text":"I met with @brian_armstrong at The Creamery in San Francisco on 7\/24\/15. He wanted to show me how his @coinbase app worked, so he sent me $1 worth of $BTC. Here it is today:"
    },
    {
        "date":"2024-03-14",
        "tweet_text":"Huge shout out to the Ethereum core devs on shipping EIP-4844. What a massive win.",
        "repost_text":null
    },
    {
        "date":"2024-03-14",
        "tweet_text":"Excited to see this go live! Layer 2 and EIP-4844 are helping crypto scale.",
        "repost_text":"A massive upgrade just went live on Ethereum (EIP-4844) that makes it radically cheaper to use\n\nBase will update at 5:00:01 PM PT today to bring these fee reductions to Base users and the rest of the Superchain"
    },
    {
        "date":"2024-03-12",
        "tweet_text":"Unfortunately there currently is no candidate who can fix this.\n\nYou can buy Bitcoin though as a way to vote with your dollars, send a clear message, and potentially even save the U.S. long term. A return to the gold standard.",
        "repost_text":"As I've said on All In 10x, I am a single-issue voter... I will vote for whoever is dedicated to stopping this madness. \n\nDon't care about anything else but spending... because we can't solve any of our other problems if we don't fix the balance sheet. x.com\/RobertMSterlin…"
    },
    {
        "date":"2024-03-12",
        "tweet_text":"This is (in part) why Bitcoin matters. It’s a return to the gold standard that we left fully in 1971. A return to financial discipline.\n\nBitcoin will be an important check and balance on excessive deficit spending which is essential to the U.S. and the dollar remaining strong.",
        "repost_text":"This is the scariest chart I’ve ever made. This is what it looks like when a country is heading toward a financial precipice.\n\nEach color shows $1T getting added to the national debt.\n\nNot that long ago, it took six years to add a bar.\n\nWe’re now adding one every 90-120 days.…"
    },
    {
        "date":"2024-03-08",
        "tweet_text":"Happy Bitcoin all time high! Another cycle, and once again the haters were wrong.\n\nAs always, trade responsibly.",
        "repost_text":null
    },
    {
        "date":"2024-02-26",
        "tweet_text":"Starting this Thursday, come see your favorite @coinbase personalities at Home Base at ETH Denver!\n\n@jessepollak, @ViktorBunin,  I, and many others will be there for builder talks, the onchain game Base Hunt, onchain art, and more!",
        "repost_text":null
    },
    {
        "date":"2024-02-12",
        "tweet_text":"JUST IN:  Spot #Bitcoin ETF inflows are accelerating ",
        "repost_text":null
    },
    {
        "date":"2024-02-15",
        "tweet_text":"Checkout http:\/\/once.com from the amazing Basecamp team! They’re now accepting crypto payments via @CommerceCB through Shopify\n\n@jasonfried and @dhh are true original thinkers, I’ve enjoyed reading all their books - such concise and clear thinking and writing",
        "repost_text":"We now accept Bitcoin as payment for ONCE\/Campfire. This is the first time we've accepted crypto as payment for our products, and we're proud to work with @Coinbase Commerce on the offering via Shopify. cc: @brian_armstrong @tobi.\n\nhttp:\/\/once.com\/campfire"
    },
    {
        "date":"2024-02-14",
        "tweet_text":"This all comes down to the forces of freedom vs. the forces of control.\n\n#Bitcoin is a force for freedom for 8 billion people.",
        "repost_text":null
    },
    {
        "date":"2024-02-12",
        "tweet_text":"JUST IN: $1.5 trillion asset manager Franklin Templeton files for spot #Ethereum ETF.",
        "repost_text":null
    },
    {
        "date":"2024-02-02",
        "tweet_text":"I like Andrew, and makes sense why he has to say that in a press conference, but the irony is that it’s actually the exact opposite\n\nThe pound (like the dollar) has no link (or backing) to any hard commodity. They can make as much of it as they want.\nBitcoin is much closer to a…",
        "repost_text":"Interesting: in BoE press conference, Andrew Bailey is very careful to draw a specific distinction between what he describes as \"unbacked\" cryptocurrencies and stablecoins. Britcoin agogo"
    },
    {
        "date":"2024-01-23",
        "tweet_text":"1\/ Execution client diversity on Ethereum is a critical concern for all of us at Coinbase. Here’s what we’re doing about it. ↓",
        "repost_text":null
    },
    {
        "date":"2024-01-18",
        "tweet_text":"Probably nothing.",
        "repost_text":"JUST IN: #Bitcoin becomes the second largest ETF commodity in the US, surpassing silver."
    },
    {
        "date":"2024-01-11",
        "tweet_text":".@Grayscale deserves a huge amount of credit for today, pushing this through the courts\n\nAbsolute legends",
        "repost_text":"We should all be grateful to @Grayscale for pushing back against the SEC’s arbitrary and capricious behavior, and clearing the way to get these spot BTC ETFs over the finish line. And of course to the DC Circuit, for affirming that the rule of law must prevail over politics. 2\/3"
    },
    {
        "date":"2023-12-04",
        "tweet_text":"El Salvador's #Bitcoin investments are in the black!\n\nAfter literally thousands of articles and hit pieces that ridiculed our supposed losses, all of which were calculated based on #Bitcoin’s market price at the time...\n\nWith the current #Bitcoin market price, if we were to sell…",
        "repost_text":null
    },
    {
        "date":"2023-12-03",
        "tweet_text":"One idea I’ve been contemplating is that Bitcoin may be the key to extending western civilization.\n\nThe natural trend of whichever country has the reserve currency is to inflate the money supply and increase deficit spending until it loses that advantage. The U.S. is somewhere on…",
        "repost_text":null
    },
    {
        "date":"2023-11-30",
        "tweet_text":"Wallet devs should grok the partial ETH staking product now available from @CoinbaseCloud: https:\/\/coinbase.com\/cloud\/discover\/customer-stories\/cb-wallet…\nExciting on multiple levels:\n* No-BS, noncustodial staking.\n* Easy integration.\n* CB continues to build onchain!\n\n@Kiln_finance has been a great partner. <3",
        "repost_text":null
    },
    {
        "date":"2023-11-21",
        "tweet_text":"Congratulations to new Argentina President Javier Milei @JMilei. Let’s talk about how we can help achieve economic freedom for the people of Argentina.\n\nLiving in Buenos Aires for a year, and learning about the history of Argentina, was part of what got me excited about Bitcoin.",
        "repost_text":null
    },
    {
        "date":"2023-11-19",
        "tweet_text":" JAVIER MILEI: #Bitcoin represents a return of money to its original creator - the private sector ",
        "repost_text":null
    },
    {
        "date":"2023-11-07",
        "tweet_text":"3iQ recently launched the world’s FIRST-EVER Ethereum staking ETF  The @3iq_corp Ether Staking ETF (TSX: ETHQ, ETHQ.U) is powered by Coinbase Cloud validators and @CoinbaseInsto custody  Read about their industry-leading innovation in our post:",
        "repost_text":null
    },
    {
        "date":"2023-10-27",
        "tweet_text":"top artist on @basepaint_xyz has earned 9 ETH so far\n\nbasepaint is incredible\n\nty @rob_0x for creating this dashboard",
        "repost_text":null
    },
    {
        "date":"2023-10-24",
        "tweet_text":"CALL TO ACTION!\n\nWe need to stop the U.S. from killing crypto \n\nThe new IRS proposals could effectively destroy DeFi & other crypto use cases\n\nThe good news? We can change this \n\n5 minutes is all it takes to leave a comment & delay the interpretation\n\nInstructions below",
        "repost_text":null
    },
    {
        "date":"2023-10-22",
        "tweet_text":"X combatting misinformation in MSM",
        "repost_text":"Last week, the @WSJ published an article claiming about $90 million worth of crypto was used to fund Hamas — a serious claim that gained significant attention. \n\nIn response to the article, anti-Bitcoin politicians directly linked the WSJ article as evidence in a letter to the…"
    },
    {
        "date":"2023-10-22",
        "tweet_text":"Yes— wrong is wrong. This reported misinformation furthers agendas that demean real human tragedy and genuine and effective efforts to thwart those who are responsible.",
        "repost_text":"Last week, the @WSJ published an article claiming about $90 million worth of crypto was used to fund Hamas — a serious claim that gained significant attention. \n\nIn response to the article, anti-Bitcoin politicians directly linked the WSJ article as evidence in a letter to the…"
    },
    {
        "date":"2023-10-11",
        "tweet_text":"Calling all Arbinauts, check out the @arbitrum features that launched this month:\n\nDEX trading with zero Coinbase fees, bridging between Ethereum and Arbitrum, and gas-free sends.\n\n→ http:\/\/coinbase.com\/wallet",
        "repost_text":null
    },
    {
        "date":"2023-10-09",
        "tweet_text":"L2 transactions accounted for 61% of all Ethereum transactions in Q3.\n\nThe growth came largely from Base’s explosive launch and the virality of @friendtech. Over a brief period near the end of the quarter, Base alone was doing more transactions than Ethereum Mainnet.\n\nOptimism…",
        "repost_text":null
    },
    {
        "date":"2023-09-29",
        "tweet_text":"Coinbase shipping BitMEX-but-legal is underrated. \n\nEx-US crypto derivatives trading volumes have been orders of magnitude greater than spot. \n\nPerp swaps have the best product market fit in crypto after Bitcoin and Etheruem.\n\nA decade in the making. Kudos to the team.",
        "repost_text":"Safe and compliant Perpetual Futures for eligible traders \n\nPerps play a critical role in crypto markets, but traders have historically taken on significant platform risk to access them\n\nExcited to enable perps from the most trusted platform in crypto!\n\nhttps:\/\/coinbase.com\/blog\/coinbase-receives-regulatory-approval-to-enable-retail-perpetual-futures…"
    },
    {
        "date":"2023-09-28",
        "tweet_text":"Thanks @brian_armstrong \n\nSo glad we have you and Coinbase standing with DeFi and fighting for the whole industry",
        "repost_text":".@brian_armstrong: “Hayden Adams of @Uniswap is an American hero. And I mean, that literally he is the kind of person that any country in the world would kill to have building the future of technology -and Elizabeth Warren called him a ‘shadowy super coder.’ He actually put that…"
    },
    {
        "date":"2023-09-22",
        "tweet_text":"One week remaining to submit a video to our Stand with Crypto @nounsprophouse round\n\nCreate a minute-long story about why you believe an onchain future is important\n\n5 ETH for the top 5 proposals. Let's go ",
        "repost_text":null
    },
    {
        "date":"2023-09-21",
        "tweet_text":"Cryptocurrency adoption looks a lot like messaging app growth circa 2010.\n\nLocal players with high fee structures, poor cross border interoperability, etc.\n\nhttps:\/\/chainalysis.com\/blog\/2023-global-crypto-adoption-index\/…\n\nHT @RachaelRad",
        "repost_text":null
    },
    {
        "date":"2023-09-13",
        "tweet_text":"The CFTC should not be creating enforcement actions against decentralized (DeFi) protocols. These are not financial service businesses, and it’s highly unlikely the Commodity Exchange Act even applies to them.\n\nMy hope is these DeFi protocols take these cases to court to…",
        "repost_text":null
    },
    {
        "date":"2023-09-13",
        "tweet_text":"The team did a great job digging into this, and we've made the decision to integrate Lightning. Bitcoin is the most important asset in crypto and we're excited to do our part to enable faster\/cheaper Bitcoin transactions. Will take some time to integrate so please be patient.",
        "repost_text":"Friends, I'm happy to say that I'm leading up this effort. DM me if you'd like to grab some time to chat Lightning support at @Coinbase. \n\nParticularly keen to get insights on lift to add support, UX flows, open source tooling, service providers, and edge cases. Thanks! x.com\/brian_armstron…"
    },
    {
        "date":"2023-08-30",
        "tweet_text":"1\/ \n\nHuge win, long live DeFi \n\nOne longtime fear of mine has been bad legal interpretation of our complex, technical industry\n\nIt’s highly motivating to see US courts hold up arguments I’ve felt deeply for years\n\nBelow are some of the most BASED  (smart) court comments",
        "repost_text":null
    },
    {
        "date":"2023-08-30",
        "tweet_text":"The shadow government in D.C. is out of control & the federal courts are our *only* remaining line of defense against the unlawful rogue behaviors of 3-letter government agencies. This decision is strong and clears a path to keep Bitcoin & blockchain innovation in the U.S.…",
        "repost_text":"Nice win for crypto this morning out of the DC Circuit—a federal appeals court one step removed from SCOTUS—with a remarkably unanimous decision from an ideologically diverse panel.\n\nThe 3 judges ruled the SEC failed to adequately explain its disparate treatment of one BTC ETF…"
    },
    {
        "date":"2023-08-30",
        "tweet_text":"Exactly - this tech cannot be uninvented",
        "repost_text":"We’re going to pass sensible crypto legislation\n\nWe’re going to build fast crypto payment apps\n\nWe’re going to use DeFi in capital markets\n\nWe’re going to leverage NFTs for consumer brands\n\nWe’re going to create an open financial system to improve the world\n\nWe’re going onchain."
    },
    {
        "date":"2023-08-29",
        "tweet_text":" JUST IN \n\nThe D.C. Circuit ruled in favor of @Grayscale in our lawsuit challenging the SEC's decision to deny $GBTC's conversion to an ETF!\n\nThank you to everyone who has been on this journey with us, especially our investors. We are grateful for your support and…",
        "repost_text":null
    },
    {
        "date":"2023-08-29",
        "tweet_text":"Milestone: 100,000 ETH bridged to @BuildOnBase ",
        "repost_text":null
    },
    {
        "date":"2023-08-25",
        "tweet_text":"100s of artists all over the world\nworking together in a positive sum way \nto create incredibly beautiful art \nthat earns them real money\n\nTHIS IS WHAT ONCHAIN IS ALL ABOUT",
        "repost_text":"Just claimed 1.608671359392884338 ETH from @basepaint_xyz for my contribution to the artwork! \n\n\n\nThanks for being part of it... "
    },
    {
        "date":"2023-08-25",
        "tweet_text":"",
        "repost_text":"Proposed treasury regs for crypto asset 'brokers' just dropped and do indeed explicitly characterize various persons involved in DeFi (including operators of websites that communicate with wallets) as brokers . I'll need to dig in more but it looks pretty bad."
    },
    {
        "date":"2023-08-23",
        "tweet_text":"",
        "repost_text":"Noun 821 to us reads as the Noun for celebrating http:\/\/onchainsummer.xyz \n\nThe ETH L2 wave is definitely starting from a solid base! @BuildOnBase \n\nIf you want to catch the ETH wave you can find the auctions at http:\/\/Nouns.wtf @nounsdao"
    },
    {
        "date":"2023-08-15",
        "tweet_text":"We're excited to announce that Fireblocks has launched support for Base mainnet, a new Ethereum L2 blockchain incubated by @coinbase. Fireblocks users can now access @BuildOnBase with the ease, efficiency, and security they’ve come to expect from our platform. Read on →…",
        "repost_text":null
    },
    {
        "date":"2023-08-09",
        "tweet_text":"I just bridged some ETH to Base. Try it - it's quite simple https:\/\/bridge.base.org\/deposit\n(You can also do it from @CoinbaseWallet)\n\nLayer 2 feels great - changes the usability of crypto.\n\nPlus you get this sweet NFT\nhttps:\/\/nft.coinbase.com\/mint\/bridgetobase…",
        "repost_text":null
    },
    {
        "date":"2023-08-09",
        "tweet_text":"Since I tweeted this in February, a vibrant ecosystem has taken shape across @BuildOnBase\n\nI look forward to seeing what builders create on Base and make available to people all over the world.",
        "repost_text":"1\/ Today, Coinbase is launching @BuildOnBase, an Ethereum layer 2 that will help improve scalability and usability of crypto, so we can bring economic freedom to 1B+ people."
    },
    {
        "date":"2023-08-09",
        "tweet_text":"Base mainnet is now live, with 100+ apps and service providers already available in the ecosystem. Anyone can explore these apps with low gas fees, fast speeds, and secure transactions settled on Ethereum.",
        "repost_text":null
    },
    {
        "date":"2023-08-07",
        "tweet_text":"In partnership with @nounsprophouse, we’re distributing 100+ ETH in grants for those building and creating on Base this summer\n\nThere are four rounds of Prop House grants:\n\n① Onchain Summer (August 9 - 21): Make art, a website, or whatever you’re inspired to for Onchain Summer…",
        "repost_text":null
    },
    {
        "date":"2023-08-02",
        "tweet_text":"We’re looking into how to best add Lightning. It’s non-trivial, but I think worth doing. I’m all for payments taking off in Bitcoin.\n\nNot sure why you think we’re ignoring Bitcoin - we’ve onboarded more people to Bitcoin than probably any company in the world.\n\nLet’s build it…",
        "repost_text":"Why do you continue to ignore bitcoin and lightning?\n\nwhat \"crypto\" is a better money transmission protocol and why?"
    },
    {
        "date":"2023-07-12",
        "tweet_text":"So @BankofAmerica just closed my personal bank account that I’ve used for 15 years. No reason given.\n\nReal reason? I do Coinbase transactions through this account for Bitcoin.\n\nThis is a war on Bitcoin & crypto. Please RT to warn others. We won’t stay silent.",
        "repost_text":null
    },
    {
        "date":"2023-07-13",
        "tweet_text":"Any other @BankofAmerica customers seeing this? If so, not ok.\n\nSee poll below",
        "repost_text":"So @BankofAmerica just closed my personal bank account that I’ve used for 15 years. No reason given.\n\nReal reason? I do Coinbase transactions through this account for Bitcoin.\n\nThis is a war on Bitcoin & crypto. Please RT to warn others. We won’t stay silent."
    },
    {
        "date":"2023-06-20",
        "tweet_text":"We are excited to release Reth v0.1.0-alpha! \n\nReth is a modular, contributor-friendly, and blazing-fast Ethereum node, in Rust, using the Apache\/MIT license.\n\nLet's unpack what is behind today's release.",
        "repost_text":null
    },
    {
        "date":"2023-06-15",
        "tweet_text":"We don't even have clarity from our government on whether ETH is a security.  One regulator says no, another regulator say yes, and yet another refuses to answer the question even testifying before Congress. It's way past time to fix that.",
        "repost_text":"“One way or the other. We're going to get clarity,” @coinbase CLO @iampaulgrewal says about the recent @SECGov allegations against the exchange.\n\n“For Coinbase and for the industry, that's a win in and of itself.”  \n\nWatch more, presented by @trondao: https:\/\/coindesk.com\/video\/coinbase-chief-legal-officer-on-sec-lawsuit\/?term=organic&utm_campaign=CoinDesk&utm_content=coindesk+tv%2CStateofCrypto%2CFirst+Mover%2Ccdtv%2Ceditorial&utm_medium=social&utm_source=twitter…"
    },
    {
        "date":"2023-06-01",
        "tweet_text":"1\/ On June 5, Coinbase Derivatives Exchange, our CFTC-regulated futures exchange, will launch BTC and ETH futures contracts for institutions.\n\nHere's what we've built :",
        "repost_text":null
    },
    {
        "date":"2023-05-24",
        "tweet_text":"BREAKING: Governor @RonDeSantis on how he would treat #crypto if he becomes president: \n\n“People in Washington don’t like it because they don’t control it. And they’re central planners and they want to have control over society, so Bitcoin represents a threat to them and so…",
        "repost_text":null
    },
    {
        "date":"2023-05-19",
        "tweet_text":"JUST IN:  Robert F. Kennedy Jr. becomes first presidential candidate to accept #Bitcoin campaign donations.",
        "repost_text":null
    },
    {
        "date":"2023-05-02",
        "tweet_text":"Coinbase will continue to innovate, build, and ship new products, no matter the regulatory climate. We will do so here in the U.S., and we will also do so globally.",
        "repost_text":"Today Coinbase launched Coinbase International Exchange @CoinbaseIntExch and will begin by offering BTC & ETH perpetual futures settled in USDC with up to 5x leverage to institutional clients in eligible jurisdictions outside of the U.S.\n\nhttps:\/\/coinbase.com\/blog\/introducing-coinbase-international-exchange…"
    },
    {
        "date":"2023-05-02",
        "tweet_text":"Today Coinbase launched Coinbase International Exchange @CoinbaseIntExch and will begin by offering BTC & ETH perpetual futures settled in USDC with up to 5x leverage to institutional clients in eligible jurisdictions outside of the U.S.",
        "repost_text":null
    }
]