[{"date":"2024-03-14","tweet_text":"W\n\n\"I will make certain declarations which I am satisfied are useful and are necessary to do justice between the parties. First, that Dr Wright is not the author of the Bitcoin White Paper. Second, Dr Wright is not the person who adopted or operated under the pseudonym Satoshi…"},{"date":"2023-08-31","tweet_text":"Imagine how Satoshi would feel if you told him that all the Bitcoin was held at exchanges, banks, and the elite, and that all we managed to accomplish was an upgraded banking infrastructure over Lightning.\n\nNow tell me why you think we are not on that path?"},{"date":"2023-08-02","tweet_text":"Africa will lead Bitcoin adoption."},{"date":"2023-08-01","tweet_text":" 6 years ago today, #Bitcoin users proved, once and for all, that miners *do not* control the protocol. \n\nToday we celebrate #Bitcoin's decentralization \n\nToday we celebrate #Bitcoin Independence Day "},{"date":"2023-07-25","tweet_text":"Looking forward to joining this Twitter Space tomorrow with leaders of the #Bitcoin community!\n\n@MartyBent @natbrunell @scottmelker @1MarkMoss @Breedlove22\nhttps:\/\/twitter.com\/i\/spaces\/1YqJDoqZMoLGV…"},{"date":"2023-07-24","tweet_text":"Seen at IETF… Every Bitcoin conference should have this!"},{"date":"2023-07-22","tweet_text":"The migration to @SimpleXChat is starting!\n\nSeems the @BitcoinReviewHQ listeners are leading the charge."},{"date":"2023-07-19","tweet_text":"Lekker Feeling is now live on YouTube!\n\nThis short film is about hope and I am so incredibly proud of it.\n\nWe are looking to raise 1 BTC for @BitcoinEkasi to support the renovation of its facilities in Mossel Bay, South Africa. \n\nInstructions on how to donate directly are…"},{"date":"2023-07-18","tweet_text":"Just a reminder that there is plenty of funding available for you to work full time on #Bitcoin and #nostr FOSS projects.\n\nApply for a grant on @OpenSats, no excuses.\n\nPs: if you already have started to code it, it's easier to get the application through."},{"date":"2023-07-07","tweet_text":"Wow. New release from Lightning Labs is WILD. \n\nA new standard for developers to connect AI to #Bitcoin and Lightning, enabling dynamic pricing for APIs, while allowing the AI to send\/hold\/receive bitcoin. \n\nFuture is here."},{"date":"2023-07-05","tweet_text":"Where can you spend Bitcoin in Costa Rica?\n\nIt's amazing what a few dedicated individuals can achieve with no investors, no token, no government support, no sponsors, no fees, using open-source software.\n\nPowered by Pure Love of Bitcoin and love of Humanity\n\n @BitcoinJungleCR"},{"date":"2023-06-29","tweet_text":"Introducing the Bitcoin Script Project, an idea.\n\nBitcoin is missing a cohesive technological narrative.\n\nOver last couple of years, Lightning shifted most of the attention towards secondary layers, leaving little exposure to the innovation & progress made around Bitcoin script."},{"date":"2023-06-27","tweet_text":"As president, I will make sure that your right to use and hold Bitcoin is inviolable. Bitcoin is not only a bulwark against totalitarianism and the manipulation of our money supply, it points the way toward a future in which government institutions are more transparent and more…"},{"date":"2023-06-16","tweet_text":"Bitcoin + nostr = 0 gatekeepers"},{"date":"2023-06-16","tweet_text":"Bitcoin and nostr are the only two truly censorship resistant technologies at scale. https:\/\/x.com\/fiatjaf\/status\/fiatjaf\/status\/1669673676663578631…"},{"date":"2023-06-13","tweet_text":"Happy to see my President @WilliamsRuto taking steps in the right direction towards the #Bitcoin standard.\n+254  tuko site.\n@ProfPLOLumumba always keeping it "},{"date":"2022-12-16","tweet_text":"WBD594 - The Reformed Libertarian with Mike Brock (@brockm). We discuss:\n- Libertarianism being an incomplete view\n- Social rights protecting economic rights\n- The importance of liberal democracy\n- #Bitcoin changing central banks’ incentives\n\nhttps:\/\/whatbitcoindid.com\/podcast\/the-reformed-libertarian…"},{"date":"2022-12-15","tweet_text":"14 BTC deployed to @fiatjaf for #nostr"},{"date":"2022-12-11","tweet_text":"Wish I could stay longer & surf in #Ghana But stoked to get a bit of swell and glassy conditions!!\n\n@satsminded\n@SpecialAf\n\nDrone@RunwithBitcoin \n\nAnd who knows, if the little #Bitcoin seeds we planted find fertile ground, we might be back sooner than we think.."},{"date":"2022-12-09","tweet_text":"Powering a rural Kenya village and securing the #Bitcoin network with excess hydropower, all while lowering rates to 2000 people (500 families, ~$10\/month to $4).  @GridlessCompute"},{"date":"2022-12-08","tweet_text":"What an amazing time we all had at the Africa Bitcoin Conference.\n\nWe can all say that it was a huge success.\nThank you to all of you who made this possible. \n@Farida_N \n\nWe can’t wait for 2023.\n#biggerandbetter.\n\n#AfroBitcoin\n#ABC2022\n#Bitcoin"},{"date":"2022-12-07","tweet_text":"\"In Europe & in the US, #Bitcoin is a desire. In Africa and in some other countries, #Bitcoin is a necessity.\"\n- @jack from @AfroBitcoinOrg  \nFull ITW coming soon on GAC ..."},{"date":"2022-12-06","tweet_text":"Send Globally \n\nStrike users can now send US Dollars direct to banks and mobile money accounts in Nigeria, Ghana, and Kenya.\n\n#Bitcoin, as an open, global, instant, free settlement network, is starting to act as the payment rail for the world.\n\nhttp:\/\/businesswire.com\/news\/home\/20221206005453\/en\/Strike-Launches-Lightning-Fast-Money-Transfers-to-Africa…"},{"date":"2022-12-06","tweet_text":"BREAKING\n\nJack Dorsey’s Block Inc Leads $2 Million Investment in Kenya Based Bitcoin Mining Company Gridless \nhttps:\/\/kenyanwallstreet.com\/jack-dorseys-block-inc-leads-2-million-investment-in-kenya-based-bitcoin-mining-company-gridless\/…"},{"date":"2022-12-06","tweet_text":"Thank you for the partnership, and continuing to secure the #Bitcoin network!"},{"date":"2022-12-06","tweet_text":"Afro #Bitcoin Fellowship is doing great work https:\/\/afrobitcoin.org\/fellowship"},{"date":"2022-12-05","tweet_text":"At the opening of @AfroBitcoinOrg here in Accra, @Farida_N reminds us that the banking system in Africa is a colonial framework that excludes and exploits the vast majority\n\nOpen, sound, borderless, decentralized, digital, censorship-resistant freedom money is a way out\n\n "},{"date":"2022-11-23","tweet_text":"No one can break-down the \"Crypto\" scam quite like @coryklippsten . If you want to hear how Silicon Valley VC's pump & dump retail on crypto scam tokens (like @jack was warning you about), this is a crash course on how they do it.  \n#Bitcoin is different. Bitcoin is NOT \"crypto\"."},{"date":"2022-11-16","tweet_text":"*mic drop* https:\/\/twitter.com\/BitcoinClip\/status\/1592978343615664128\/video\/1…"},{"date":"2022-11-07","tweet_text":"Currency of Freedom starts shortly at 9am PT today\n\nTune in to hear global perspectives on why Bitcoin matters for:\n\n Humanitarianism\n\n Democracy \n\n Social activism \n\nHRF is thrilled to partner with Block on this "},{"date":"2022-10-25","tweet_text":"You can now receive #bitcoin instantly via the Lightning Network in @CashApp! \n\n- Open Cash App\n- Money tab -> Bitcoin\n- Share QR code or link\n\nWhat do you think?\n\nTry it by sharing your link below "},{"date":"2022-10-17","tweet_text":"Banks need your money. Your money doesn’t need a bank. #Bitcoin"},{"date":"2022-06-09","tweet_text":"Mr @sc and I are funding The #Bitcoin Academy, a program for residents of Marcy Houses in Brooklyn New York where Jay grew up, designed in collaboration with @CryptoPlug3 and @BlkBTCBillions:"},{"date":"2022-08-10","tweet_text":"You’re probably reading this on a smartphone. But for Africans without Twitter on their cellphones, there’s now an easy way to send and save Bitcoin."},{"date":"2022-06-10","tweet_text":"Goodbye smart contracts, hello #Bitcoin. \n\nWeb3 critic @jack and his team at @TBD54566975 are out with their alternative vision for a decentralized internet: Web5. \n\n@skesslr reports from #Consensus2022"},{"date":"2022-06-09","tweet_text":"Education is Power. Our co-founder Shawn “JAY-Z” Carter and Jack Dorsey are partnering to fund The Bitcoin Academy, a program for residents of Marcy Houses, in Brooklyn, New York, where Mr. Carter grew up."},{"date":"2022-06-09","tweet_text":"Shout out to @Jack. #Bitcoin Academy, starting in Marcy, a place that taught me so much, is hopefully the first of many. The simple goal is to provide people tools to build independence for themselves and then the community around them."},{"date":"2022-06-07","tweet_text":"Bitcoin is being utilized to push back against authoritarianism and tyranny all over the world. It is is helping fund the fight for democracy. So before you lump it in with other crypto nonsense, or write it off, read this first. It's important."},{"date":"2022-06-06","tweet_text":"TIL @waybackmachine has a snapshot of the Bitcoin project from Jan 6th, 2009. That's two days before the first binary release (with the genesis block). The project had an MIT license and contained only the whitepaper. Just in case it's relevant for anyone.\nhttps:\/\/web.archive.org\/web\/20090106201347\/http:\/\/sourceforge.net\/projects\/bitcoin\/…"},{"date":"2022-05-16","tweet_text":"Tomorrow, 32 central banks and 12 financial authorities (44 countries) will meet in El Salvador to discuss financial inclusion, digital economy, banking the unbanked, the #Bitcoin rollout and its benefits in our country."},{"date":"2022-04-22","tweet_text":"Reunion of the original BTC team."}]